; ModuleID = 'gaussian.cu'
source_filename = "gaussian.cu"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.timeval = type { i64, i64 }
%struct.timezone = type { i32, i32 }
%struct.dim3 = type { i32, i32, i32 }
%struct.CUstream_st = type opaque
%struct.cudaDeviceProp = type { [256 x i8], i64, i64, i32, i32, i64, i32, [3 x i32], [3 x i32], i32, i64, i32, i32, i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], [2 x i32], [3 x i32], [2 x i32], [3 x i32], [3 x i32], i32, [2 x i32], [3 x i32], [2 x i32], i32, [2 x i32], [3 x i32], [2 x i32], [3 x i32], i32, [2 x i32], i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32 }

$_ZN4dim3C2Ejjj = comdat any

@Size = global i32 0, align 4, !dbg !0
@a = global float* null, align 8, !dbg !101
@b = global float* null, align 8, !dbg !102
@finalVec = global float* null, align 8, !dbg !103
@m = global float* null, align 8, !dbg !104
@fp = global %struct._IO_FILE* null, align 8, !dbg !105
@totalKernelTime = global i32 0, align 4, !dbg !111

!319 = !{!257, !257, !257}
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !321, line: 180)
!321 = !DISubprogram(name: "ceil", scope: !309, file: !309, line: 178, type: !310, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!322 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !323, line: 199)
!323 = !DISubprogram(name: "cos", scope: !309, file: !309, line: 63, type: !310, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !325, line: 218)
!325 = !DISubprogram(name: "cosh", scope: !309, file: !309, line: 72, type: !310, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!326 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !327, line: 237)
!327 = !DISubprogram(name: "exp", scope: !309, file: !309, line: 100, type: !310, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !329, line: 256)
!329 = !DISubprogram(name: "fabs", scope: !309, file: !309, line: 181, type: !310, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!330 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !331, line: 275)
!331 = !DISubprogram(name: "floor", scope: !309, file: !309, line: 184, type: !310, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !333, line: 294)
!333 = !DISubprogram(name: "fmod", scope: !309, file: !309, line: 187, type: !318, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !335, line: 315)
!335 = !DISubprogram(name: "frexp", scope: !309, file: !309, line: 103, type: !336, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!336 = !DISubroutineType(types: !337)
!337 = !{!257, !257, !184}
!338 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !339, line: 334)
!339 = !DISubprogram(name: "ldexp", scope: !309, file: !309, line: 106, type: !340, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!340 = !DISubroutineType(types: !341)
!341 = !{!257, !257, !179}
!342 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !343, line: 353)
!343 = !DISubprogram(name: "log", scope: !309, file: !309, line: 109, type: !310, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !345, line: 372)
!345 = !DISubprogram(name: "log10", scope: !309, file: !309, line: 112, type: !310, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !347, line: 391)
!347 = !DISubprogram(name: "modf", scope: !309, file: !309, line: 115, type: !348, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!348 = !DISubroutineType(types: !349)
!349 = !{!257, !257, !350}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !352, line: 403)
!352 = !DISubprogram(name: "pow", scope: !309, file: !309, line: 153, type: !318, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !354, line: 440)
!354 = !DISubprogram(name: "sin", scope: !309, file: !309, line: 65, type: !310, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !356, line: 459)
!356 = !DISubprogram(name: "sinh", scope: !309, file: !309, line: 74, type: !310, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !358, line: 478)
!358 = !DISubprogram(name: "sqrt", scope: !309, file: !309, line: 156, type: !310, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!359 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !360, line: 497)
!360 = !DISubprogram(name: "tan", scope: !309, file: !309, line: 67, type: !310, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !362, line: 516)
!362 = !DISubprogram(name: "tanh", scope: !309, file: !309, line: 76, type: !310, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !364, line: 118)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !365, line: 101, baseType: !366)
!365 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/gaussian")
!366 = !DICompositeType(tag: DW_TAG_structure_type, file: !365, line: 97, size: 64, align: 32, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !368, line: 119)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !365, line: 109, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !365, line: 105, size: 128, align: 64, elements: !370, identifier: "_ZTS6ldiv_t")
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !369, file: !365, line: 107, baseType: !218, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !369, file: !365, line: 108, baseType: !218, size: 64, align: 64, offset: 64)
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !374, line: 121)
!374 = !DISubprogram(name: "abort", scope: !365, file: !365, line: 515, type: !375, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!375 = !DISubroutineType(types: !376)
!376 = !{null}
!377 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !378, line: 122)
!378 = !DISubprogram(name: "abs", scope: !365, file: !365, line: 774, type: !379, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!379 = !DISubroutineType(types: !380)
!380 = !{!179, !179}
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !382, line: 123)
!382 = !DISubprogram(name: "atexit", scope: !365, file: !365, line: 519, type: !383, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!383 = !DISubroutineType(types: !384)
!384 = !{!179, !385}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64, align: 64)
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !387, line: 129)
!387 = !DISubprogram(name: "atof", scope: !365, file: !365, line: 144, type: !255, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !389, line: 130)
!389 = !DISubprogram(name: "atoi", scope: !365, file: !365, line: 147, type: !390, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!390 = !DISubroutineType(types: !391)
!391 = !{!179, !258}
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !393, line: 131)
!393 = !DISubprogram(name: "atol", scope: !365, file: !365, line: 150, type: !394, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!394 = !DISubroutineType(types: !395)
!395 = !{!218, !258}
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !397, line: 132)
!397 = !DISubprogram(name: "bsearch", scope: !365, file: !365, line: 754, type: !398, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!398 = !DISubroutineType(types: !399)
!399 = !{!99, !400, !400, !402, !402, !405}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !403, line: 62, baseType: !404)
!403 = !DIFile(filename: "/usr/local/bin/../lib/clang/4.0.0/include/stddef.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/gaussian")
!404 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !365, line: 741, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!179, !400, !400}
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !410, line: 133)
!410 = !DISubprogram(name: "calloc", scope: !365, file: !365, line: 468, type: !411, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!411 = !DISubroutineType(types: !412)
!412 = !{!99, !402, !402}
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !414, line: 134)
!414 = !DISubprogram(name: "div", scope: !365, file: !365, line: 788, type: !415, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!415 = !DISubroutineType(types: !416)
!416 = !{!364, !179, !179}
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !418, line: 135)
!418 = !DISubprogram(name: "exit", scope: !365, file: !365, line: 543, type: !419, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !179}
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !422, line: 136)
!422 = !DISubprogram(name: "free", scope: !365, file: !365, line: 483, type: !423, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !99}
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !426, line: 137)
!426 = !DISubprogram(name: "getenv", scope: !365, file: !365, line: 564, type: !427, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!427 = !DISubroutineType(types: !428)
!428 = !{!429, !258}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !431, line: 138)
!431 = !DISubprogram(name: "labs", scope: !365, file: !365, line: 775, type: !216, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !433, line: 139)
!433 = !DISubprogram(name: "ldiv", scope: !365, file: !365, line: 790, type: !434, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!434 = !DISubroutineType(types: !435)
!435 = !{!368, !218, !218}
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !437, line: 140)
!437 = !DISubprogram(name: "malloc", scope: !365, file: !365, line: 466, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!438 = !DISubroutineType(types: !439)
!439 = !{!99, !402}
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !441, line: 142)
!441 = !DISubprogram(name: "mblen", scope: !365, file: !365, line: 862, type: !442, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!442 = !DISubroutineType(types: !443)
!443 = !{!179, !258, !402}
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !445, line: 143)
!445 = !DISubprogram(name: "mbstowcs", scope: !365, file: !365, line: 873, type: !446, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!446 = !DISubroutineType(types: !447)
!447 = !{!402, !448, !451, !402}
!448 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DIBasicType(name: "wchar_t", size: 32, align: 32, encoding: DW_ATE_signed)
!451 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !258)
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !453, line: 144)
!453 = !DISubprogram(name: "mbtowc", scope: !365, file: !365, line: 865, type: !454, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!454 = !DISubroutineType(types: !455)
!455 = !{!179, !448, !451, !402}
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !457, line: 146)
!457 = !DISubprogram(name: "qsort", scope: !365, file: !365, line: 764, type: !458, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !99, !402, !402, !405}
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !461, line: 152)
!461 = !DISubprogram(name: "rand", scope: !365, file: !365, line: 374, type: !462, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!462 = !DISubroutineType(types: !463)
!463 = !{!179}
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !465, line: 153)
!465 = !DISubprogram(name: "realloc", scope: !365, file: !365, line: 480, type: !466, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!466 = !DISubroutineType(types: !467)
!467 = !{!99, !99, !402}
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !469, line: 154)
!469 = !DISubprogram(name: "srand", scope: !365, file: !365, line: 376, type: !470, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !112}
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !473, line: 155)
!473 = !DISubprogram(name: "strtod", scope: !365, file: !365, line: 164, type: !474, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!474 = !DISubroutineType(types: !475)
!475 = !{!257, !451, !476}
!476 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !479, line: 156)
!479 = !DISubprogram(name: "strtol", scope: !365, file: !365, line: 183, type: !480, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!480 = !DISubroutineType(types: !481)
!481 = !{!218, !451, !476, !179}
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !483, line: 157)
!483 = !DISubprogram(name: "strtoul", scope: !365, file: !365, line: 187, type: !484, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!484 = !DISubroutineType(types: !485)
!485 = !{!404, !451, !476, !179}
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !487, line: 158)
!487 = !DISubprogram(name: "system", scope: !365, file: !365, line: 716, type: !390, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !489, line: 160)
!489 = !DISubprogram(name: "wcstombs", scope: !365, file: !365, line: 876, type: !490, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!490 = !DISubroutineType(types: !491)
!491 = !{!402, !492, !493, !402}
!492 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !429)
!493 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !450)
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !497, line: 161)
!497 = !DISubprogram(name: "wctomb", scope: !365, file: !365, line: 869, type: !498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!498 = !DISubroutineType(types: !499)
!499 = !{!179, !429, !450}
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !501, entity: !503, line: 214)
!501 = !DINamespace(name: "__gnu_cxx", scope: null, file: !502, line: 220)
!502 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/x86_64-linux-gnu/c++/5.4.0/bits/c++config.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/gaussian")
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !365, line: 121, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !365, line: 117, size: 128, align: 64, elements: !505, identifier: "_ZTS7lldiv_t")
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !504, file: !365, line: 119, baseType: !120, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !504, file: !365, line: 120, baseType: !120, size: 64, align: 64, offset: 64)
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !501, entity: !509, line: 220)
!509 = !DISubprogram(name: "_Exit", scope: !365, file: !365, line: 557, type: !419, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !501, entity: !511, line: 224)
!511 = !DISubprogram(name: "llabs", scope: !365, file: !365, line: 779, type: !118, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !501, entity: !513, line: 230)
!513 = !DISubprogram(name: "lldiv", scope: !365, file: !365, line: 796, type: !514, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!514 = !DISubroutineType(types: !515)
!515 = !{!503, !120, !120}
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !501, entity: !517, line: 241)
!517 = !DISubprogram(name: "atoll", scope: !365, file: !365, line: 157, type: !518, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!518 = !DISubroutineType(types: !519)
!519 = !{!120, !258}
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !501, entity: !521, line: 242)
!521 = !DISubprogram(name: "strtoll", scope: !365, file: !365, line: 209, type: !522, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!522 = !DISubroutineType(types: !523)
!523 = !{!120, !451, !476, !179}
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !501, entity: !525, line: 243)
!525 = !DISubprogram(name: "strtoull", scope: !365, file: !365, line: 214, type: !526, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!526 = !DISubroutineType(types: !527)
!527 = !{!528, !451, !476, !179}
!528 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !501, entity: !530, line: 245)
!530 = !DISubprogram(name: "strtof", scope: !365, file: !365, line: 172, type: !531, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!531 = !DISubroutineType(types: !532)
!532 = !{!97, !451, !476}
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !501, entity: !534, line: 246)
!534 = !DISubprogram(name: "strtold", scope: !365, file: !365, line: 175, type: !535, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!535 = !DISubroutineType(types: !536)
!536 = !{!537, !451, !476}
!537 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !503, line: 254)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !509, line: 256)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !511, line: 258)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !542, line: 259)
!542 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !501, file: !543, line: 227, type: !514, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!543 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/cstdlib", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/gaussian")
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !513, line: 260)
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !517, line: 262)
!546 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !530, line: 263)
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !521, line: 264)
!548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !525, line: 265)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !534, line: 266)
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !551, line: 397)
!551 = !DISubprogram(name: "acosf", linkageName: "_ZL5acosff", scope: !552, file: !552, line: 1342, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!552 = !DIFile(filename: "/usr/local/cuda/include/math_functions.hpp", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/gaussian")
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !554, line: 398)
!554 = !DISubprogram(name: "acoshf", linkageName: "_ZL6acoshff", scope: !552, file: !552, line: 1370, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !556, line: 399)
!556 = !DISubprogram(name: "asinf", linkageName: "_ZL5asinff", scope: !552, file: !552, line: 1337, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !558, line: 400)
!558 = !DISubprogram(name: "asinhf", linkageName: "_ZL6asinhff", scope: !552, file: !552, line: 1375, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !560, line: 401)
!560 = !DISubprogram(name: "atan2f", linkageName: "_ZL6atan2fff", scope: !552, file: !552, line: 1327, type: !135, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !562, line: 402)
!562 = !DISubprogram(name: "atanf", linkageName: "_ZL5atanff", scope: !552, file: !552, line: 1332, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !564, line: 403)
!564 = !DISubprogram(name: "atanhf", linkageName: "_ZL6atanhff", scope: !552, file: !552, line: 1380, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !566, line: 404)
!566 = !DISubprogram(name: "cbrtf", linkageName: "_ZL5cbrtff", scope: !552, file: !552, line: 1430, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !568, line: 405)
!568 = !DISubprogram(name: "ceilf", linkageName: "_ZL5ceilff", scope: !569, file: !569, line: 667, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!569 = !DIFile(filename: "/usr/local/cuda/include/device_functions.hpp", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/gaussian")
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !571, line: 406)
!571 = !DISubprogram(name: "copysignf", linkageName: "_ZL9copysignfff", scope: !552, file: !552, line: 1189, type: !135, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !573, line: 407)
!573 = !DISubprogram(name: "cosf", linkageName: "_ZL4cosff", scope: !552, file: !552, line: 1243, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !575, line: 408)
!575 = !DISubprogram(name: "coshf", linkageName: "_ZL5coshff", scope: !552, file: !552, line: 1312, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !577, line: 409)
!577 = !DISubprogram(name: "erfcf", linkageName: "_ZL5erfcff", scope: !552, file: !552, line: 1490, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !579, line: 410)
!579 = !DISubprogram(name: "erff", linkageName: "_ZL4erfff", scope: !552, file: !552, line: 1480, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !581, line: 411)
!581 = !DISubprogram(name: "exp2f", linkageName: "_ZL5exp2ff", scope: !569, file: !569, line: 657, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !583, line: 412)
!583 = !DISubprogram(name: "expf", linkageName: "_ZL4expff", scope: !552, file: !552, line: 1294, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !585, line: 413)
!585 = !DISubprogram(name: "expm1f", linkageName: "_ZL6expm1ff", scope: !552, file: !552, line: 1385, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!586 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !587, line: 414)
!587 = !DISubprogram(name: "fabsf", linkageName: "_ZL5fabsff", scope: !569, file: !569, line: 607, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !589, line: 415)
!589 = !DISubprogram(name: "fdimf", linkageName: "_ZL5fdimfff", scope: !552, file: !552, line: 1616, type: !135, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !591, line: 416)
!591 = !DISubprogram(name: "floorf", linkageName: "_ZL6floorff", scope: !569, file: !569, line: 597, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !593, line: 417)
!593 = !DISubprogram(name: "fmaf", linkageName: "_ZL4fmaffff", scope: !552, file: !552, line: 1568, type: !167, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!594 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !595, line: 418)
!595 = !DISubprogram(name: "fmaxf", linkageName: "_ZL5fmaxfff", scope: !569, file: !569, line: 622, type: !135, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !597, line: 419)
!597 = !DISubprogram(name: "fminf", linkageName: "_ZL5fminfff", scope: !569, file: !569, line: 617, type: !135, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !599, line: 420)
!599 = !DISubprogram(name: "fmodf", linkageName: "_ZL5fmodfff", scope: !552, file: !552, line: 1553, type: !135, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !601, line: 421)
!601 = !DISubprogram(name: "frexpf", linkageName: "_ZL6frexpffPi", scope: !552, file: !552, line: 1543, type: !182, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!602 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !603, line: 422)
!603 = !DISubprogram(name: "hypotf", linkageName: "_ZL6hypotfff", scope: !552, file: !552, line: 1390, type: !135, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!604 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !605, line: 423)
!605 = !DISubprogram(name: "ilogbf", linkageName: "_ZL6ilogbff", scope: !552, file: !552, line: 1621, type: !177, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!606 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !607, line: 424)
!607 = !DISubprogram(name: "ldexpf", linkageName: "_ZL6ldexpffi", scope: !552, file: !552, line: 1520, type: !221, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!608 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !609, line: 425)
!609 = !DISubprogram(name: "lgammaf", linkageName: "_ZL7lgammaff", scope: !552, file: !552, line: 1515, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !611, line: 426)
!611 = !DISubprogram(name: "llrintf", linkageName: "_ZL7llrintff", scope: !552, file: !552, line: 1149, type: !229, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !613, line: 427)
!613 = !DISubprogram(name: "llroundf", linkageName: "_ZL8llroundff", scope: !552, file: !552, line: 1602, type: !229, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !615, line: 428)
!615 = !DISubprogram(name: "log10f", linkageName: "_ZL6log10ff", scope: !552, file: !552, line: 1356, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !617, line: 429)
!617 = !DISubprogram(name: "log1pf", linkageName: "_ZL6log1pff", scope: !552, file: !552, line: 1365, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !619, line: 430)
!619 = !DISubprogram(name: "log2f", linkageName: "_ZL5log2ff", scope: !552, file: !552, line: 1285, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!620 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !621, line: 431)
!621 = !DISubprogram(name: "logbf", linkageName: "_ZL5logbff", scope: !552, file: !552, line: 1626, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !623, line: 432)
!623 = !DISubprogram(name: "logf", linkageName: "_ZL4logff", scope: !552, file: !552, line: 1347, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!624 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !625, line: 433)
!625 = !DISubprogram(name: "lrintf", linkageName: "_ZL6lrintff", scope: !552, file: !552, line: 1140, type: !243, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !627, line: 434)
!627 = !DISubprogram(name: "lroundf", linkageName: "_ZL7lroundff", scope: !552, file: !552, line: 1607, type: !243, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!628 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !629, line: 435)
!629 = !DISubprogram(name: "modff", linkageName: "_ZL5modfffPf", scope: !552, file: !552, line: 1548, type: !251, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!630 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !631, line: 436)
!631 = !DISubprogram(name: "nearbyintf", linkageName: "_ZL10nearbyintff", scope: !552, file: !552, line: 1154, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!632 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !633, line: 437)
!633 = !DISubprogram(name: "nextafterf", linkageName: "_ZL10nextafterfff", scope: !552, file: !552, line: 1218, type: !135, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!634 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !635, line: 438)
!635 = !DISubprogram(name: "nexttowardf", scope: !309, file: !309, line: 294, type: !636, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!636 = !DISubroutineType(types: !637)
!637 = !{!97, !97, !537}
!638 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !635, line: 439)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !640, line: 440)
!640 = !DISubprogram(name: "powf", linkageName: "_ZL4powfff", scope: !552, file: !552, line: 1583, type: !135, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !642, line: 441)
!642 = !DISubprogram(name: "remainderf", linkageName: "_ZL10remainderfff", scope: !552, file: !552, line: 1558, type: !135, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !644, line: 442)
!644 = !DISubprogram(name: "remquof", linkageName: "_ZL7remquofffPi", scope: !552, file: !552, line: 1563, type: !279, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !646, line: 443)
!646 = !DISubprogram(name: "rintf", linkageName: "_ZL5rintff", scope: !552, file: !552, line: 1135, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !648, line: 444)
!648 = !DISubprogram(name: "roundf", linkageName: "_ZL6roundff", scope: !552, file: !552, line: 1597, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !650, line: 445)
!650 = !DISubprogram(name: "scalblnf", linkageName: "_ZL8scalblnffl", scope: !552, file: !552, line: 1530, type: !287, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !652, line: 446)
!652 = !DISubprogram(name: "scalbnf", linkageName: "_ZL7scalbnffi", scope: !552, file: !552, line: 1525, type: !221, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !654, line: 447)
!654 = !DISubprogram(name: "sinf", linkageName: "_ZL4sinff", scope: !552, file: !552, line: 1234, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !656, line: 448)
!656 = !DISubprogram(name: "sinhf", linkageName: "_ZL5sinhff", scope: !552, file: !552, line: 1317, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !658, line: 449)
!658 = !DISubprogram(name: "sqrtf", linkageName: "_ZL5sqrtff", scope: !569, file: !569, line: 907, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !660, line: 450)
!660 = !DISubprogram(name: "tanf", linkageName: "_ZL4tanff", scope: !552, file: !552, line: 1276, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !662, line: 451)
!662 = !DISubprogram(name: "tanhf", linkageName: "_ZL5tanhff", scope: !552, file: !552, line: 1322, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !664, line: 452)
!664 = !DISubprogram(name: "tgammaf", linkageName: "_ZL7tgammaff", scope: !552, file: !552, line: 1592, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !666, line: 453)
!666 = !DISubprogram(name: "truncf", linkageName: "_ZL6truncff", scope: !569, file: !569, line: 662, type: !123, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!667 = !{i32 2, !"Dwarf Version", i32 4}
!668 = !{i32 2, !"Debug Info Version", i32 3}
!669 = !{!"clang version 4.0.0 (http://llvm.org/git/clang.git 2debfe67236df81b4b386304d4aecd9fe20fc156) (http://llvm.org/git/llvm.git 9aa8644318b899329caf41dc98a12db04dee5855)"}
!670 = distinct !DISubprogram(name: "create_matrix", linkageName: "_Z13create_matrixPfi", scope: !2, file: !2, line: 66, type: !671, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false, unit: !1, variables: !673)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !96, !179}
!673 = !{}
!674 = !DILocalVariable(name: "m", arg: 1, scope: !670, file: !2, line: 66, type: !96)
!675 = !DIExpression()
!676 = !DILocation(line: 66, column: 22, scope: !670)
!677 = !DILocalVariable(name: "size", arg: 2, scope: !670, file: !2, line: 66, type: !179)
!678 = !DILocation(line: 66, column: 29, scope: !670)
!679 = !DILocalVariable(name: "i", scope: !670, file: !2, line: 67, type: !179)
!680 = !DILocation(line: 67, column: 7, scope: !670)
!681 = !DILocalVariable(name: "j", scope: !670, file: !2, line: 67, type: !179)
!682 = !DILocation(line: 67, column: 9, scope: !670)
!683 = !DILocalVariable(name: "lamda", scope: !670, file: !2, line: 68, type: !97)
!684 = !DILocation(line: 68, column: 9, scope: !670)
!685 = !DILocation(line: 69, column: 15, scope: !670)
!686 = !DILocation(line: 69, column: 14, scope: !670)
!687 = !DILocation(line: 69, column: 19, scope: !670)
!688 = !DILocation(line: 69, column: 3, scope: !670)
!689 = !DILocalVariable(name: "coe", scope: !670, file: !2, line: 69, type: !690)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, align: 32, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: -1)
!693 = !DIExpression(DW_OP_deref)
!694 = !DILocation(line: 69, column: 9, scope: !670)
!695 = !DILocalVariable(name: "coe_i", scope: !670, file: !2, line: 70, type: !97)
!696 = !DILocation(line: 70, column: 9, scope: !670)
!697 = !DILocation(line: 72, column: 9, scope: !698)
!698 = distinct !DILexicalBlock(scope: !670, file: !2, line: 72, column: 3)
!699 = !DILocation(line: 72, column: 8, scope: !698)
!700 = !DILocation(line: 72, column: 13, scope: !701)
!701 = !DILexicalBlockFile(scope: !702, file: !2, discriminator: 1)
!702 = distinct !DILexicalBlock(scope: !698, file: !2, line: 72, column: 3)
!703 = !DILocation(line: 72, column: 17, scope: !701)
!704 = !DILocation(line: 72, column: 15, scope: !701)
!705 = !DILocation(line: 72, column: 3, scope: !701)
!706 = !DILocation(line: 74, column: 22, scope: !707)
!707 = distinct !DILexicalBlock(scope: !702, file: !2, line: 73, column: 5)
!708 = !DILocation(line: 74, column: 28, scope: !707)
!709 = !DILocation(line: 74, column: 27, scope: !707)
!710 = !DILocation(line: 74, column: 18, scope: !707)
!711 = !DILocation(line: 74, column: 17, scope: !707)
!712 = !DILocation(line: 74, column: 15, scope: !707)
!713 = !DILocation(line: 74, column: 13, scope: !707)
!714 = !DILocation(line: 75, column: 9, scope: !707)
!715 = !DILocation(line: 75, column: 13, scope: !707)
!716 = !DILocation(line: 75, column: 16, scope: !707)
!717 = !DILocation(line: 75, column: 15, scope: !707)
!718 = !DILocation(line: 75, column: 8, scope: !707)
!719 = !DILocation(line: 76, column: 14, scope: !707)
!720 = !DILocation(line: 76, column: 11, scope: !707)
!721 = !DILocation(line: 76, column: 7, scope: !707)
!722 = !DILocation(line: 76, column: 13, scope: !707)
!723 = !DILocation(line: 77, column: 9, scope: !707)
!724 = !DILocation(line: 77, column: 13, scope: !707)
!725 = !DILocation(line: 77, column: 16, scope: !707)
!726 = !DILocation(line: 77, column: 15, scope: !707)
!727 = !DILocation(line: 77, column: 8, scope: !707)
!728 = !DILocation(line: 78, column: 14, scope: !707)
!729 = !DILocation(line: 78, column: 11, scope: !707)
!730 = !DILocation(line: 78, column: 7, scope: !707)
!731 = !DILocation(line: 78, column: 13, scope: !707)
!732 = !DILocation(line: 79, column: 5, scope: !707)
!733 = !DILocation(line: 72, column: 24, scope: !734)
!734 = !DILexicalBlockFile(scope: !702, file: !2, discriminator: 2)
!735 = !DILocation(line: 72, column: 3, scope: !734)
!736 = distinct !{!736, !737}
!737 = !DILocation(line: 72, column: 3, scope: !670)
!738 = !DILocation(line: 82, column: 9, scope: !739)
!739 = distinct !DILexicalBlock(scope: !670, file: !2, line: 82, column: 3)
!740 = !DILocation(line: 82, column: 8, scope: !739)
!741 = !DILocation(line: 82, column: 13, scope: !742)
!742 = !DILexicalBlockFile(scope: !743, file: !2, discriminator: 1)
!743 = distinct !DILexicalBlock(scope: !739, file: !2, line: 82, column: 3)
!744 = !DILocation(line: 82, column: 17, scope: !742)
!745 = !DILocation(line: 82, column: 15, scope: !742)
!746 = !DILocation(line: 82, column: 3, scope: !742)
!747 = !DILocation(line: 83, column: 13, scope: !748)
!748 = distinct !DILexicalBlock(scope: !749, file: !2, line: 83, column: 7)
!749 = distinct !DILexicalBlock(scope: !743, file: !2, line: 82, column: 28)
!750 = !DILocation(line: 83, column: 12, scope: !748)
!751 = !DILocation(line: 83, column: 17, scope: !752)
!752 = !DILexicalBlockFile(scope: !753, file: !2, discriminator: 1)
!753 = distinct !DILexicalBlock(scope: !748, file: !2, line: 83, column: 7)
!754 = !DILocation(line: 83, column: 21, scope: !752)
!755 = !DILocation(line: 83, column: 19, scope: !752)
!756 = !DILocation(line: 83, column: 7, scope: !752)
!757 = !DILocation(line: 84, column: 18, scope: !758)
!758 = distinct !DILexicalBlock(scope: !753, file: !2, line: 83, column: 32)
!759 = !DILocation(line: 84, column: 22, scope: !758)
!760 = !DILocation(line: 84, column: 25, scope: !758)
!761 = !DILocation(line: 84, column: 24, scope: !758)
!762 = !DILocation(line: 84, column: 27, scope: !758)
!763 = !DILocation(line: 84, column: 26, scope: !758)
!764 = !DILocation(line: 84, column: 14, scope: !758)
!765 = !DILocation(line: 84, column: 2, scope: !758)
!766 = !DILocation(line: 84, column: 4, scope: !758)
!767 = !DILocation(line: 84, column: 6, scope: !758)
!768 = !DILocation(line: 84, column: 5, scope: !758)
!769 = !DILocation(line: 84, column: 11, scope: !758)
!770 = !DILocation(line: 84, column: 10, scope: !758)
!771 = !DILocation(line: 84, column: 13, scope: !758)
!772 = !DILocation(line: 85, column: 7, scope: !758)
!773 = !DILocation(line: 83, column: 28, scope: !774)
!774 = !DILexicalBlockFile(scope: !753, file: !2, discriminator: 2)
!775 = !DILocation(line: 83, column: 7, scope: !774)
!776 = distinct !{!776, !777}
!777 = !DILocation(line: 83, column: 7, scope: !749)
!778 = !DILocation(line: 86, column: 3, scope: !749)
!779 = !DILocation(line: 82, column: 24, scope: !780)
!780 = !DILexicalBlockFile(scope: !743, file: !2, discriminator: 2)
!781 = !DILocation(line: 82, column: 3, scope: !780)
!782 = distinct !{!782, !783}
!783 = !DILocation(line: 82, column: 3, scope: !670)
!784 = !DILocation(line: 89, column: 1, scope: !670)
!785 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 92, type: !786, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, unit: !1, variables: !673)
!786 = !DISubroutineType(types: !787)
!787 = !{!179, !179, !477}
!788 = !DILocalVariable(name: "argc", arg: 1, scope: !785, file: !2, line: 92, type: !179)
!789 = !DILocation(line: 92, column: 14, scope: !785)
!790 = !DILocalVariable(name: "argv", arg: 2, scope: !785, file: !2, line: 92, type: !477)
!791 = !DILocation(line: 92, column: 26, scope: !785)
!792 = !DILocation(line: 94, column: 3, scope: !785)
!793 = !DILocalVariable(name: "verbose", scope: !785, file: !2, line: 95, type: !179)
!794 = !DILocation(line: 95, column: 9, scope: !785)
!795 = !DILocalVariable(name: "i", scope: !785, file: !2, line: 96, type: !179)
!796 = !DILocation(line: 96, column: 9, scope: !785)
!797 = !DILocalVariable(name: "j", scope: !785, file: !2, line: 96, type: !179)
!798 = !DILocation(line: 96, column: 12, scope: !785)
!799 = !DILocalVariable(name: "flag", scope: !785, file: !2, line: 97, type: !260)
!800 = !DILocation(line: 97, column: 10, scope: !785)
!801 = !DILocation(line: 98, column: 9, scope: !802)
!802 = distinct !DILexicalBlock(scope: !785, file: !2, line: 98, column: 9)
!803 = !DILocation(line: 98, column: 14, scope: !802)
!804 = !DILocation(line: 98, column: 9, scope: !785)
!805 = !DILocation(line: 99, column: 9, scope: !806)
!806 = distinct !DILexicalBlock(scope: !802, file: !2, line: 98, column: 19)
!807 = !DILocation(line: 100, column: 9, scope: !806)
!808 = !DILocation(line: 101, column: 9, scope: !806)
!809 = !DILocation(line: 102, column: 9, scope: !806)
!810 = !DILocation(line: 103, column: 9, scope: !806)
!811 = !DILocation(line: 104, column: 9, scope: !806)
!812 = !DILocation(line: 105, column: 9, scope: !806)
!813 = !DILocation(line: 106, column: 9, scope: !806)
!814 = !DILocation(line: 107, column: 9, scope: !806)
!815 = !DILocation(line: 108, column: 9, scope: !806)
!816 = !DILocation(line: 109, column: 9, scope: !806)
!817 = !DILocation(line: 110, column: 9, scope: !806)
!818 = !DILocation(line: 111, column: 9, scope: !806)
!819 = !DILocation(line: 112, column: 9, scope: !806)
!820 = !DILocation(line: 113, column: 9, scope: !806)
!821 = !DILocation(line: 114, column: 9, scope: !806)
!822 = !DILocation(line: 115, column: 9, scope: !806)
!823 = !DILocation(line: 116, column: 9, scope: !806)
!824 = !DILocation(line: 117, column: 9, scope: !806)
!825 = !DILocation(line: 118, column: 9, scope: !806)
!826 = !DILocation(line: 119, column: 9, scope: !806)
!827 = !DILocation(line: 120, column: 9, scope: !806)
!828 = !DILocation(line: 121, column: 9, scope: !806)
!829 = !DILocation(line: 128, column: 10, scope: !830)
!830 = distinct !DILexicalBlock(scope: !785, file: !2, line: 128, column: 5)
!831 = !DILocation(line: 128, column: 9, scope: !830)
!832 = !DILocation(line: 128, column: 13, scope: !833)
!833 = !DILexicalBlockFile(scope: !834, file: !2, discriminator: 1)
!834 = distinct !DILexicalBlock(scope: !830, file: !2, line: 128, column: 5)
!835 = !DILocation(line: 128, column: 15, scope: !833)
!836 = !DILocation(line: 128, column: 14, scope: !833)
!837 = !DILocation(line: 128, column: 5, scope: !833)
!838 = !DILocation(line: 129, column: 11, scope: !839)
!839 = distinct !DILexicalBlock(scope: !840, file: !2, line: 129, column: 11)
!840 = distinct !DILexicalBlock(scope: !834, file: !2, line: 128, column: 25)
!841 = !DILocation(line: 129, column: 16, scope: !839)
!842 = !DILocation(line: 129, column: 21, scope: !839)
!843 = !DILocation(line: 129, column: 11, scope: !840)
!844 = !DILocation(line: 130, column: 16, scope: !845)
!845 = distinct !DILexicalBlock(scope: !839, file: !2, line: 129, column: 28)
!846 = !DILocation(line: 130, column: 21, scope: !845)
!847 = !DILocation(line: 130, column: 14, scope: !845)
!848 = !DILocation(line: 131, column: 19, scope: !845)
!849 = !DILocation(line: 131, column: 11, scope: !845)
!850 = !DILocation(line: 133, column: 16, scope: !851)
!851 = distinct !DILexicalBlock(scope: !845, file: !2, line: 131, column: 25)
!852 = !DILocation(line: 134, column: 27, scope: !851)
!853 = !DILocation(line: 134, column: 32, scope: !851)
!854 = !DILocation(line: 134, column: 22, scope: !851)
!855 = !DILocation(line: 134, column: 20, scope: !851)
!856 = !DILocation(line: 135, column: 66, scope: !851)
!857 = !DILocation(line: 135, column: 8, scope: !851)
!858 = !DILocation(line: 137, column: 29, scope: !851)
!859 = !DILocation(line: 137, column: 36, scope: !851)
!860 = !DILocation(line: 137, column: 34, scope: !851)
!861 = !DILocation(line: 137, column: 41, scope: !851)
!862 = !DILocation(line: 137, column: 22, scope: !851)
!863 = !DILocation(line: 137, column: 12, scope: !851)
!864 = !DILocation(line: 137, column: 10, scope: !851)
!865 = !DILocation(line: 138, column: 22, scope: !851)
!866 = !DILocation(line: 138, column: 25, scope: !851)
!867 = !DILocation(line: 138, column: 8, scope: !851)
!868 = !DILocation(line: 140, column: 29, scope: !851)
!869 = !DILocation(line: 140, column: 34, scope: !851)
!870 = !DILocation(line: 140, column: 22, scope: !851)
!871 = !DILocation(line: 140, column: 12, scope: !851)
!872 = !DILocation(line: 140, column: 10, scope: !851)
!873 = !DILocation(line: 141, column: 15, scope: !874)
!874 = distinct !DILexicalBlock(scope: !851, file: !2, line: 141, column: 8)
!875 = !DILocation(line: 141, column: 13, scope: !874)
!876 = !DILocation(line: 141, column: 19, scope: !877)
!877 = !DILexicalBlockFile(scope: !878, file: !2, discriminator: 1)
!878 = distinct !DILexicalBlock(scope: !874, file: !2, line: 141, column: 8)
!879 = !DILocation(line: 141, column: 22, scope: !877)
!880 = !DILocation(line: 141, column: 20, scope: !877)
!881 = !DILocation(line: 141, column: 8, scope: !877)
!882 = !DILocation(line: 142, column: 7, scope: !878)
!883 = !DILocation(line: 142, column: 9, scope: !878)
!884 = !DILocation(line: 142, column: 11, scope: !878)
!885 = !DILocation(line: 141, column: 29, scope: !886)
!886 = !DILexicalBlockFile(scope: !878, file: !2, discriminator: 2)
!887 = !DILocation(line: 141, column: 8, scope: !886)
!888 = distinct !{!888, !889}
!889 = !DILocation(line: 141, column: 8, scope: !851)
!890 = !DILocation(line: 144, column: 29, scope: !851)
!891 = !DILocation(line: 144, column: 36, scope: !851)
!892 = !DILocation(line: 144, column: 34, scope: !851)
!893 = !DILocation(line: 144, column: 41, scope: !851)
!894 = !DILocation(line: 144, column: 22, scope: !851)
!895 = !DILocation(line: 144, column: 12, scope: !851)
!896 = !DILocation(line: 144, column: 10, scope: !851)
!897 = !DILocation(line: 145, column: 15, scope: !851)
!898 = !DILocation(line: 147, column: 16, scope: !851)
!899 = !DILocation(line: 148, column: 39, scope: !851)
!900 = !DILocation(line: 148, column: 44, scope: !851)
!901 = !DILocation(line: 148, column: 8, scope: !851)
!902 = !DILocation(line: 149, column: 24, scope: !851)
!903 = !DILocation(line: 149, column: 29, scope: !851)
!904 = !DILocation(line: 149, column: 8, scope: !851)
!905 = !DILocation(line: 150, column: 15, scope: !851)
!906 = !DILocation(line: 152, column: 16, scope: !851)
!907 = !DILocation(line: 153, column: 15, scope: !851)
!908 = !DILocation(line: 155, column: 7, scope: !845)
!909 = !DILocation(line: 156, column: 5, scope: !840)
!910 = !DILocation(line: 128, column: 21, scope: !911)
!911 = !DILexicalBlockFile(scope: !834, file: !2, discriminator: 2)
!912 = !DILocation(line: 128, column: 5, scope: !911)
!913 = distinct !{!913, !914}
!914 = !DILocation(line: 128, column: 5, scope: !785)
!915 = !DILocation(line: 159, column: 5, scope: !785)
!916 = !DILocalVariable(name: "time_start", scope: !785, file: !2, line: 161, type: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !918, line: 30, size: 128, align: 64, elements: !919, identifier: "_ZTS7timeval")
!918 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/gaussian")
!919 = !{!920, !923}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !917, file: !918, line: 32, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !922, line: 139, baseType: !218)
!922 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/gaussian")
!923 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !917, file: !918, line: 33, baseType: !924, size: 64, align: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !922, line: 141, baseType: !218)
!925 = !DILocation(line: 161, column: 20, scope: !785)
!926 = !DILocation(line: 162, column: 5, scope: !785)
!927 = !DILocation(line: 165, column: 5, scope: !785)
!928 = !DILocalVariable(name: "time_end", scope: !785, file: !2, line: 168, type: !917)
!929 = !DILocation(line: 168, column: 20, scope: !785)
!930 = !DILocation(line: 169, column: 5, scope: !785)
!931 = !DILocalVariable(name: "time_total", scope: !785, file: !2, line: 170, type: !112)
!932 = !DILocation(line: 170, column: 18, scope: !785)
!933 = !DILocation(line: 170, column: 41, scope: !785)
!934 = !DILocation(line: 170, column: 48, scope: !785)
!935 = !DILocation(line: 170, column: 69, scope: !785)
!936 = !DILocation(line: 170, column: 58, scope: !785)
!937 = !DILocation(line: 170, column: 92, scope: !785)
!938 = !DILocation(line: 170, column: 99, scope: !785)
!939 = !DILocation(line: 170, column: 122, scope: !785)
!940 = !DILocation(line: 170, column: 109, scope: !785)
!941 = !DILocation(line: 170, column: 78, scope: !785)
!942 = !DILocation(line: 170, column: 31, scope: !785)
!943 = !DILocation(line: 172, column: 9, scope: !944)
!944 = distinct !DILexicalBlock(scope: !785, file: !2, line: 172, column: 9)
!945 = !DILocation(line: 172, column: 9, scope: !785)
!946 = !DILocation(line: 173, column: 9, scope: !947)
!947 = distinct !DILexicalBlock(scope: !944, file: !2, line: 172, column: 18)
!948 = !DILocation(line: 174, column: 18, scope: !947)
!949 = !DILocation(line: 174, column: 21, scope: !947)
!950 = !DILocation(line: 174, column: 27, scope: !947)
!951 = !DILocation(line: 174, column: 9, scope: !947)
!952 = !DILocation(line: 176, column: 9, scope: !947)
!953 = !DILocation(line: 177, column: 18, scope: !947)
!954 = !DILocation(line: 177, column: 21, scope: !947)
!955 = !DILocation(line: 177, column: 27, scope: !947)
!956 = !DILocation(line: 177, column: 9, scope: !947)
!957 = !DILocation(line: 179, column: 9, scope: !947)
!958 = !DILocation(line: 180, column: 18, scope: !947)
!959 = !DILocation(line: 180, column: 21, scope: !947)
!960 = !DILocation(line: 180, column: 9, scope: !947)
!961 = !DILocation(line: 181, column: 5, scope: !947)
!962 = !DILocation(line: 182, column: 5, scope: !785)
!963 = !DILocation(line: 183, column: 9, scope: !964)
!964 = distinct !DILexicalBlock(scope: !785, file: !2, line: 183, column: 9)
!965 = !DILocation(line: 183, column: 9, scope: !785)
!966 = !DILocation(line: 184, column: 9, scope: !967)
!967 = distinct !DILexicalBlock(scope: !964, file: !2, line: 183, column: 18)
!968 = !DILocation(line: 185, column: 18, scope: !967)
!969 = !DILocation(line: 185, column: 27, scope: !967)
!970 = !DILocation(line: 185, column: 9, scope: !967)
!971 = !DILocation(line: 186, column: 5, scope: !967)
!972 = !DILocation(line: 187, column: 67, scope: !785)
!973 = !DILocation(line: 187, column: 78, scope: !785)
!974 = !DILocation(line: 187, column: 5, scope: !785)
!975 = !DILocation(line: 188, column: 47, scope: !785)
!976 = !DILocation(line: 188, column: 63, scope: !785)
!977 = !DILocation(line: 188, column: 5, scope: !785)
!978 = !DILocation(line: 193, column: 10, scope: !785)
!979 = !DILocation(line: 193, column: 5, scope: !785)
!980 = !DILocation(line: 194, column: 10, scope: !785)
!981 = !DILocation(line: 194, column: 5, scope: !785)
!982 = !DILocation(line: 195, column: 10, scope: !785)
!983 = !DILocation(line: 195, column: 5, scope: !785)
!984 = !DILocation(line: 196, column: 1, scope: !785)
!985 = distinct !DISubprogram(name: "InitProblemOnce", linkageName: "_Z15InitProblemOncePc", scope: !2, file: !2, line: 243, type: !986, isLocal: false, isDefinition: true, scopeLine: 244, flags: DIFlagPrototyped, isOptimized: false, unit: !1, variables: !673)
!986 = !DISubroutineType(types: !987)
!987 = !{null, !429}
!988 = !DILocalVariable(name: "filename", arg: 1, scope: !985, file: !2, line: 243, type: !429)
!989 = !DILocation(line: 243, column: 28, scope: !985)
!990 = !DILocation(line: 251, column: 13, scope: !985)
!991 = !DILocation(line: 251, column: 7, scope: !985)
!992 = !DILocation(line: 251, column: 5, scope: !985)
!993 = !DILocation(line: 253, column: 9, scope: !985)
!994 = !DILocation(line: 253, column: 2, scope: !985)
!995 = !DILocation(line: 255, column: 23, scope: !985)
!996 = !DILocation(line: 255, column: 30, scope: !985)
!997 = !DILocation(line: 255, column: 28, scope: !985)
!998 = !DILocation(line: 255, column: 35, scope: !985)
!999 = !DILocation(line: 255, column: 16, scope: !985)
!1000 = !DILocation(line: 255, column: 6, scope: !985)
!1001 = !DILocation(line: 255, column: 4, scope: !985)
!1002 = !DILocation(line: 257, column: 10, scope: !985)
!1003 = !DILocation(line: 257, column: 13, scope: !985)
!1004 = !DILocation(line: 257, column: 19, scope: !985)
!1005 = !DILocation(line: 257, column: 2, scope: !985)
!1006 = !DILocation(line: 260, column: 23, scope: !985)
!1007 = !DILocation(line: 260, column: 28, scope: !985)
!1008 = !DILocation(line: 260, column: 16, scope: !985)
!1009 = !DILocation(line: 260, column: 6, scope: !985)
!1010 = !DILocation(line: 260, column: 4, scope: !985)
!1011 = !DILocation(line: 262, column: 10, scope: !985)
!1012 = !DILocation(line: 262, column: 13, scope: !985)
!1013 = !DILocation(line: 262, column: 2, scope: !985)
!1014 = !DILocation(line: 266, column: 24, scope: !985)
!1015 = !DILocation(line: 266, column: 31, scope: !985)
!1016 = !DILocation(line: 266, column: 29, scope: !985)
!1017 = !DILocation(line: 266, column: 36, scope: !985)
!1018 = !DILocation(line: 266, column: 17, scope: !985)
!1019 = !DILocation(line: 266, column: 7, scope: !985)
!1020 = !DILocation(line: 266, column: 5, scope: !985)
!1021 = !DILocation(line: 267, column: 1, scope: !985)
!1022 = distinct !DISubprogram(name: "InitPerRun", linkageName: "_Z10InitPerRunv", scope: !2, file: !2, line: 274, type: !375, isLocal: false, isDefinition: true, scopeLine: 275, flags: DIFlagPrototyped, isOptimized: false, unit: !1, variables: !673)
!1023 = !DILocalVariable(name: "i", scope: !1022, file: !2, line: 276, type: !179)
!1024 = !DILocation(line: 276, column: 6, scope: !1022)
!1025 = !DILocation(line: 277, column: 8, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1022, file: !2, line: 277, column: 2)
!1027 = !DILocation(line: 277, column: 7, scope: !1026)
!1028 = !DILocation(line: 277, column: 12, scope: !1029)
!1029 = !DILexicalBlockFile(scope: !1030, file: !2, discriminator: 1)
!1030 = distinct !DILexicalBlock(scope: !1026, file: !2, line: 277, column: 2)
!1031 = !DILocation(line: 277, column: 14, scope: !1029)
!1032 = !DILocation(line: 277, column: 19, scope: !1029)
!1033 = !DILocation(line: 277, column: 18, scope: !1029)
!1034 = !DILocation(line: 277, column: 13, scope: !1029)
!1035 = !DILocation(line: 277, column: 2, scope: !1029)
!1036 = !DILocation(line: 278, column: 6, scope: !1030)
!1037 = !DILocation(line: 278, column: 8, scope: !1030)
!1038 = !DILocation(line: 278, column: 7, scope: !1030)
!1039 = !DILocation(line: 278, column: 11, scope: !1030)
!1040 = !DILocation(line: 278, column: 4, scope: !1030)
!1041 = !DILocation(line: 277, column: 26, scope: !1042)
!1042 = !DILexicalBlockFile(scope: !1030, file: !2, discriminator: 2)
!1043 = !DILocation(line: 277, column: 2, scope: !1042)
!1044 = distinct !{!1044, !1045}
!1045 = !DILocation(line: 277, column: 2, scope: !1022)
!1046 = !DILocation(line: 279, column: 1, scope: !1022)
!1047 = distinct !DISubprogram(name: "ForwardSub", linkageName: "_Z10ForwardSubv", scope: !2, file: !2, line: 326, type: !375, isLocal: false, isDefinition: true, scopeLine: 327, flags: DIFlagPrototyped, isOptimized: false, unit: !1, variables: !673)
!1048 = !DILocalVariable(name: "t", scope: !1047, file: !2, line: 328, type: !179)
!1049 = !DILocation(line: 328, column: 6, scope: !1047)
!1050 = !DILocalVariable(name: "m_cuda", scope: !1047, file: !2, line: 329, type: !96)
!1051 = !DILocation(line: 329, column: 12, scope: !1047)
!1052 = !DILocalVariable(name: "a_cuda", scope: !1047, file: !2, line: 329, type: !96)
!1053 = !DILocation(line: 329, column: 20, scope: !1047)
!1054 = !DILocalVariable(name: "b_cuda", scope: !1047, file: !2, line: 329, type: !96)
!1055 = !DILocation(line: 329, column: 28, scope: !1047)
!1056 = !DILocation(line: 332, column: 13, scope: !1047)
!1057 = !DILocation(line: 332, column: 32, scope: !1047)
!1058 = !DILocation(line: 332, column: 39, scope: !1047)
!1059 = !DILocation(line: 332, column: 37, scope: !1047)
!1060 = !DILocation(line: 332, column: 44, scope: !1047)
!1061 = !DILocation(line: 332, column: 2, scope: !1047)
!1062 = !DILocation(line: 334, column: 13, scope: !1047)
!1063 = !DILocation(line: 334, column: 32, scope: !1047)
!1064 = !DILocation(line: 334, column: 39, scope: !1047)
!1065 = !DILocation(line: 334, column: 37, scope: !1047)
!1066 = !DILocation(line: 334, column: 44, scope: !1047)
!1067 = !DILocation(line: 334, column: 2, scope: !1047)
!1068 = !DILocation(line: 336, column: 13, scope: !1047)
!1069 = !DILocation(line: 336, column: 32, scope: !1047)
!1070 = !DILocation(line: 336, column: 37, scope: !1047)
!1071 = !DILocation(line: 336, column: 2, scope: !1047)
!1072 = !DILocation(line: 339, column: 13, scope: !1047)
!1073 = !DILocation(line: 339, column: 21, scope: !1047)
!1074 = !DILocation(line: 339, column: 24, scope: !1047)
!1075 = !DILocation(line: 339, column: 31, scope: !1047)
!1076 = !DILocation(line: 339, column: 29, scope: !1047)
!1077 = !DILocation(line: 339, column: 36, scope: !1047)
!1078 = !DILocation(line: 339, column: 2, scope: !1047)
!1079 = !DILocation(line: 340, column: 13, scope: !1047)
!1080 = !DILocation(line: 340, column: 21, scope: !1047)
!1081 = !DILocation(line: 340, column: 24, scope: !1047)
!1082 = !DILocation(line: 340, column: 31, scope: !1047)
!1083 = !DILocation(line: 340, column: 29, scope: !1047)
!1084 = !DILocation(line: 340, column: 36, scope: !1047)
!1085 = !DILocation(line: 340, column: 2, scope: !1047)
!1086 = !DILocation(line: 341, column: 13, scope: !1047)
!1087 = !DILocation(line: 341, column: 21, scope: !1047)
!1088 = !DILocation(line: 341, column: 24, scope: !1047)
!1089 = !DILocation(line: 341, column: 29, scope: !1047)
!1090 = !DILocation(line: 341, column: 2, scope: !1047)
!1091 = !DILocalVariable(name: "block_size", scope: !1047, file: !2, line: 343, type: !179)
!1092 = !DILocation(line: 343, column: 6, scope: !1047)
!1093 = !DILocalVariable(name: "grid_size", scope: !1047, file: !2, line: 343, type: !179)
!1094 = !DILocation(line: 343, column: 17, scope: !1047)
!1095 = !DILocation(line: 345, column: 13, scope: !1047)
!1096 = !DILocation(line: 346, column: 15, scope: !1047)
!1097 = !DILocation(line: 346, column: 20, scope: !1047)
!1098 = !DILocation(line: 346, column: 19, scope: !1047)
!1099 = !DILocation(line: 346, column: 37, scope: !1047)
!1100 = !DILocation(line: 346, column: 42, scope: !1047)
!1101 = !DILocation(line: 346, column: 41, scope: !1047)
!1102 = !DILocation(line: 346, column: 36, scope: !1047)
!1103 = !DILocation(line: 346, column: 35, scope: !1047)
!1104 = !DILocation(line: 346, column: 32, scope: !1047)
!1105 = !DILocation(line: 346, column: 12, scope: !1047)
!1106 = !DILocalVariable(name: "dimBlock", scope: !1047, file: !2, line: 350, type: !1107)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "dim3", file: !1108, line: 427, baseType: !1109)
!1108 = !DIFile(filename: "/usr/local/cuda/include/vector_types.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/gaussian")
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dim3", file: !1108, line: 417, size: 96, align: 32, elements: !1110, identifier: "_ZTS4dim3")
!1110 = !{!1111, !1112, !1113, !1114, !1118, !1127}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1109, file: !1108, line: 419, baseType: !112, size: 32, align: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1109, file: !1108, line: 419, baseType: !112, size: 32, align: 32, offset: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !1109, file: !1108, line: 419, baseType: !112, size: 32, align: 32, offset: 64)
!1114 = !DISubprogram(name: "dim3", scope: !1109, file: !1108, line: 421, type: !1115, isLocal: false, isDefinition: false, scopeLine: 421, flags: DIFlagPrototyped, isOptimized: false)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{null, !1117, !112, !112, !112}
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1118 = !DISubprogram(name: "dim3", scope: !1109, file: !1108, line: 422, type: !1119, isLocal: false, isDefinition: false, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: false)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{null, !1117, !1121}
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1108, line: 383, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uint3", file: !1108, line: 190, size: 96, align: 32, elements: !1123, identifier: "_ZTS5uint3")
!1123 = !{!1124, !1125, !1126}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1122, file: !1108, line: 192, baseType: !112, size: 32, align: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1122, file: !1108, line: 192, baseType: !112, size: 32, align: 32, offset: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !1122, file: !1108, line: 192, baseType: !112, size: 32, align: 32, offset: 64)
!1127 = !DISubprogram(name: "operator uint3", linkageName: "_ZN4dim3cv5uint3Ev", scope: !1109, file: !1108, line: 423, type: !1128, isLocal: false, isDefinition: false, scopeLine: 423, flags: DIFlagPrototyped, isOptimized: false)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!1121, !1117}
!1130 = !DILocation(line: 350, column: 7, scope: !1047)
!1131 = !DILocation(line: 350, column: 16, scope: !1047)
!1132 = !DILocalVariable(name: "dimGrid", scope: !1047, file: !2, line: 351, type: !1107)
!1133 = !DILocation(line: 351, column: 7, scope: !1047)
!1134 = !DILocation(line: 351, column: 15, scope: !1047)
!1135 = !DILocalVariable(name: "blockSize2d", scope: !1047, file: !2, line: 354, type: !179)
!1136 = !DILocation(line: 354, column: 6, scope: !1047)
!1137 = !DILocalVariable(name: "gridSize2d", scope: !1047, file: !2, line: 354, type: !179)
!1138 = !DILocation(line: 354, column: 19, scope: !1047)
!1139 = !DILocation(line: 355, column: 14, scope: !1047)
!1140 = !DILocation(line: 356, column: 16, scope: !1047)
!1141 = !DILocation(line: 356, column: 21, scope: !1047)
!1142 = !DILocation(line: 356, column: 20, scope: !1047)
!1143 = !DILocation(line: 356, column: 39, scope: !1047)
!1144 = !DILocation(line: 356, column: 44, scope: !1047)
!1145 = !DILocation(line: 356, column: 43, scope: !1047)
!1146 = !DILocation(line: 356, column: 38, scope: !1047)
!1147 = !DILocation(line: 356, column: 37, scope: !1047)
!1148 = !DILocation(line: 356, column: 36, scope: !1047)
!1149 = !DILocation(line: 356, column: 34, scope: !1047)
!1150 = !DILocation(line: 356, column: 13, scope: !1047)
!1151 = !DILocalVariable(name: "dimBlockXY", scope: !1047, file: !2, line: 358, type: !1107)
!1152 = !DILocation(line: 358, column: 7, scope: !1047)
!1153 = !DILocation(line: 358, column: 18, scope: !1047)
!1154 = !DILocation(line: 358, column: 30, scope: !1047)
!1155 = !DILocalVariable(name: "dimGridXY", scope: !1047, file: !2, line: 359, type: !1107)
!1156 = !DILocation(line: 359, column: 7, scope: !1047)
!1157 = !DILocation(line: 359, column: 17, scope: !1047)
!1158 = !DILocation(line: 359, column: 28, scope: !1047)
!1159 = !DILocalVariable(name: "time_start", scope: !1047, file: !2, line: 362, type: !917)
!1160 = !DILocation(line: 362, column: 20, scope: !1047)
!1161 = !DILocation(line: 363, column: 5, scope: !1047)
!1162 = !DILocation(line: 364, column: 8, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1047, file: !2, line: 364, column: 2)
!1164 = !DILocation(line: 364, column: 7, scope: !1163)
!1165 = !DILocation(line: 364, column: 12, scope: !1166)
!1166 = !DILexicalBlockFile(scope: !1167, file: !2, discriminator: 1)
!1167 = distinct !DILexicalBlock(scope: !1163, file: !2, line: 364, column: 2)
!1168 = !DILocation(line: 364, column: 15, scope: !1166)
!1169 = !DILocation(line: 364, column: 19, scope: !1166)
!1170 = !DILocation(line: 364, column: 13, scope: !1166)
!1171 = !DILocation(line: 364, column: 2, scope: !1166)
!1172 = !DILocation(line: 365, column: 10, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1167, file: !2, line: 364, column: 29)
!1174 = !DILocation(line: 365, column: 18, scope: !1173)
!1175 = !DILocation(line: 365, column: 7, scope: !1173)
!1176 = !DILocation(line: 365, column: 3, scope: !1173)
!1177 = !DILocation(line: 365, column: 30, scope: !1178)
!1178 = !DILexicalBlockFile(scope: !1173, file: !2, discriminator: 1)
!1179 = !DILocation(line: 365, column: 37, scope: !1178)
!1180 = !DILocation(line: 365, column: 44, scope: !1178)
!1181 = !DILocation(line: 365, column: 49, scope: !1178)
!1182 = !DILocation(line: 365, column: 3, scope: !1178)
!1183 = !DILocation(line: 366, column: 3, scope: !1173)
!1184 = !DILocation(line: 367, column: 10, scope: !1173)
!1185 = !DILocation(line: 367, column: 20, scope: !1173)
!1186 = !DILocation(line: 367, column: 7, scope: !1173)
!1187 = !DILocation(line: 367, column: 3, scope: !1173)
!1188 = !DILocation(line: 367, column: 34, scope: !1178)
!1189 = !DILocation(line: 367, column: 41, scope: !1178)
!1190 = !DILocation(line: 367, column: 48, scope: !1178)
!1191 = !DILocation(line: 367, column: 55, scope: !1178)
!1192 = !DILocation(line: 367, column: 60, scope: !1178)
!1193 = !DILocation(line: 367, column: 65, scope: !1178)
!1194 = !DILocation(line: 367, column: 64, scope: !1178)
!1195 = !DILocation(line: 367, column: 67, scope: !1178)
!1196 = !DILocation(line: 367, column: 3, scope: !1178)
!1197 = !DILocation(line: 368, column: 3, scope: !1173)
!1198 = !DILocation(line: 369, column: 3, scope: !1173)
!1199 = !DILocation(line: 370, column: 2, scope: !1173)
!1200 = !DILocation(line: 364, column: 25, scope: !1201)
!1201 = !DILexicalBlockFile(scope: !1167, file: !2, discriminator: 2)
!1202 = !DILocation(line: 364, column: 2, scope: !1201)
!1203 = distinct !{!1203, !1204}
!1204 = !DILocation(line: 364, column: 2, scope: !1047)
!1205 = !DILocalVariable(name: "time_end", scope: !1047, file: !2, line: 372, type: !917)
!1206 = !DILocation(line: 372, column: 17, scope: !1047)
!1207 = !DILocation(line: 373, column: 5, scope: !1047)
!1208 = !DILocation(line: 374, column: 33, scope: !1047)
!1209 = !DILocation(line: 374, column: 40, scope: !1047)
!1210 = !DILocation(line: 374, column: 61, scope: !1047)
!1211 = !DILocation(line: 374, column: 50, scope: !1047)
!1212 = !DILocation(line: 374, column: 84, scope: !1047)
!1213 = !DILocation(line: 374, column: 91, scope: !1047)
!1214 = !DILocation(line: 374, column: 114, scope: !1047)
!1215 = !DILocation(line: 374, column: 101, scope: !1047)
!1216 = !DILocation(line: 374, column: 70, scope: !1047)
!1217 = !DILocation(line: 374, column: 23, scope: !1047)
!1218 = !DILocation(line: 374, column: 21, scope: !1047)
!1219 = !DILocation(line: 377, column: 13, scope: !1047)
!1220 = !DILocation(line: 377, column: 16, scope: !1047)
!1221 = !DILocation(line: 377, column: 24, scope: !1047)
!1222 = !DILocation(line: 377, column: 31, scope: !1047)
!1223 = !DILocation(line: 377, column: 29, scope: !1047)
!1224 = !DILocation(line: 377, column: 36, scope: !1047)
!1225 = !DILocation(line: 377, column: 2, scope: !1047)
!1226 = !DILocation(line: 378, column: 13, scope: !1047)
!1227 = !DILocation(line: 378, column: 16, scope: !1047)
!1228 = !DILocation(line: 378, column: 24, scope: !1047)
!1229 = !DILocation(line: 378, column: 31, scope: !1047)
!1230 = !DILocation(line: 378, column: 29, scope: !1047)
!1231 = !DILocation(line: 378, column: 36, scope: !1047)
!1232 = !DILocation(line: 378, column: 2, scope: !1047)
!1233 = !DILocation(line: 379, column: 13, scope: !1047)
!1234 = !DILocation(line: 379, column: 16, scope: !1047)
!1235 = !DILocation(line: 379, column: 24, scope: !1047)
!1236 = !DILocation(line: 379, column: 29, scope: !1047)
!1237 = !DILocation(line: 379, column: 2, scope: !1047)
!1238 = !DILocation(line: 380, column: 11, scope: !1047)
!1239 = !DILocation(line: 380, column: 2, scope: !1047)
!1240 = !DILocation(line: 381, column: 11, scope: !1047)
!1241 = !DILocation(line: 381, column: 2, scope: !1047)
!1242 = !DILocation(line: 382, column: 11, scope: !1047)
!1243 = !DILocation(line: 382, column: 2, scope: !1047)
!1244 = !DILocation(line: 383, column: 1, scope: !1047)
!1245 = distinct !DISubprogram(name: "PrintMat", linkageName: "_Z8PrintMatPfii", scope: !2, file: !2, line: 421, type: !1246, isLocal: false, isDefinition: true, scopeLine: 422, flags: DIFlagPrototyped, isOptimized: false, unit: !1, variables: !673)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{null, !96, !179, !179}
!1248 = !DILocalVariable(name: "ary", arg: 1, scope: !1245, file: !2, line: 421, type: !96)
!1249 = !DILocation(line: 421, column: 22, scope: !1245)
!1250 = !DILocalVariable(name: "nrow", arg: 2, scope: !1245, file: !2, line: 421, type: !179)
!1251 = !DILocation(line: 421, column: 31, scope: !1245)
!1252 = !DILocalVariable(name: "ncol", arg: 3, scope: !1245, file: !2, line: 421, type: !179)
!1253 = !DILocation(line: 421, column: 41, scope: !1245)
!1254 = !DILocalVariable(name: "i", scope: !1245, file: !2, line: 423, type: !179)
!1255 = !DILocation(line: 423, column: 6, scope: !1245)
!1256 = !DILocalVariable(name: "j", scope: !1245, file: !2, line: 423, type: !179)
!1257 = !DILocation(line: 423, column: 9, scope: !1245)
!1258 = !DILocation(line: 425, column: 8, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1245, file: !2, line: 425, column: 2)
!1260 = !DILocation(line: 425, column: 7, scope: !1259)
!1261 = !DILocation(line: 425, column: 12, scope: !1262)
!1262 = !DILexicalBlockFile(scope: !1263, file: !2, discriminator: 1)
!1263 = distinct !DILexicalBlock(scope: !1259, file: !2, line: 425, column: 2)
!1264 = !DILocation(line: 425, column: 14, scope: !1262)
!1265 = !DILocation(line: 425, column: 13, scope: !1262)
!1266 = !DILocation(line: 425, column: 2, scope: !1262)
!1267 = !DILocation(line: 426, column: 9, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1269, file: !2, line: 426, column: 3)
!1269 = distinct !DILexicalBlock(scope: !1263, file: !2, line: 425, column: 25)
!1270 = !DILocation(line: 426, column: 8, scope: !1268)
!1271 = !DILocation(line: 426, column: 13, scope: !1272)
!1272 = !DILexicalBlockFile(scope: !1273, file: !2, discriminator: 1)
!1273 = distinct !DILexicalBlock(scope: !1268, file: !2, line: 426, column: 3)
!1274 = !DILocation(line: 426, column: 15, scope: !1272)
!1275 = !DILocation(line: 426, column: 14, scope: !1272)
!1276 = !DILocation(line: 426, column: 3, scope: !1272)
!1277 = !DILocation(line: 427, column: 23, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1273, file: !2, line: 426, column: 26)
!1279 = !DILocation(line: 427, column: 27, scope: !1278)
!1280 = !DILocation(line: 427, column: 32, scope: !1278)
!1281 = !DILocation(line: 427, column: 31, scope: !1278)
!1282 = !DILocation(line: 427, column: 26, scope: !1278)
!1283 = !DILocation(line: 427, column: 34, scope: !1278)
!1284 = !DILocation(line: 427, column: 33, scope: !1278)
!1285 = !DILocation(line: 427, column: 21, scope: !1278)
!1286 = !DILocation(line: 427, column: 4, scope: !1278)
!1287 = !DILocation(line: 428, column: 3, scope: !1278)
!1288 = !DILocation(line: 426, column: 22, scope: !1289)
!1289 = !DILexicalBlockFile(scope: !1273, file: !2, discriminator: 2)
!1290 = !DILocation(line: 426, column: 3, scope: !1289)
!1291 = distinct !{!1291, !1292}
!1292 = !DILocation(line: 426, column: 3, scope: !1269)
!1293 = !DILocation(line: 429, column: 3, scope: !1269)
!1294 = !DILocation(line: 430, column: 2, scope: !1269)
!1295 = !DILocation(line: 425, column: 21, scope: !1296)
!1296 = !DILexicalBlockFile(scope: !1263, file: !2, discriminator: 2)
!1297 = !DILocation(line: 425, column: 2, scope: !1296)
!1298 = distinct !{!1298, !1299}
!1299 = !DILocation(line: 425, column: 2, scope: !1245)
!1300 = !DILocation(line: 431, column: 2, scope: !1245)
!1301 = !DILocation(line: 432, column: 1, scope: !1245)
!1302 = distinct !DISubprogram(name: "PrintAry", linkageName: "_Z8PrintAryPfi", scope: !2, file: !2, line: 452, type: !671, isLocal: false, isDefinition: true, scopeLine: 453, flags: DIFlagPrototyped, isOptimized: false, unit: !1, variables: !673)
!1303 = !DILocalVariable(name: "ary", arg: 1, scope: !1302, file: !2, line: 452, type: !96)
!1304 = !DILocation(line: 452, column: 22, scope: !1302)
!1305 = !DILocalVariable(name: "ary_size", arg: 2, scope: !1302, file: !2, line: 452, type: !179)
!1306 = !DILocation(line: 452, column: 31, scope: !1302)
!1307 = !DILocalVariable(name: "i", scope: !1302, file: !2, line: 454, type: !179)
!1308 = !DILocation(line: 454, column: 6, scope: !1302)
!1309 = !DILocation(line: 455, column: 8, scope: !1310)
!1310 = distinct !DILexicalBlock(scope: !1302, file: !2, line: 455, column: 2)
!1311 = !DILocation(line: 455, column: 7, scope: !1310)
!1312 = !DILocation(line: 455, column: 12, scope: !1313)
!1313 = !DILexicalBlockFile(scope: !1314, file: !2, discriminator: 1)
!1314 = distinct !DILexicalBlock(scope: !1310, file: !2, line: 455, column: 2)
!1315 = !DILocation(line: 455, column: 14, scope: !1313)
!1316 = !DILocation(line: 455, column: 13, scope: !1313)
!1317 = !DILocation(line: 455, column: 2, scope: !1313)
!1318 = !DILocation(line: 456, column: 19, scope: !1319)
!1319 = distinct !DILexicalBlock(scope: !1314, file: !2, line: 455, column: 29)
!1320 = !DILocation(line: 456, column: 23, scope: !1319)
!1321 = !DILocation(line: 456, column: 3, scope: !1319)
!1322 = !DILocation(line: 457, column: 2, scope: !1319)
!1323 = !DILocation(line: 455, column: 25, scope: !1324)
!1324 = !DILexicalBlockFile(scope: !1314, file: !2, discriminator: 2)
!1325 = !DILocation(line: 455, column: 2, scope: !1324)
!1326 = distinct !{!1326, !1327}
!1327 = !DILocation(line: 455, column: 2, scope: !1302)
!1328 = !DILocation(line: 458, column: 2, scope: !1302)
!1329 = !DILocation(line: 459, column: 1, scope: !1302)
!1330 = distinct !DISubprogram(name: "BackSub", linkageName: "_Z7BackSubv", scope: !2, file: !2, line: 390, type: !375, isLocal: false, isDefinition: true, scopeLine: 391, flags: DIFlagPrototyped, isOptimized: false, unit: !1, variables: !673)
!1331 = !DILocation(line: 393, column: 30, scope: !1330)
!1332 = !DILocation(line: 393, column: 35, scope: !1330)
!1333 = !DILocation(line: 393, column: 23, scope: !1330)
!1334 = !DILocation(line: 393, column: 13, scope: !1330)
!1335 = !DILocation(line: 393, column: 11, scope: !1330)
!1336 = !DILocalVariable(name: "i", scope: !1330, file: !2, line: 395, type: !179)
!1337 = !DILocation(line: 395, column: 6, scope: !1330)
!1338 = !DILocalVariable(name: "j", scope: !1330, file: !2, line: 395, type: !179)
!1339 = !DILocation(line: 395, column: 8, scope: !1330)
!1340 = !DILocation(line: 396, column: 7, scope: !1341)
!1341 = distinct !DILexicalBlock(scope: !1330, file: !2, line: 396, column: 2)
!1342 = !DILocation(line: 396, column: 6, scope: !1341)
!1343 = !DILocation(line: 396, column: 10, scope: !1344)
!1344 = !DILexicalBlockFile(scope: !1345, file: !2, discriminator: 1)
!1345 = distinct !DILexicalBlock(scope: !1341, file: !2, line: 396, column: 2)
!1346 = !DILocation(line: 396, column: 12, scope: !1344)
!1347 = !DILocation(line: 396, column: 11, scope: !1344)
!1348 = !DILocation(line: 396, column: 2, scope: !1344)
!1349 = !DILocation(line: 397, column: 22, scope: !1350)
!1350 = distinct !DILexicalBlock(scope: !1345, file: !2, line: 396, column: 21)
!1351 = !DILocation(line: 397, column: 24, scope: !1350)
!1352 = !DILocation(line: 397, column: 29, scope: !1350)
!1353 = !DILocation(line: 397, column: 28, scope: !1350)
!1354 = !DILocation(line: 397, column: 30, scope: !1350)
!1355 = !DILocation(line: 397, column: 3, scope: !1350)
!1356 = !DILocation(line: 397, column: 12, scope: !1350)
!1357 = !DILocation(line: 397, column: 17, scope: !1350)
!1358 = !DILocation(line: 397, column: 16, scope: !1350)
!1359 = !DILocation(line: 397, column: 18, scope: !1350)
!1360 = !DILocation(line: 397, column: 21, scope: !1350)
!1361 = !DILocation(line: 398, column: 8, scope: !1362)
!1362 = distinct !DILexicalBlock(scope: !1350, file: !2, line: 398, column: 3)
!1363 = !DILocation(line: 398, column: 7, scope: !1362)
!1364 = !DILocation(line: 398, column: 11, scope: !1365)
!1365 = !DILexicalBlockFile(scope: !1366, file: !2, discriminator: 1)
!1366 = distinct !DILexicalBlock(scope: !1362, file: !2, line: 398, column: 3)
!1367 = !DILocation(line: 398, column: 13, scope: !1365)
!1368 = !DILocation(line: 398, column: 12, scope: !1365)
!1369 = !DILocation(line: 398, column: 3, scope: !1365)
!1370 = !DILocation(line: 400, column: 26, scope: !1371)
!1371 = distinct !DILexicalBlock(scope: !1366, file: !2, line: 399, column: 3)
!1372 = !DILocation(line: 400, column: 28, scope: !1371)
!1373 = !DILocation(line: 400, column: 34, scope: !1371)
!1374 = !DILocation(line: 400, column: 39, scope: !1371)
!1375 = !DILocation(line: 400, column: 38, scope: !1371)
!1376 = !DILocation(line: 400, column: 40, scope: !1371)
!1377 = !DILocation(line: 400, column: 32, scope: !1371)
!1378 = !DILocation(line: 400, column: 27, scope: !1371)
!1379 = !DILocation(line: 400, column: 45, scope: !1371)
!1380 = !DILocation(line: 400, column: 50, scope: !1371)
!1381 = !DILocation(line: 400, column: 49, scope: !1371)
!1382 = !DILocation(line: 400, column: 51, scope: !1371)
!1383 = !DILocation(line: 400, column: 43, scope: !1371)
!1384 = !DILocation(line: 400, column: 24, scope: !1371)
!1385 = !DILocation(line: 400, column: 58, scope: !1371)
!1386 = !DILocation(line: 400, column: 67, scope: !1371)
!1387 = !DILocation(line: 400, column: 72, scope: !1371)
!1388 = !DILocation(line: 400, column: 71, scope: !1371)
!1389 = !DILocation(line: 400, column: 73, scope: !1371)
!1390 = !DILocation(line: 400, column: 56, scope: !1371)
!1391 = !DILocation(line: 400, column: 4, scope: !1371)
!1392 = !DILocation(line: 400, column: 13, scope: !1371)
!1393 = !DILocation(line: 400, column: 18, scope: !1371)
!1394 = !DILocation(line: 400, column: 17, scope: !1371)
!1395 = !DILocation(line: 400, column: 19, scope: !1371)
!1396 = !DILocation(line: 400, column: 22, scope: !1371)
!1397 = !DILocation(line: 401, column: 3, scope: !1371)
!1398 = !DILocation(line: 398, column: 16, scope: !1399)
!1399 = !DILexicalBlockFile(scope: !1366, file: !2, discriminator: 2)
!1400 = !DILocation(line: 398, column: 3, scope: !1399)
!1401 = distinct !{!1401, !1402}
!1402 = !DILocation(line: 398, column: 3, scope: !1350)
!1403 = !DILocation(line: 402, column: 22, scope: !1350)
!1404 = !DILocation(line: 402, column: 31, scope: !1350)
!1405 = !DILocation(line: 402, column: 36, scope: !1350)
!1406 = !DILocation(line: 402, column: 35, scope: !1350)
!1407 = !DILocation(line: 402, column: 37, scope: !1350)
!1408 = !DILocation(line: 402, column: 44, scope: !1350)
!1409 = !DILocation(line: 402, column: 46, scope: !1350)
!1410 = !DILocation(line: 402, column: 52, scope: !1350)
!1411 = !DILocation(line: 402, column: 57, scope: !1350)
!1412 = !DILocation(line: 402, column: 56, scope: !1350)
!1413 = !DILocation(line: 402, column: 58, scope: !1350)
!1414 = !DILocation(line: 402, column: 50, scope: !1350)
!1415 = !DILocation(line: 402, column: 45, scope: !1350)
!1416 = !DILocation(line: 402, column: 63, scope: !1350)
!1417 = !DILocation(line: 402, column: 68, scope: !1350)
!1418 = !DILocation(line: 402, column: 67, scope: !1350)
!1419 = !DILocation(line: 402, column: 69, scope: !1350)
!1420 = !DILocation(line: 402, column: 61, scope: !1350)
!1421 = !DILocation(line: 402, column: 42, scope: !1350)
!1422 = !DILocation(line: 402, column: 40, scope: !1350)
!1423 = !DILocation(line: 402, column: 3, scope: !1350)
!1424 = !DILocation(line: 402, column: 12, scope: !1350)
!1425 = !DILocation(line: 402, column: 17, scope: !1350)
!1426 = !DILocation(line: 402, column: 16, scope: !1350)
!1427 = !DILocation(line: 402, column: 18, scope: !1350)
!1428 = !DILocation(line: 402, column: 21, scope: !1350)
!1429 = !DILocation(line: 403, column: 2, scope: !1350)
!1430 = !DILocation(line: 396, column: 18, scope: !1431)
!1431 = !DILexicalBlockFile(scope: !1345, file: !2, discriminator: 2)
!1432 = !DILocation(line: 396, column: 2, scope: !1431)
!1433 = distinct !{!1433, !1434}
!1434 = !DILocation(line: 396, column: 2, scope: !1330)
!1435 = !DILocation(line: 404, column: 1, scope: !1330)
!1436 = distinct !DISubprogram(name: "PrintDeviceProperties", linkageName: "_Z21PrintDevicePropertiesv", scope: !2, file: !2, line: 201, type: !375, isLocal: false, isDefinition: true, scopeLine: 201, flags: DIFlagPrototyped, isOptimized: false, unit: !1, variables: !673)
!1437 = !DILocalVariable(name: "deviceProp", scope: !1436, file: !2, line: 202, type: !1438)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cudaDeviceProp", file: !5, line: 1307, size: 5184, align: 64, elements: !1439, identifier: "_ZTS14cudaDeviceProp")
!1439 = !{!1440, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1438, file: !5, line: 1309, baseType: !1441, size: 2048, align: 8)
!1441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 2048, align: 8, elements: !1442)
!1442 = !{!1443}
!1443 = !DISubrange(count: 256)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "totalGlobalMem", scope: !1438, file: !5, line: 1310, baseType: !402, size: 64, align: 64, offset: 2048)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "sharedMemPerBlock", scope: !1438, file: !5, line: 1311, baseType: !402, size: 64, align: 64, offset: 2112)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "regsPerBlock", scope: !1438, file: !5, line: 1312, baseType: !179, size: 32, align: 32, offset: 2176)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "warpSize", scope: !1438, file: !5, line: 1313, baseType: !179, size: 32, align: 32, offset: 2208)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "memPitch", scope: !1438, file: !5, line: 1314, baseType: !402, size: 64, align: 64, offset: 2240)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "maxThreadsPerBlock", scope: !1438, file: !5, line: 1315, baseType: !179, size: 32, align: 32, offset: 2304)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "maxThreadsDim", scope: !1438, file: !5, line: 1316, baseType: !1451, size: 96, align: 32, offset: 2336)
!1451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 96, align: 32, elements: !1452)
!1452 = !{!1453}
!1453 = !DISubrange(count: 3)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "maxGridSize", scope: !1438, file: !5, line: 1317, baseType: !1451, size: 96, align: 32, offset: 2432)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "clockRate", scope: !1438, file: !5, line: 1318, baseType: !179, size: 32, align: 32, offset: 2528)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "totalConstMem", scope: !1438, file: !5, line: 1319, baseType: !402, size: 64, align: 64, offset: 2560)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !1438, file: !5, line: 1320, baseType: !179, size: 32, align: 32, offset: 2624)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !1438, file: !5, line: 1321, baseType: !179, size: 32, align: 32, offset: 2656)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "textureAlignment", scope: !1438, file: !5, line: 1322, baseType: !402, size: 64, align: 64, offset: 2688)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "texturePitchAlignment", scope: !1438, file: !5, line: 1323, baseType: !402, size: 64, align: 64, offset: 2752)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "deviceOverlap", scope: !1438, file: !5, line: 1324, baseType: !179, size: 32, align: 32, offset: 2816)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "multiProcessorCount", scope: !1438, file: !5, line: 1325, baseType: !179, size: 32, align: 32, offset: 2848)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "kernelExecTimeoutEnabled", scope: !1438, file: !5, line: 1326, baseType: !179, size: 32, align: 32, offset: 2880)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "integrated", scope: !1438, file: !5, line: 1327, baseType: !179, size: 32, align: 32, offset: 2912)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "canMapHostMemory", scope: !1438, file: !5, line: 1328, baseType: !179, size: 32, align: 32, offset: 2944)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "computeMode", scope: !1438, file: !5, line: 1329, baseType: !179, size: 32, align: 32, offset: 2976)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1D", scope: !1438, file: !5, line: 1330, baseType: !179, size: 32, align: 32, offset: 3008)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1DMipmap", scope: !1438, file: !5, line: 1331, baseType: !179, size: 32, align: 32, offset: 3040)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1DLinear", scope: !1438, file: !5, line: 1332, baseType: !179, size: 32, align: 32, offset: 3072)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2D", scope: !1438, file: !5, line: 1333, baseType: !1471, size: 64, align: 32, offset: 3104)
!1471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 64, align: 32, elements: !1472)
!1472 = !{!1473}
!1473 = !DISubrange(count: 2)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DMipmap", scope: !1438, file: !5, line: 1334, baseType: !1471, size: 64, align: 32, offset: 3168)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DLinear", scope: !1438, file: !5, line: 1335, baseType: !1451, size: 96, align: 32, offset: 3232)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DGather", scope: !1438, file: !5, line: 1336, baseType: !1471, size: 64, align: 32, offset: 3328)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture3D", scope: !1438, file: !5, line: 1337, baseType: !1451, size: 96, align: 32, offset: 3392)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture3DAlt", scope: !1438, file: !5, line: 1338, baseType: !1451, size: 96, align: 32, offset: 3488)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "maxTextureCubemap", scope: !1438, file: !5, line: 1339, baseType: !179, size: 32, align: 32, offset: 3584)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1DLayered", scope: !1438, file: !5, line: 1340, baseType: !1471, size: 64, align: 32, offset: 3616)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DLayered", scope: !1438, file: !5, line: 1341, baseType: !1451, size: 96, align: 32, offset: 3680)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "maxTextureCubemapLayered", scope: !1438, file: !5, line: 1342, baseType: !1471, size: 64, align: 32, offset: 3776)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface1D", scope: !1438, file: !5, line: 1343, baseType: !179, size: 32, align: 32, offset: 3840)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface2D", scope: !1438, file: !5, line: 1344, baseType: !1471, size: 64, align: 32, offset: 3872)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface3D", scope: !1438, file: !5, line: 1345, baseType: !1451, size: 96, align: 32, offset: 3936)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface1DLayered", scope: !1438, file: !5, line: 1346, baseType: !1471, size: 64, align: 32, offset: 4032)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface2DLayered", scope: !1438, file: !5, line: 1347, baseType: !1451, size: 96, align: 32, offset: 4096)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurfaceCubemap", scope: !1438, file: !5, line: 1348, baseType: !179, size: 32, align: 32, offset: 4192)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurfaceCubemapLayered", scope: !1438, file: !5, line: 1349, baseType: !1471, size: 64, align: 32, offset: 4224)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "surfaceAlignment", scope: !1438, file: !5, line: 1350, baseType: !402, size: 64, align: 64, offset: 4288)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "concurrentKernels", scope: !1438, file: !5, line: 1351, baseType: !179, size: 32, align: 32, offset: 4352)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "ECCEnabled", scope: !1438, file: !5, line: 1352, baseType: !179, size: 32, align: 32, offset: 4384)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "pciBusID", scope: !1438, file: !5, line: 1353, baseType: !179, size: 32, align: 32, offset: 4416)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "pciDeviceID", scope: !1438, file: !5, line: 1354, baseType: !179, size: 32, align: 32, offset: 4448)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "pciDomainID", scope: !1438, file: !5, line: 1355, baseType: !179, size: 32, align: 32, offset: 4480)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "tccDriver", scope: !1438, file: !5, line: 1356, baseType: !179, size: 32, align: 32, offset: 4512)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "asyncEngineCount", scope: !1438, file: !5, line: 1357, baseType: !179, size: 32, align: 32, offset: 4544)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "unifiedAddressing", scope: !1438, file: !5, line: 1358, baseType: !179, size: 32, align: 32, offset: 4576)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "memoryClockRate", scope: !1438, file: !5, line: 1359, baseType: !179, size: 32, align: 32, offset: 4608)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "memoryBusWidth", scope: !1438, file: !5, line: 1360, baseType: !179, size: 32, align: 32, offset: 4640)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "l2CacheSize", scope: !1438, file: !5, line: 1361, baseType: !179, size: 32, align: 32, offset: 4672)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "maxThreadsPerMultiProcessor", scope: !1438, file: !5, line: 1362, baseType: !179, size: 32, align: 32, offset: 4704)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "streamPrioritiesSupported", scope: !1438, file: !5, line: 1363, baseType: !179, size: 32, align: 32, offset: 4736)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "globalL1CacheSupported", scope: !1438, file: !5, line: 1364, baseType: !179, size: 32, align: 32, offset: 4768)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "localL1CacheSupported", scope: !1438, file: !5, line: 1365, baseType: !179, size: 32, align: 32, offset: 4800)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "sharedMemPerMultiprocessor", scope: !1438, file: !5, line: 1366, baseType: !402, size: 64, align: 64, offset: 4864)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "regsPerMultiprocessor", scope: !1438, file: !5, line: 1367, baseType: !179, size: 32, align: 32, offset: 4928)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "managedMemory", scope: !1438, file: !5, line: 1368, baseType: !179, size: 32, align: 32, offset: 4960)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "isMultiGpuBoard", scope: !1438, file: !5, line: 1369, baseType: !179, size: 32, align: 32, offset: 4992)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "multiGpuBoardGroupID", scope: !1438, file: !5, line: 1370, baseType: !179, size: 32, align: 32, offset: 5024)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "hostNativeAtomicSupported", scope: !1438, file: !5, line: 1371, baseType: !179, size: 32, align: 32, offset: 5056)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "singleToDoublePrecisionPerfRatio", scope: !1438, file: !5, line: 1372, baseType: !179, size: 32, align: 32, offset: 5088)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "pageableMemoryAccess", scope: !1438, file: !5, line: 1373, baseType: !179, size: 32, align: 32, offset: 5120)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "concurrentManagedAccess", scope: !1438, file: !5, line: 1374, baseType: !179, size: 32, align: 32, offset: 5152)
