; ModuleID = 'main.cu'
source_filename = "main.cu"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.params_common_change = type { float*, i32 }
%struct.params_common = type { i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32*, float*, i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32*, float*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.params_unique = type { i32*, i32*, i32*, i32*, float*, i32, i32, float*, float*, float*, float*, float*, float*, float*, float*, float*, float*, float*, float*, float*, float* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.dim3 = type { i32, i32, i32 }

!37 = !DIEnumerator(name: "cudaErrorTextureFetchFailed", value: 23)
!38 = !DIEnumerator(name: "cudaErrorTextureNotBound", value: 24)
!39 = !DIEnumerator(name: "cudaErrorSynchronizationError", value: 25)
!40 = !DIEnumerator(name: "cudaErrorInvalidFilterSetting", value: 26)
!41 = !DIEnumerator(name: "cudaErrorInvalidNormSetting", value: 27)
!42 = !DIEnumerator(name: "cudaErrorMixedDeviceExecution", value: 28)
!43 = !DIEnumerator(name: "cudaErrorCudartUnloading", value: 29)
!44 = !DIEnumerator(name: "cudaErrorUnknown", value: 30)
!45 = !DIEnumerator(name: "cudaErrorNotYetImplemented", value: 31)
!46 = !DIEnumerator(name: "cudaErrorMemoryValueTooLarge", value: 32)
!47 = !DIEnumerator(name: "cudaErrorInvalidResourceHandle", value: 33)
!48 = !DIEnumerator(name: "cudaErrorNotReady", value: 34)
!49 = !DIEnumerator(name: "cudaErrorInsufficientDriver", value: 35)
!50 = !DIEnumerator(name: "cudaErrorSetOnActiveProcess", value: 36)
!51 = !DIEnumerator(name: "cudaErrorInvalidSurface", value: 37)
!52 = !DIEnumerator(name: "cudaErrorNoDevice", value: 38)
!53 = !DIEnumerator(name: "cudaErrorECCUncorrectable", value: 39)
!54 = !DIEnumerator(name: "cudaErrorSharedObjectSymbolNotFound", value: 40)
!55 = !DIEnumerator(name: "cudaErrorSharedObjectInitFailed", value: 41)
!56 = !DIEnumerator(name: "cudaErrorUnsupportedLimit", value: 42)
!57 = !DIEnumerator(name: "cudaErrorDuplicateVariableName", value: 43)
!58 = !DIEnumerator(name: "cudaErrorDuplicateTextureName", value: 44)
!59 = !DIEnumerator(name: "cudaErrorDuplicateSurfaceName", value: 45)
!60 = !DIEnumerator(name: "cudaErrorDevicesUnavailable", value: 46)
!61 = !DIEnumerator(name: "cudaErrorInvalidKernelImage", value: 47)
!62 = !DIEnumerator(name: "cudaErrorNoKernelImageForDevice", value: 48)
!63 = !DIEnumerator(name: "cudaErrorIncompatibleDriverContext", value: 49)
!64 = !DIEnumerator(name: "cudaErrorPeerAccessAlreadyEnabled", value: 50)
!65 = !DIEnumerator(name: "cudaErrorPeerAccessNotEnabled", value: 51)
!66 = !DIEnumerator(name: "cudaErrorDeviceAlreadyInUse", value: 54)
!67 = !DIEnumerator(name: "cudaErrorProfilerDisabled", value: 55)
!68 = !DIEnumerator(name: "cudaErrorProfilerNotInitialized", value: 56)
!69 = !DIEnumerator(name: "cudaErrorProfilerAlreadyStarted", value: 57)
!70 = !DIEnumerator(name: "cudaErrorProfilerAlreadyStopped", value: 58)
!71 = !DIEnumerator(name: "cudaErrorAssert", value: 59)
!72 = !DIEnumerator(name: "cudaErrorTooManyPeers", value: 60)
!73 = !DIEnumerator(name: "cudaErrorHostMemoryAlreadyRegistered", value: 61)
!74 = !DIEnumerator(name: "cudaErrorHostMemoryNotRegistered", value: 62)
!75 = !DIEnumerator(name: "cudaErrorOperatingSystem", value: 63)
!76 = !DIEnumerator(name: "cudaErrorPeerAccessUnsupported", value: 64)
!77 = !DIEnumerator(name: "cudaErrorLaunchMaxDepthExceeded", value: 65)
!78 = !DIEnumerator(name: "cudaErrorLaunchFileScopedTex", value: 66)
!79 = !DIEnumerator(name: "cudaErrorLaunchFileScopedSurf", value: 67)
!80 = !DIEnumerator(name: "cudaErrorSyncDepthExceeded", value: 68)
!81 = !DIEnumerator(name: "cudaErrorLaunchPendingCountExceeded", value: 69)
!82 = !DIEnumerator(name: "cudaErrorNotPermitted", value: 70)
!83 = !DIEnumerator(name: "cudaErrorNotSupported", value: 71)
!84 = !DIEnumerator(name: "cudaErrorHardwareStackError", value: 72)
!85 = !DIEnumerator(name: "cudaErrorIllegalInstruction", value: 73)
!86 = !DIEnumerator(name: "cudaErrorMisalignedAddress", value: 74)
!87 = !DIEnumerator(name: "cudaErrorInvalidAddressSpace", value: 75)
!88 = !DIEnumerator(name: "cudaErrorInvalidPc", value: 76)
!89 = !DIEnumerator(name: "cudaErrorIllegalAddress", value: 77)
!90 = !DIEnumerator(name: "cudaErrorInvalidPtx", value: 78)
!91 = !DIEnumerator(name: "cudaErrorInvalidGraphicsContext", value: 79)
!92 = !DIEnumerator(name: "cudaErrorNvlinkUncorrectable", value: 80)
!93 = !DIEnumerator(name: "cudaErrorStartupFailure", value: 127)
!94 = !DIEnumerator(name: "cudaErrorApiFailureBase", value: 10000)
!95 = !{!96, !100, !102, !104, !106}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "avi_t", file: !98, line: 126, baseType: !99)
!98 = !DIFile(filename: "./AVI/avilib.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!99 = !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 87, size: 8704, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5avi_t")
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!108 = !{!0, !109, !118, !232, !233, !261}
!109 = distinct !DIGlobalVariable(name: "d_common_change", scope: !1, file: !2, line: 26, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "params_common_change", file: !111, line: 40, baseType: !112)
!111 = !DIFile(filename: "./define.c", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "params_common_change", file: !111, line: 31, size: 128, align: 64, elements: !113, identifier: "_ZTS20params_common_change")
!113 = !{!114, !117}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "d_frame", scope: !112, file: !111, line: 37, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "frame_no", scope: !112, file: !111, line: 38, baseType: !105, size: 32, align: 32, offset: 64)
!118 = distinct !DIGlobalVariable(name: "common", scope: !1, file: !2, line: 28, type: !119, isLocal: false, isDefinition: true)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "params_common", file: !111, line: 272, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "params_common", file: !111, line: 48, size: 4160, align: 64, elements: !121, identifier: "_ZTS13params_common")
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sSize", scope: !120, file: !111, line: 58, baseType: !105, size: 32, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tSize", scope: !120, file: !111, line: 59, baseType: !105, size: 32, align: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "maxMove", scope: !120, file: !111, line: 60, baseType: !105, size: 32, align: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !120, file: !111, line: 61, baseType: !116, size: 32, align: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "no_frames", scope: !120, file: !111, line: 67, baseType: !105, size: 32, align: 32, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rows", scope: !120, file: !111, line: 68, baseType: !105, size: 32, align: 32, offset: 160)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cols", scope: !120, file: !111, line: 69, baseType: !105, size: 32, align: 32, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "frame_elem", scope: !120, file: !111, line: 70, baseType: !105, size: 32, align: 32, offset: 224)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mem", scope: !120, file: !111, line: 71, baseType: !105, size: 32, align: 32, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "endoPoints", scope: !120, file: !111, line: 77, baseType: !105, size: 32, align: 32, offset: 288)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "endo_mem", scope: !120, file: !111, line: 78, baseType: !105, size: 32, align: 32, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "endoRow", scope: !120, file: !111, line: 80, baseType: !104, size: 64, align: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "endoCol", scope: !120, file: !111, line: 81, baseType: !104, size: 64, align: 64, offset: 448)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tEndoRowLoc", scope: !120, file: !111, line: 82, baseType: !104, size: 64, align: 64, offset: 512)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tEndoColLoc", scope: !120, file: !111, line: 83, baseType: !104, size: 64, align: 64, offset: 576)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "d_endoRow", scope: !120, file: !111, line: 85, baseType: !104, size: 64, align: 64, offset: 640)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "d_endoCol", scope: !120, file: !111, line: 86, baseType: !104, size: 64, align: 64, offset: 704)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "d_tEndoRowLoc", scope: !120, file: !111, line: 87, baseType: !104, size: 64, align: 64, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "d_tEndoColLoc", scope: !120, file: !111, line: 88, baseType: !104, size: 64, align: 64, offset: 832)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "d_endoT", scope: !120, file: !111, line: 90, baseType: !115, size: 64, align: 64, offset: 896)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "epiPoints", scope: !120, file: !111, line: 95, baseType: !105, size: 32, align: 32, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "epi_mem", scope: !120, file: !111, line: 96, baseType: !105, size: 32, align: 32, offset: 992)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "epiRow", scope: !120, file: !111, line: 98, baseType: !104, size: 64, align: 64, offset: 1024)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "epiCol", scope: !120, file: !111, line: 99, baseType: !104, size: 64, align: 64, offset: 1088)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "tEpiRowLoc", scope: !120, file: !111, line: 100, baseType: !104, size: 64, align: 64, offset: 1152)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tEpiColLoc", scope: !120, file: !111, line: 101, baseType: !104, size: 64, align: 64, offset: 1216)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "d_epiRow", scope: !120, file: !111, line: 103, baseType: !104, size: 64, align: 64, offset: 1280)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "d_epiCol", scope: !120, file: !111, line: 104, baseType: !104, size: 64, align: 64, offset: 1344)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "d_tEpiRowLoc", scope: !120, file: !111, line: 105, baseType: !104, size: 64, align: 64, offset: 1408)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "d_tEpiColLoc", scope: !120, file: !111, line: 106, baseType: !104, size: 64, align: 64, offset: 1472)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "d_epiT", scope: !120, file: !111, line: 108, baseType: !115, size: 64, align: 64, offset: 1536)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "allPoints", scope: !120, file: !111, line: 114, baseType: !105, size: 32, align: 32, offset: 1600)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "in_rows", scope: !120, file: !111, line: 120, baseType: !105, size: 32, align: 32, offset: 1632)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "in_cols", scope: !120, file: !111, line: 121, baseType: !105, size: 32, align: 32, offset: 1664)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "in_elem", scope: !120, file: !111, line: 122, baseType: !105, size: 32, align: 32, offset: 1696)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "in_mem", scope: !120, file: !111, line: 123, baseType: !105, size: 32, align: 32, offset: 1728)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "in2_rows", scope: !120, file: !111, line: 129, baseType: !105, size: 32, align: 32, offset: 1760)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "in2_cols", scope: !120, file: !111, line: 130, baseType: !105, size: 32, align: 32, offset: 1792)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "in2_elem", scope: !120, file: !111, line: 131, baseType: !105, size: 32, align: 32, offset: 1824)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "in2_mem", scope: !120, file: !111, line: 132, baseType: !105, size: 32, align: 32, offset: 1856)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "conv_rows", scope: !120, file: !111, line: 138, baseType: !105, size: 32, align: 32, offset: 1888)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "conv_cols", scope: !120, file: !111, line: 139, baseType: !105, size: 32, align: 32, offset: 1920)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "conv_elem", scope: !120, file: !111, line: 140, baseType: !105, size: 32, align: 32, offset: 1952)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "conv_mem", scope: !120, file: !111, line: 141, baseType: !105, size: 32, align: 32, offset: 1984)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ioffset", scope: !120, file: !111, line: 142, baseType: !105, size: 32, align: 32, offset: 2016)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "joffset", scope: !120, file: !111, line: 143, baseType: !105, size: 32, align: 32, offset: 2048)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_add_rows", scope: !120, file: !111, line: 153, baseType: !105, size: 32, align: 32, offset: 2080)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_add_cols", scope: !120, file: !111, line: 154, baseType: !105, size: 32, align: 32, offset: 2112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_rows", scope: !120, file: !111, line: 155, baseType: !105, size: 32, align: 32, offset: 2144)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_cols", scope: !120, file: !111, line: 156, baseType: !105, size: 32, align: 32, offset: 2176)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_elem", scope: !120, file: !111, line: 157, baseType: !105, size: 32, align: 32, offset: 2208)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_mem", scope: !120, file: !111, line: 158, baseType: !105, size: 32, align: 32, offset: 2240)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_rows", scope: !120, file: !111, line: 164, baseType: !105, size: 32, align: 32, offset: 2272)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_cols", scope: !120, file: !111, line: 165, baseType: !105, size: 32, align: 32, offset: 2304)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_elem", scope: !120, file: !111, line: 166, baseType: !105, size: 32, align: 32, offset: 2336)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_mem", scope: !120, file: !111, line: 167, baseType: !105, size: 32, align: 32, offset: 2368)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_rowlow", scope: !120, file: !111, line: 168, baseType: !105, size: 32, align: 32, offset: 2400)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_rowhig", scope: !120, file: !111, line: 169, baseType: !105, size: 32, align: 32, offset: 2432)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_collow", scope: !120, file: !111, line: 170, baseType: !105, size: 32, align: 32, offset: 2464)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_colhig", scope: !120, file: !111, line: 171, baseType: !105, size: 32, align: 32, offset: 2496)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel2_rowlow", scope: !120, file: !111, line: 177, baseType: !105, size: 32, align: 32, offset: 2528)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel2_rowhig", scope: !120, file: !111, line: 178, baseType: !105, size: 32, align: 32, offset: 2560)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel2_collow", scope: !120, file: !111, line: 179, baseType: !105, size: 32, align: 32, offset: 2592)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel2_colhig", scope: !120, file: !111, line: 180, baseType: !105, size: 32, align: 32, offset: 2624)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_rows", scope: !120, file: !111, line: 181, baseType: !105, size: 32, align: 32, offset: 2656)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_cols", scope: !120, file: !111, line: 182, baseType: !105, size: 32, align: 32, offset: 2688)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_elem", scope: !120, file: !111, line: 183, baseType: !105, size: 32, align: 32, offset: 2720)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_mem", scope: !120, file: !111, line: 184, baseType: !105, size: 32, align: 32, offset: 2752)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_rows", scope: !120, file: !111, line: 190, baseType: !105, size: 32, align: 32, offset: 2784)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_cols", scope: !120, file: !111, line: 191, baseType: !105, size: 32, align: 32, offset: 2816)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_elem", scope: !120, file: !111, line: 192, baseType: !105, size: 32, align: 32, offset: 2848)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_mem", scope: !120, file: !111, line: 193, baseType: !105, size: 32, align: 32, offset: 2880)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_rowlow", scope: !120, file: !111, line: 194, baseType: !105, size: 32, align: 32, offset: 2912)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_rowhig", scope: !120, file: !111, line: 195, baseType: !105, size: 32, align: 32, offset: 2944)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_collow", scope: !120, file: !111, line: 196, baseType: !105, size: 32, align: 32, offset: 2976)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_colhig", scope: !120, file: !111, line: 197, baseType: !105, size: 32, align: 32, offset: 3008)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel2_rowlow", scope: !120, file: !111, line: 203, baseType: !105, size: 32, align: 32, offset: 3040)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel2_rowhig", scope: !120, file: !111, line: 204, baseType: !105, size: 32, align: 32, offset: 3072)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel2_collow", scope: !120, file: !111, line: 205, baseType: !105, size: 32, align: 32, offset: 3104)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel2_colhig", scope: !120, file: !111, line: 206, baseType: !105, size: 32, align: 32, offset: 3136)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub2_rows", scope: !120, file: !111, line: 207, baseType: !105, size: 32, align: 32, offset: 3168)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub2_cols", scope: !120, file: !111, line: 208, baseType: !105, size: 32, align: 32, offset: 3200)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub2_elem", scope: !120, file: !111, line: 209, baseType: !105, size: 32, align: 32, offset: 3232)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub2_mem", scope: !120, file: !111, line: 210, baseType: !105, size: 32, align: 32, offset: 3264)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_rows", scope: !120, file: !111, line: 220, baseType: !105, size: 32, align: 32, offset: 3296)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_cols", scope: !120, file: !111, line: 221, baseType: !105, size: 32, align: 32, offset: 3328)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_elem", scope: !120, file: !111, line: 222, baseType: !105, size: 32, align: 32, offset: 3360)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_mem", scope: !120, file: !111, line: 223, baseType: !105, size: 32, align: 32, offset: 3392)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_sub2_rows", scope: !120, file: !111, line: 229, baseType: !105, size: 32, align: 32, offset: 3424)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_sub2_cols", scope: !120, file: !111, line: 230, baseType: !105, size: 32, align: 32, offset: 3456)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_sub2_elem", scope: !120, file: !111, line: 231, baseType: !105, size: 32, align: 32, offset: 3488)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_sub2_mem", scope: !120, file: !111, line: 232, baseType: !105, size: 32, align: 32, offset: 3520)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "in_sqr_rows", scope: !120, file: !111, line: 238, baseType: !105, size: 32, align: 32, offset: 3552)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "in_sqr_cols", scope: !120, file: !111, line: 239, baseType: !105, size: 32, align: 32, offset: 3584)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "in_sqr_elem", scope: !120, file: !111, line: 240, baseType: !105, size: 32, align: 32, offset: 3616)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "in_sqr_mem", scope: !120, file: !111, line: 241, baseType: !105, size: 32, align: 32, offset: 3648)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "tMask_rows", scope: !120, file: !111, line: 247, baseType: !105, size: 32, align: 32, offset: 3680)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "tMask_cols", scope: !120, file: !111, line: 248, baseType: !105, size: 32, align: 32, offset: 3712)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tMask_elem", scope: !120, file: !111, line: 249, baseType: !105, size: 32, align: 32, offset: 3744)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tMask_mem", scope: !120, file: !111, line: 250, baseType: !105, size: 32, align: 32, offset: 3776)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mask_rows", scope: !120, file: !111, line: 256, baseType: !105, size: 32, align: 32, offset: 3808)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mask_cols", scope: !120, file: !111, line: 257, baseType: !105, size: 32, align: 32, offset: 3840)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mask_elem", scope: !120, file: !111, line: 258, baseType: !105, size: 32, align: 32, offset: 3872)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mask_mem", scope: !120, file: !111, line: 259, baseType: !105, size: 32, align: 32, offset: 3904)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mask_conv_rows", scope: !120, file: !111, line: 265, baseType: !105, size: 32, align: 32, offset: 3936)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mask_conv_cols", scope: !120, file: !111, line: 266, baseType: !105, size: 32, align: 32, offset: 3968)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mask_conv_elem", scope: !120, file: !111, line: 267, baseType: !105, size: 32, align: 32, offset: 4000)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "mask_conv_mem", scope: !120, file: !111, line: 268, baseType: !105, size: 32, align: 32, offset: 4032)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mask_conv_ioffset", scope: !120, file: !111, line: 269, baseType: !105, size: 32, align: 32, offset: 4064)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "mask_conv_joffset", scope: !120, file: !111, line: 270, baseType: !105, size: 32, align: 32, offset: 4096)
!232 = distinct !DIGlobalVariable(name: "d_common", scope: !1, file: !2, line: 29, type: !119, isLocal: true, isDefinition: true)
!233 = distinct !DIGlobalVariable(name: "unique", scope: !1, file: !2, line: 31, type: !234, isLocal: false, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 65280, align: 64, elements: !259)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "params_unique", file: !111, line: 391, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "params_unique", file: !111, line: 280, size: 1280, align: 64, elements: !237, identifier: "_ZTS13params_unique")
!237 = !{!238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "d_Row", scope: !236, file: !111, line: 286, baseType: !104, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "d_Col", scope: !236, file: !111, line: 287, baseType: !104, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "d_tRowLoc", scope: !236, file: !111, line: 288, baseType: !104, size: 64, align: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "d_tColLoc", scope: !236, file: !111, line: 289, baseType: !104, size: 64, align: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "d_T", scope: !236, file: !111, line: 290, baseType: !115, size: 64, align: 64, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "point_no", scope: !236, file: !111, line: 296, baseType: !105, size: 32, align: 32, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "in_pointer", scope: !236, file: !111, line: 302, baseType: !105, size: 32, align: 32, offset: 352)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2", scope: !236, file: !111, line: 308, baseType: !115, size: 64, align: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "d_conv", scope: !236, file: !111, line: 314, baseType: !115, size: 64, align: 64, offset: 448)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "d_in_mod", scope: !236, file: !111, line: 315, baseType: !115, size: 64, align: 64, offset: 512)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_pad_cumv", scope: !236, file: !111, line: 325, baseType: !115, size: 64, align: 64, offset: 576)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_pad_cumv_sel", scope: !236, file: !111, line: 331, baseType: !115, size: 64, align: 64, offset: 640)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_sub_cumh", scope: !236, file: !111, line: 337, baseType: !115, size: 64, align: 64, offset: 704)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_sub_cumh_sel", scope: !236, file: !111, line: 343, baseType: !115, size: 64, align: 64, offset: 768)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_sub2", scope: !236, file: !111, line: 349, baseType: !115, size: 64, align: 64, offset: 832)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_sqr", scope: !236, file: !111, line: 359, baseType: !115, size: 64, align: 64, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_sqr_sub2", scope: !236, file: !111, line: 365, baseType: !115, size: 64, align: 64, offset: 960)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "d_in_sqr", scope: !236, file: !111, line: 371, baseType: !115, size: 64, align: 64, offset: 1024)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "d_tMask", scope: !236, file: !111, line: 377, baseType: !115, size: 64, align: 64, offset: 1088)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "d_mask", scope: !236, file: !111, line: 383, baseType: !115, size: 64, align: 64, offset: 1152)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "d_mask_conv", scope: !236, file: !111, line: 389, baseType: !115, size: 64, align: 64, offset: 1216)
!259 = !{!260}
!260 = !DISubrange(count: 51)
!261 = distinct !DIGlobalVariable(name: "d_unique", scope: !1, file: !2, line: 32, type: !234, isLocal: true, isDefinition: true)
!262 = !{!263, !270, !274, !276, !278, !280, !282, !286, !288, !290, !292, !294, !296, !298, !300, !302, !304, !306, !308, !310, !312, !314, !318, !320, !322, !324, !328, !332, !334, !336, !341, !345, !347, !349, !351, !353, !355, !357, !359, !361, !366, !370, !372, !374, !378, !380, !382, !384, !386, !388, !392, !394, !396, !400, !407, !411, !413, !415, !419, !421, !423, !427, !429, !431, !435, !437, !439, !441, !443, !445, !447, !449, !451, !453, !458, !460, !462, !466, !468, !470, !472, !474, !476, !478, !480, !484, !488, !490, !492, !497, !499, !501, !503, !505, !507, !509, !513, !519, !523, !527, !532, !534, !538, !542, !553, !557, !561, !565, !569, !573, !575, !579, !583, !587, !595, !599, !603, !607, !611, !616, !622, !626, !630, !632, !640, !644, !652, !654, !656, !660, !664, !668, !673, !677, !682, !683, !684, !685, !688, !689, !690, !691, !692, !693, !694, !697, !699, !701, !703, !705, !707, !709, !711, !714, !716, !718, !720, !722, !724, !726, !728, !730, !732, !734, !736, !738, !740, !742, !744, !746, !748, !750, !752, !754, !756, !758, !760, !762, !764, !766, !768, !770, !772, !774, !776, !778, !782, !783, !785, !787, !789, !791, !793, !795, !797, !799, !801, !803, !805, !807, !809}
!263 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !266, line: 189)
!264 = !DINamespace(name: "std", scope: null, file: !265, line: 188)
!265 = !DIFile(filename: "/usr/local/bin/../lib/clang/4.0.0/include/__clang_cuda_math_forward_declares.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!266 = !DISubprogram(name: "abs", linkageName: "_ZL3absx", scope: !265, file: !265, line: 44, type: !267, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!267 = !DISubroutineType(types: !268)
!268 = !{!269, !269}
!269 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!270 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !271, line: 190)
!271 = !DISubprogram(name: "acos", linkageName: "_ZL4acosf", scope: !265, file: !265, line: 46, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!272 = !DISubroutineType(types: !273)
!273 = !{!116, !116}
!274 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !275, line: 191)
!275 = !DISubprogram(name: "acosh", linkageName: "_ZL5acoshf", scope: !265, file: !265, line: 48, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!276 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !277, line: 192)
!277 = !DISubprogram(name: "asin", linkageName: "_ZL4asinf", scope: !265, file: !265, line: 50, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!278 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !279, line: 193)
!279 = !DISubprogram(name: "asinh", linkageName: "_ZL5asinhf", scope: !265, file: !265, line: 52, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!280 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !281, line: 194)
!281 = !DISubprogram(name: "atan", linkageName: "_ZL4atanf", scope: !265, file: !265, line: 56, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!282 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !283, line: 195)
!283 = !DISubprogram(name: "atan2", linkageName: "_ZL5atan2ff", scope: !265, file: !265, line: 54, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!284 = !DISubroutineType(types: !285)
!285 = !{!116, !116, !116}
!286 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !287, line: 196)
!287 = !DISubprogram(name: "atanh", linkageName: "_ZL5atanhf", scope: !265, file: !265, line: 58, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!288 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !289, line: 197)
!289 = !DISubprogram(name: "cbrt", linkageName: "_ZL4cbrtf", scope: !265, file: !265, line: 60, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!290 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !291, line: 198)
!291 = !DISubprogram(name: "ceil", linkageName: "_ZL4ceilf", scope: !265, file: !265, line: 62, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!292 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !293, line: 199)
!293 = !DISubprogram(name: "copysign", linkageName: "_ZL8copysignff", scope: !265, file: !265, line: 64, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!294 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !295, line: 200)
!295 = !DISubprogram(name: "cos", linkageName: "_ZL3cosf", scope: !265, file: !265, line: 66, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!296 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !297, line: 201)
!297 = !DISubprogram(name: "cosh", linkageName: "_ZL4coshf", scope: !265, file: !265, line: 68, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!298 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !299, line: 202)
!299 = !DISubprogram(name: "erf", linkageName: "_ZL3erff", scope: !265, file: !265, line: 72, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!300 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !301, line: 203)
!301 = !DISubprogram(name: "erfc", linkageName: "_ZL4erfcf", scope: !265, file: !265, line: 70, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!302 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !303, line: 204)
!303 = !DISubprogram(name: "exp", linkageName: "_ZL3expf", scope: !265, file: !265, line: 76, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!304 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !305, line: 205)
!305 = !DISubprogram(name: "exp2", linkageName: "_ZL4exp2f", scope: !265, file: !265, line: 74, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!306 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !307, line: 206)
!307 = !DISubprogram(name: "expm1", linkageName: "_ZL5expm1f", scope: !265, file: !265, line: 78, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!308 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !309, line: 207)
!309 = !DISubprogram(name: "fabs", linkageName: "_ZL4fabsf", scope: !265, file: !265, line: 80, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!310 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !311, line: 208)
!311 = !DISubprogram(name: "fdim", linkageName: "_ZL4fdimff", scope: !265, file: !265, line: 82, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!312 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !313, line: 209)
!313 = !DISubprogram(name: "floor", linkageName: "_ZL5floorf", scope: !265, file: !265, line: 84, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!314 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !315, line: 210)
!315 = !DISubprogram(name: "fma", linkageName: "_ZL3fmafff", scope: !265, file: !265, line: 86, type: !316, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!316 = !DISubroutineType(types: !317)
!317 = !{!116, !116, !116, !116}
!318 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !319, line: 211)
!319 = !DISubprogram(name: "fmax", linkageName: "_ZL4fmaxff", scope: !265, file: !265, line: 88, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !321, line: 212)
!321 = !DISubprogram(name: "fmin", linkageName: "_ZL4fminff", scope: !265, file: !265, line: 90, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!322 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !323, line: 213)
!323 = !DISubprogram(name: "fmod", linkageName: "_ZL4fmodff", scope: !265, file: !265, line: 92, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !325, line: 214)
!325 = !DISubprogram(name: "fpclassify", linkageName: "_ZL10fpclassifyf", scope: !265, file: !265, line: 94, type: !326, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!326 = !DISubroutineType(types: !327)
!327 = !{!105, !116}
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !329, line: 215)
!329 = !DISubprogram(name: "frexp", linkageName: "_ZL5frexpfPi", scope: !265, file: !265, line: 96, type: !330, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!330 = !DISubroutineType(types: !331)
!331 = !{!116, !116, !104}
!332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !333, line: 216)
!333 = !DISubprogram(name: "hypot", linkageName: "_ZL5hypotff", scope: !265, file: !265, line: 98, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !335, line: 217)
!335 = !DISubprogram(name: "ilogb", linkageName: "_ZL5ilogbf", scope: !265, file: !265, line: 100, type: !326, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !337, line: 218)
!337 = !DISubprogram(name: "isfinite", linkageName: "_ZL8isfinitef", scope: !265, file: !265, line: 102, type: !338, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!338 = !DISubroutineType(types: !339)
!339 = !{!340, !116}
!340 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!341 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !342, line: 219)
!342 = !DISubprogram(name: "isgreater", linkageName: "_ZL9isgreaterff", scope: !265, file: !265, line: 106, type: !343, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!343 = !DISubroutineType(types: !344)
!344 = !{!340, !116, !116}
!345 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !346, line: 220)
!346 = !DISubprogram(name: "isgreaterequal", linkageName: "_ZL14isgreaterequalff", scope: !265, file: !265, line: 105, type: !343, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!347 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !348, line: 221)
!348 = !DISubprogram(name: "isinf", linkageName: "_ZL5isinff", scope: !265, file: !265, line: 108, type: !338, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!349 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !350, line: 222)
!350 = !DISubprogram(name: "isless", linkageName: "_ZL6islessff", scope: !265, file: !265, line: 112, type: !343, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !352, line: 223)
!352 = !DISubprogram(name: "islessequal", linkageName: "_ZL11islessequalff", scope: !265, file: !265, line: 111, type: !343, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !354, line: 224)
!354 = !DISubprogram(name: "islessgreater", linkageName: "_ZL13islessgreaterff", scope: !265, file: !265, line: 114, type: !343, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !356, line: 225)
!356 = !DISubprogram(name: "isnan", linkageName: "_ZL5isnanf", scope: !265, file: !265, line: 116, type: !338, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !358, line: 226)
!358 = !DISubprogram(name: "isnormal", linkageName: "_ZL8isnormalf", scope: !265, file: !265, line: 118, type: !338, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!359 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !360, line: 227)
!360 = !DISubprogram(name: "isunordered", linkageName: "_ZL11isunorderedff", scope: !265, file: !265, line: 120, type: !343, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !362, line: 228)
!362 = !DISubprogram(name: "labs", linkageName: "_ZL4labsl", scope: !265, file: !265, line: 121, type: !363, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!363 = !DISubroutineType(types: !364)
!364 = !{!365, !365}
!365 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !367, line: 229)
!367 = !DISubprogram(name: "ldexp", linkageName: "_ZL5ldexpfi", scope: !265, file: !265, line: 123, type: !368, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!368 = !DISubroutineType(types: !369)
!369 = !{!116, !116, !105}
!370 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !371, line: 230)
!371 = !DISubprogram(name: "lgamma", linkageName: "_ZL6lgammaf", scope: !265, file: !265, line: 125, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !373, line: 231)
!373 = !DISubprogram(name: "llabs", linkageName: "_ZL5llabsx", scope: !265, file: !265, line: 126, type: !267, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!374 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !375, line: 232)
!375 = !DISubprogram(name: "llrint", linkageName: "_ZL6llrintf", scope: !265, file: !265, line: 128, type: !376, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!376 = !DISubroutineType(types: !377)
!377 = !{!269, !116}
!378 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !379, line: 233)
!379 = !DISubprogram(name: "log", linkageName: "_ZL3logf", scope: !265, file: !265, line: 138, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !381, line: 234)
!381 = !DISubprogram(name: "log10", linkageName: "_ZL5log10f", scope: !265, file: !265, line: 130, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !383, line: 235)
!383 = !DISubprogram(name: "log1p", linkageName: "_ZL5log1pf", scope: !265, file: !265, line: 132, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !385, line: 236)
!385 = !DISubprogram(name: "log2", linkageName: "_ZL4log2f", scope: !265, file: !265, line: 134, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !387, line: 237)
!387 = !DISubprogram(name: "logb", linkageName: "_ZL4logbf", scope: !265, file: !265, line: 136, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !389, line: 238)
!389 = !DISubprogram(name: "lrint", linkageName: "_ZL5lrintf", scope: !265, file: !265, line: 140, type: !390, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!390 = !DISubroutineType(types: !391)
!391 = !{!365, !116}
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !393, line: 239)
!393 = !DISubprogram(name: "lround", linkageName: "_ZL6lroundf", scope: !265, file: !265, line: 142, type: !390, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !395, line: 240)
!395 = !DISubprogram(name: "llround", linkageName: "_ZL7llroundf", scope: !265, file: !265, line: 143, type: !376, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !397, line: 241)
!397 = !DISubprogram(name: "modf", linkageName: "_ZL4modffPf", scope: !265, file: !265, line: 145, type: !398, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!398 = !DISubroutineType(types: !399)
!399 = !{!116, !116, !115}
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !401, line: 242)
!401 = !DISubprogram(name: "nan", linkageName: "_ZL3nanPKc", scope: !265, file: !265, line: 146, type: !402, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!402 = !DISubroutineType(types: !403)
!403 = !{!404, !405}
!404 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !408, line: 243)
!408 = !DISubprogram(name: "nanf", linkageName: "_ZL4nanfPKc", scope: !265, file: !265, line: 147, type: !409, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!409 = !DISubroutineType(types: !410)
!410 = !{!116, !405}
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !412, line: 244)
!412 = !DISubprogram(name: "nearbyint", linkageName: "_ZL9nearbyintf", scope: !265, file: !265, line: 149, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !414, line: 245)
!414 = !DISubprogram(name: "nextafter", linkageName: "_ZL9nextafterff", scope: !265, file: !265, line: 151, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !416, line: 246)
!416 = !DISubprogram(name: "nexttoward", linkageName: "_ZL10nexttowardfd", scope: !265, file: !265, line: 153, type: !417, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!417 = !DISubroutineType(types: !418)
!418 = !{!116, !116, !404}
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !420, line: 247)
!420 = !DISubprogram(name: "pow", linkageName: "_ZL3powfi", scope: !265, file: !265, line: 158, type: !368, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !422, line: 248)
!422 = !DISubprogram(name: "remainder", linkageName: "_ZL9remainderff", scope: !265, file: !265, line: 160, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !424, line: 249)
!424 = !DISubprogram(name: "remquo", linkageName: "_ZL6remquoffPi", scope: !265, file: !265, line: 162, type: !425, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!425 = !DISubroutineType(types: !426)
!426 = !{!116, !116, !116, !104}
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !428, line: 250)
!428 = !DISubprogram(name: "rint", linkageName: "_ZL4rintf", scope: !265, file: !265, line: 164, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !430, line: 251)
!430 = !DISubprogram(name: "round", linkageName: "_ZL5roundf", scope: !265, file: !265, line: 166, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !432, line: 252)
!432 = !DISubprogram(name: "scalbln", linkageName: "_ZL7scalblnfl", scope: !265, file: !265, line: 168, type: !433, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!433 = !DISubroutineType(types: !434)
!434 = !{!116, !116, !365}
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !436, line: 253)
!436 = !DISubprogram(name: "scalbn", linkageName: "_ZL6scalbnfi", scope: !265, file: !265, line: 170, type: !368, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !438, line: 254)
!438 = !DISubprogram(name: "signbit", linkageName: "_ZL7signbitf", scope: !265, file: !265, line: 172, type: !338, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !440, line: 255)
!440 = !DISubprogram(name: "sin", linkageName: "_ZL3sinf", scope: !265, file: !265, line: 174, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !442, line: 256)
!442 = !DISubprogram(name: "sinh", linkageName: "_ZL4sinhf", scope: !265, file: !265, line: 176, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !444, line: 257)
!444 = !DISubprogram(name: "sqrt", linkageName: "_ZL4sqrtf", scope: !265, file: !265, line: 178, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !446, line: 258)
!446 = !DISubprogram(name: "tan", linkageName: "_ZL3tanf", scope: !265, file: !265, line: 180, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !448, line: 259)
!448 = !DISubprogram(name: "tanh", linkageName: "_ZL4tanhf", scope: !265, file: !265, line: 182, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !450, line: 260)
!450 = !DISubprogram(name: "tgamma", linkageName: "_ZL6tgammaf", scope: !265, file: !265, line: 184, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !452, line: 261)
!452 = !DISubprogram(name: "trunc", linkageName: "_ZL5truncf", scope: !265, file: !265, line: 186, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !454, line: 102)
!454 = !DISubprogram(name: "acos", scope: !455, file: !455, line: 54, type: !456, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!455 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!456 = !DISubroutineType(types: !457)
!457 = !{!404, !404}
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !459, line: 121)
!459 = !DISubprogram(name: "asin", scope: !455, file: !455, line: 56, type: !456, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !461, line: 140)
!461 = !DISubprogram(name: "atan", scope: !455, file: !455, line: 58, type: !456, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !463, line: 159)
!463 = !DISubprogram(name: "atan2", scope: !455, file: !455, line: 60, type: !464, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!464 = !DISubroutineType(types: !465)
!465 = !{!404, !404, !404}
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !467, line: 180)
!467 = !DISubprogram(name: "ceil", scope: !455, file: !455, line: 178, type: !456, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !469, line: 199)
!469 = !DISubprogram(name: "cos", scope: !455, file: !455, line: 63, type: !456, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !471, line: 218)
!471 = !DISubprogram(name: "cosh", scope: !455, file: !455, line: 72, type: !456, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !473, line: 237)
!473 = !DISubprogram(name: "exp", scope: !455, file: !455, line: 100, type: !456, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !475, line: 256)
!475 = !DISubprogram(name: "fabs", scope: !455, file: !455, line: 181, type: !456, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !477, line: 275)
!477 = !DISubprogram(name: "floor", scope: !455, file: !455, line: 184, type: !456, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !479, line: 294)
!479 = !DISubprogram(name: "fmod", scope: !455, file: !455, line: 187, type: !464, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !481, line: 315)
!481 = !DISubprogram(name: "frexp", scope: !455, file: !455, line: 103, type: !482, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!482 = !DISubroutineType(types: !483)
!483 = !{!404, !404, !104}
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !485, line: 334)
!485 = !DISubprogram(name: "ldexp", scope: !455, file: !455, line: 106, type: !486, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!486 = !DISubroutineType(types: !487)
!487 = !{!404, !404, !105}
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !489, line: 353)
!489 = !DISubprogram(name: "log", scope: !455, file: !455, line: 109, type: !456, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !491, line: 372)
!491 = !DISubprogram(name: "log10", scope: !455, file: !455, line: 112, type: !456, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !493, line: 391)
!493 = !DISubprogram(name: "modf", scope: !455, file: !455, line: 115, type: !494, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!494 = !DISubroutineType(types: !495)
!495 = !{!404, !404, !496}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64, align: 64)
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !498, line: 403)
!498 = !DISubprogram(name: "pow", scope: !455, file: !455, line: 153, type: !464, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !500, line: 440)
!500 = !DISubprogram(name: "sin", scope: !455, file: !455, line: 65, type: !456, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!501 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !502, line: 459)
!502 = !DISubprogram(name: "sinh", scope: !455, file: !455, line: 74, type: !456, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !504, line: 478)
!504 = !DISubprogram(name: "sqrt", scope: !455, file: !455, line: 156, type: !456, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!505 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !506, line: 497)
!506 = !DISubprogram(name: "tan", scope: !455, file: !455, line: 67, type: !456, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !508, line: 516)
!508 = !DISubprogram(name: "tanh", scope: !455, file: !455, line: 76, type: !456, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!509 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !510, line: 118)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !511, line: 101, baseType: !512)
!511 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!512 = !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 97, size: 64, align: 32, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !514, line: 119)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !511, line: 109, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 105, size: 128, align: 64, elements: !516, identifier: "_ZTS6ldiv_t")
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !515, file: !511, line: 107, baseType: !365, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !515, file: !511, line: 108, baseType: !365, size: 64, align: 64, offset: 64)
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !520, line: 121)
!520 = !DISubprogram(name: "abort", scope: !511, file: !511, line: 515, type: !521, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!521 = !DISubroutineType(types: !522)
!522 = !{null}
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !524, line: 122)
!524 = !DISubprogram(name: "abs", scope: !511, file: !511, line: 774, type: !525, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!525 = !DISubroutineType(types: !526)
!526 = !{!105, !105}
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !528, line: 123)
!528 = !DISubprogram(name: "atexit", scope: !511, file: !511, line: 519, type: !529, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!529 = !DISubroutineType(types: !530)
!530 = !{!105, !531}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !533, line: 129)
!533 = !DISubprogram(name: "atof", scope: !511, file: !511, line: 144, type: !402, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!534 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !535, line: 130)
!535 = !DISubprogram(name: "atoi", scope: !511, file: !511, line: 147, type: !536, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!536 = !DISubroutineType(types: !537)
!537 = !{!105, !405}
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !539, line: 131)
!539 = !DISubprogram(name: "atol", scope: !511, file: !511, line: 150, type: !540, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!540 = !DISubroutineType(types: !541)
!541 = !{!365, !405}
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !543, line: 132)
!543 = !DISubprogram(name: "bsearch", scope: !511, file: !511, line: 754, type: !544, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!544 = !DISubroutineType(types: !545)
!545 = !{!103, !106, !106, !546, !546, !549}
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !547, line: 62, baseType: !548)
!547 = !DIFile(filename: "/usr/local/bin/../lib/clang/4.0.0/include/stddef.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!548 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !511, line: 741, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!105, !106, !106}
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !554, line: 133)
!554 = !DISubprogram(name: "calloc", scope: !511, file: !511, line: 468, type: !555, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!555 = !DISubroutineType(types: !556)
!556 = !{!103, !546, !546}
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !558, line: 134)
!558 = !DISubprogram(name: "div", scope: !511, file: !511, line: 788, type: !559, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!559 = !DISubroutineType(types: !560)
!560 = !{!510, !105, !105}
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !562, line: 135)
!562 = !DISubprogram(name: "exit", scope: !511, file: !511, line: 543, type: !563, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !105}
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !566, line: 136)
!566 = !DISubprogram(name: "free", scope: !511, file: !511, line: 483, type: !567, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !103}
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !570, line: 137)
!570 = !DISubprogram(name: "getenv", scope: !511, file: !511, line: 564, type: !571, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!571 = !DISubroutineType(types: !572)
!572 = !{!100, !405}
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !574, line: 138)
!574 = !DISubprogram(name: "labs", scope: !511, file: !511, line: 775, type: !363, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !576, line: 139)
!576 = !DISubprogram(name: "ldiv", scope: !511, file: !511, line: 790, type: !577, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!577 = !DISubroutineType(types: !578)
!578 = !{!514, !365, !365}
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !580, line: 140)
!580 = !DISubprogram(name: "malloc", scope: !511, file: !511, line: 466, type: !581, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!581 = !DISubroutineType(types: !582)
!582 = !{!103, !546}
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !584, line: 142)
!584 = !DISubprogram(name: "mblen", scope: !511, file: !511, line: 862, type: !585, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!585 = !DISubroutineType(types: !586)
!586 = !{!105, !405, !546}
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !588, line: 143)
!588 = !DISubprogram(name: "mbstowcs", scope: !511, file: !511, line: 873, type: !589, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!589 = !DISubroutineType(types: !590)
!590 = !{!546, !591, !594, !546}
!591 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!593 = !DIBasicType(name: "wchar_t", size: 32, align: 32, encoding: DW_ATE_signed)
!594 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !405)
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !596, line: 144)
!596 = !DISubprogram(name: "mbtowc", scope: !511, file: !511, line: 865, type: !597, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!597 = !DISubroutineType(types: !598)
!598 = !{!105, !591, !594, !546}
!599 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !600, line: 146)
!600 = !DISubprogram(name: "qsort", scope: !511, file: !511, line: 764, type: !601, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !103, !546, !546, !549}
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !604, line: 152)
!604 = !DISubprogram(name: "rand", scope: !511, file: !511, line: 374, type: !605, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!605 = !DISubroutineType(types: !606)
!606 = !{!105}
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !608, line: 153)
!608 = !DISubprogram(name: "realloc", scope: !511, file: !511, line: 480, type: !609, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!609 = !DISubroutineType(types: !610)
!610 = !{!103, !103, !546}
!611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !612, line: 154)
!612 = !DISubprogram(name: "srand", scope: !511, file: !511, line: 376, type: !613, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !615}
!615 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !617, line: 155)
!617 = !DISubprogram(name: "strtod", scope: !511, file: !511, line: 164, type: !618, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!618 = !DISubroutineType(types: !619)
!619 = !{!404, !594, !620}
!620 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !623, line: 156)
!623 = !DISubprogram(name: "strtol", scope: !511, file: !511, line: 183, type: !624, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!624 = !DISubroutineType(types: !625)
!625 = !{!365, !594, !620, !105}
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !627, line: 157)
!627 = !DISubprogram(name: "strtoul", scope: !511, file: !511, line: 187, type: !628, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!628 = !DISubroutineType(types: !629)
!629 = !{!548, !594, !620, !105}
!630 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !631, line: 158)
!631 = !DISubprogram(name: "system", scope: !511, file: !511, line: 716, type: !536, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!632 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !633, line: 160)
!633 = !DISubprogram(name: "wcstombs", scope: !511, file: !511, line: 876, type: !634, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!634 = !DISubroutineType(types: !635)
!635 = !{!546, !636, !637, !546}
!636 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !100)
!637 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !641, line: 161)
!641 = !DISubprogram(name: "wctomb", scope: !511, file: !511, line: 869, type: !642, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!642 = !DISubroutineType(types: !643)
!643 = !{!105, !100, !593}
!644 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !645, entity: !647, line: 214)
!645 = !DINamespace(name: "__gnu_cxx", scope: null, file: !646, line: 220)
!646 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/x86_64-linux-gnu/c++/5.4.0/bits/c++config.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !511, line: 121, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 117, size: 128, align: 64, elements: !649, identifier: "_ZTS7lldiv_t")
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !648, file: !511, line: 119, baseType: !269, size: 64, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !648, file: !511, line: 120, baseType: !269, size: 64, align: 64, offset: 64)
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !645, entity: !653, line: 220)
!653 = !DISubprogram(name: "_Exit", scope: !511, file: !511, line: 557, type: !563, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !645, entity: !655, line: 224)
!655 = !DISubprogram(name: "llabs", scope: !511, file: !511, line: 779, type: !267, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!656 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !645, entity: !657, line: 230)
!657 = !DISubprogram(name: "lldiv", scope: !511, file: !511, line: 796, type: !658, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!658 = !DISubroutineType(types: !659)
!659 = !{!647, !269, !269}
!660 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !645, entity: !661, line: 241)
!661 = !DISubprogram(name: "atoll", scope: !511, file: !511, line: 157, type: !662, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!662 = !DISubroutineType(types: !663)
!663 = !{!269, !405}
!664 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !645, entity: !665, line: 242)
!665 = !DISubprogram(name: "strtoll", scope: !511, file: !511, line: 209, type: !666, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!666 = !DISubroutineType(types: !667)
!667 = !{!269, !594, !620, !105}
!668 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !645, entity: !669, line: 243)
!669 = !DISubprogram(name: "strtoull", scope: !511, file: !511, line: 214, type: !670, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!670 = !DISubroutineType(types: !671)
!671 = !{!672, !594, !620, !105}
!672 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!673 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !645, entity: !674, line: 245)
!674 = !DISubprogram(name: "strtof", scope: !511, file: !511, line: 172, type: !675, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!675 = !DISubroutineType(types: !676)
!676 = !{!116, !594, !620}
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !645, entity: !678, line: 246)
!678 = !DISubprogram(name: "strtold", scope: !511, file: !511, line: 175, type: !679, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!679 = !DISubroutineType(types: !680)
!680 = !{!681, !594, !620}
!681 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!682 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !647, line: 254)
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !653, line: 256)
!684 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !655, line: 258)
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !686, line: 259)
!686 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !645, file: !687, line: 227, type: !658, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!687 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/cstdlib", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!688 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !657, line: 260)
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !661, line: 262)
!690 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !674, line: 263)
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !665, line: 264)
!692 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !669, line: 265)
!693 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !678, line: 266)
!694 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !695, line: 397)
!695 = !DISubprogram(name: "acosf", linkageName: "_ZL5acosff", scope: !696, file: !696, line: 1342, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!696 = !DIFile(filename: "/usr/local/cuda/include/math_functions.hpp", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!697 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !698, line: 398)
!698 = !DISubprogram(name: "acoshf", linkageName: "_ZL6acoshff", scope: !696, file: !696, line: 1370, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!699 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !700, line: 399)
!700 = !DISubprogram(name: "asinf", linkageName: "_ZL5asinff", scope: !696, file: !696, line: 1337, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!701 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !702, line: 400)
!702 = !DISubprogram(name: "asinhf", linkageName: "_ZL6asinhff", scope: !696, file: !696, line: 1375, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!703 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !704, line: 401)
!704 = !DISubprogram(name: "atan2f", linkageName: "_ZL6atan2fff", scope: !696, file: !696, line: 1327, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!705 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !706, line: 402)
!706 = !DISubprogram(name: "atanf", linkageName: "_ZL5atanff", scope: !696, file: !696, line: 1332, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!707 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !708, line: 403)
!708 = !DISubprogram(name: "atanhf", linkageName: "_ZL6atanhff", scope: !696, file: !696, line: 1380, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!709 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !710, line: 404)
!710 = !DISubprogram(name: "cbrtf", linkageName: "_ZL5cbrtff", scope: !696, file: !696, line: 1430, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!711 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !712, line: 405)
!712 = !DISubprogram(name: "ceilf", linkageName: "_ZL5ceilff", scope: !713, file: !713, line: 667, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!713 = !DIFile(filename: "/usr/local/cuda/include/device_functions.hpp", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!714 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !715, line: 406)
!715 = !DISubprogram(name: "copysignf", linkageName: "_ZL9copysignfff", scope: !696, file: !696, line: 1189, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!716 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !717, line: 407)
!717 = !DISubprogram(name: "cosf", linkageName: "_ZL4cosff", scope: !696, file: !696, line: 1243, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!718 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !719, line: 408)
!719 = !DISubprogram(name: "coshf", linkageName: "_ZL5coshff", scope: !696, file: !696, line: 1312, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!720 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !721, line: 409)
!721 = !DISubprogram(name: "erfcf", linkageName: "_ZL5erfcff", scope: !696, file: !696, line: 1490, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!722 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !723, line: 410)
!723 = !DISubprogram(name: "erff", linkageName: "_ZL4erfff", scope: !696, file: !696, line: 1480, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!724 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !725, line: 411)
!725 = !DISubprogram(name: "exp2f", linkageName: "_ZL5exp2ff", scope: !713, file: !713, line: 657, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!726 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !727, line: 412)
!727 = !DISubprogram(name: "expf", linkageName: "_ZL4expff", scope: !696, file: !696, line: 1294, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!728 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !729, line: 413)
!729 = !DISubprogram(name: "expm1f", linkageName: "_ZL6expm1ff", scope: !696, file: !696, line: 1385, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!730 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !731, line: 414)
!731 = !DISubprogram(name: "fabsf", linkageName: "_ZL5fabsff", scope: !713, file: !713, line: 607, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!732 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !733, line: 415)
!733 = !DISubprogram(name: "fdimf", linkageName: "_ZL5fdimfff", scope: !696, file: !696, line: 1616, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!734 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !735, line: 416)
!735 = !DISubprogram(name: "floorf", linkageName: "_ZL6floorff", scope: !713, file: !713, line: 597, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!736 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !737, line: 417)
!737 = !DISubprogram(name: "fmaf", linkageName: "_ZL4fmaffff", scope: !696, file: !696, line: 1568, type: !316, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!738 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !739, line: 418)
!739 = !DISubprogram(name: "fmaxf", linkageName: "_ZL5fmaxfff", scope: !713, file: !713, line: 622, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!740 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !741, line: 419)
!741 = !DISubprogram(name: "fminf", linkageName: "_ZL5fminfff", scope: !713, file: !713, line: 617, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!742 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !743, line: 420)
!743 = !DISubprogram(name: "fmodf", linkageName: "_ZL5fmodfff", scope: !696, file: !696, line: 1553, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!744 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !745, line: 421)
!745 = !DISubprogram(name: "frexpf", linkageName: "_ZL6frexpffPi", scope: !696, file: !696, line: 1543, type: !330, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!746 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !747, line: 422)
!747 = !DISubprogram(name: "hypotf", linkageName: "_ZL6hypotfff", scope: !696, file: !696, line: 1390, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!748 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !749, line: 423)
!749 = !DISubprogram(name: "ilogbf", linkageName: "_ZL6ilogbff", scope: !696, file: !696, line: 1621, type: !326, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!750 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !751, line: 424)
!751 = !DISubprogram(name: "ldexpf", linkageName: "_ZL6ldexpffi", scope: !696, file: !696, line: 1520, type: !368, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!752 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !753, line: 425)
!753 = !DISubprogram(name: "lgammaf", linkageName: "_ZL7lgammaff", scope: !696, file: !696, line: 1515, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!754 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !755, line: 426)
!755 = !DISubprogram(name: "llrintf", linkageName: "_ZL7llrintff", scope: !696, file: !696, line: 1149, type: !376, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!756 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !757, line: 427)
!757 = !DISubprogram(name: "llroundf", linkageName: "_ZL8llroundff", scope: !696, file: !696, line: 1602, type: !376, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!758 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !759, line: 428)
!759 = !DISubprogram(name: "log10f", linkageName: "_ZL6log10ff", scope: !696, file: !696, line: 1356, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!760 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !761, line: 429)
!761 = !DISubprogram(name: "log1pf", linkageName: "_ZL6log1pff", scope: !696, file: !696, line: 1365, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!762 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !763, line: 430)
!763 = !DISubprogram(name: "log2f", linkageName: "_ZL5log2ff", scope: !696, file: !696, line: 1285, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!764 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !765, line: 431)
!765 = !DISubprogram(name: "logbf", linkageName: "_ZL5logbff", scope: !696, file: !696, line: 1626, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!766 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !767, line: 432)
!767 = !DISubprogram(name: "logf", linkageName: "_ZL4logff", scope: !696, file: !696, line: 1347, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!768 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !769, line: 433)
!769 = !DISubprogram(name: "lrintf", linkageName: "_ZL6lrintff", scope: !696, file: !696, line: 1140, type: !390, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!770 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !771, line: 434)
!771 = !DISubprogram(name: "lroundf", linkageName: "_ZL7lroundff", scope: !696, file: !696, line: 1607, type: !390, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!772 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !773, line: 435)
!773 = !DISubprogram(name: "modff", linkageName: "_ZL5modfffPf", scope: !696, file: !696, line: 1548, type: !398, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!774 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !775, line: 436)
!775 = !DISubprogram(name: "nearbyintf", linkageName: "_ZL10nearbyintff", scope: !696, file: !696, line: 1154, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!776 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !777, line: 437)
!777 = !DISubprogram(name: "nextafterf", linkageName: "_ZL10nextafterfff", scope: !696, file: !696, line: 1218, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!778 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !779, line: 438)
!779 = !DISubprogram(name: "nexttowardf", scope: !455, file: !455, line: 294, type: !780, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!780 = !DISubroutineType(types: !781)
!781 = !{!116, !116, !681}
!782 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !779, line: 439)
!783 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !784, line: 440)
!784 = !DISubprogram(name: "powf", linkageName: "_ZL4powfff", scope: !696, file: !696, line: 1583, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!785 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !786, line: 441)
!786 = !DISubprogram(name: "remainderf", linkageName: "_ZL10remainderfff", scope: !696, file: !696, line: 1558, type: !284, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!787 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !788, line: 442)
!788 = !DISubprogram(name: "remquof", linkageName: "_ZL7remquofffPi", scope: !696, file: !696, line: 1563, type: !425, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!789 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !790, line: 443)
!790 = !DISubprogram(name: "rintf", linkageName: "_ZL5rintff", scope: !696, file: !696, line: 1135, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!791 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !792, line: 444)
!792 = !DISubprogram(name: "roundf", linkageName: "_ZL6roundff", scope: !696, file: !696, line: 1597, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!793 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !794, line: 445)
!794 = !DISubprogram(name: "scalblnf", linkageName: "_ZL8scalblnffl", scope: !696, file: !696, line: 1530, type: !433, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!795 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !796, line: 446)
!796 = !DISubprogram(name: "scalbnf", linkageName: "_ZL7scalbnffi", scope: !696, file: !696, line: 1525, type: !368, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!797 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !798, line: 447)
!798 = !DISubprogram(name: "sinf", linkageName: "_ZL4sinff", scope: !696, file: !696, line: 1234, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!799 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !800, line: 448)
!800 = !DISubprogram(name: "sinhf", linkageName: "_ZL5sinhff", scope: !696, file: !696, line: 1317, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!801 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !802, line: 449)
!802 = !DISubprogram(name: "sqrtf", linkageName: "_ZL5sqrtff", scope: !713, file: !713, line: 907, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!803 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !804, line: 450)
!804 = !DISubprogram(name: "tanf", linkageName: "_ZL4tanff", scope: !696, file: !696, line: 1276, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!805 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !806, line: 451)
!806 = !DISubprogram(name: "tanhf", linkageName: "_ZL5tanhff", scope: !696, file: !696, line: 1322, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!807 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !808, line: 452)
!808 = !DISubprogram(name: "tgammaf", linkageName: "_ZL7tgammaff", scope: !696, file: !696, line: 1592, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!809 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !264, entity: !810, line: 453)
!810 = !DISubprogram(name: "truncf", linkageName: "_ZL6truncff", scope: !713, file: !713, line: 662, type: !272, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!811 = !{i32 2, !"Dwarf Version", i32 4}
!812 = !{i32 2, !"Debug Info Version", i32 3}
!813 = !{!"clang version 4.0.0 (http://llvm.org/git/clang.git 2debfe67236df81b4b386304d4aecd9fe20fc156) (http://llvm.org/git/llvm.git 9aa8644318b899329caf41dc98a12db04dee5855)"}
!814 = distinct !DISubprogram(name: "kernel", linkageName: "_Z6kernelv", scope: !815, file: !815, line: 7, type: !521, isLocal: false, isDefinition: true, scopeLine: 7, flags: DIFlagPrototyped, isOptimized: false, unit: !1, variables: !816)
!815 = !DIFile(filename: "./kernel.cu", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!816 = !{}
!817 = !DILocation(line: 7, column: 25, scope: !814)
!818 = !DILocation(line: 1333, column: 1, scope: !814)
!819 = distinct !DISubprogram(name: "write_data", linkageName: "_Z10write_dataPciiiPiS0_iS0_S0_", scope: !2, file: !2, line: 47, type: !820, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, unit: !1, variables: !816)
!820 = !DISubroutineType(types: !821)
!821 = !{null, !100, !105, !105, !105, !104, !104, !105, !104, !104}
!822 = !DILocalVariable(name: "filename", arg: 1, scope: !819, file: !2, line: 47, type: !100)
!823 = !DIExpression()
!824 = !DILocation(line: 47, column: 24, scope: !819)
!825 = !DILocalVariable(name: "frameNo", arg: 2, scope: !819, file: !2, line: 48, type: !105)
!826 = !DILocation(line: 48, column: 8, scope: !819)
!827 = !DILocalVariable(name: "frames_processed", arg: 3, scope: !819, file: !2, line: 49, type: !105)
!828 = !DILocation(line: 49, column: 8, scope: !819)
!829 = !DILocalVariable(name: "endoPoints", arg: 4, scope: !819, file: !2, line: 50, type: !105)
!830 = !DILocation(line: 50, column: 8, scope: !819)
!831 = !DILocalVariable(name: "input_a", arg: 5, scope: !819, file: !2, line: 51, type: !104)
!832 = !DILocation(line: 51, column: 9, scope: !819)
!833 = !DILocalVariable(name: "input_b", arg: 6, scope: !819, file: !2, line: 52, type: !104)
!834 = !DILocation(line: 52, column: 9, scope: !819)
!835 = !DILocalVariable(name: "epiPoints", arg: 7, scope: !819, file: !2, line: 53, type: !105)
!836 = !DILocation(line: 53, column: 8, scope: !819)
!837 = !DILocalVariable(name: "input_2a", arg: 8, scope: !819, file: !2, line: 54, type: !104)
!838 = !DILocation(line: 54, column: 9, scope: !819)
!839 = !DILocalVariable(name: "input_2b", arg: 9, scope: !819, file: !2, line: 55, type: !104)
!840 = !DILocation(line: 55, column: 9, scope: !819)
!841 = !DILocalVariable(name: "fid", scope: !819, file: !2, line: 61, type: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64, align: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !844, line: 48, baseType: !845)
!844 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !846, line: 241, size: 1728, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTS8_IO_FILE")
!846 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!847 = !DILocation(line: 61, column: 8, scope: !819)
!848 = !DILocalVariable(name: "i", scope: !819, file: !2, line: 62, type: !105)
!849 = !DILocation(line: 62, column: 6, scope: !819)
!850 = !DILocalVariable(name: "j", scope: !819, file: !2, line: 62, type: !105)
!851 = !DILocation(line: 62, column: 8, scope: !819)
!852 = !DILocalVariable(name: "c", scope: !819, file: !2, line: 63, type: !101)
!853 = !DILocation(line: 63, column: 7, scope: !819)
!854 = !DILocation(line: 69, column: 14, scope: !819)
!855 = !DILocation(line: 69, column: 8, scope: !819)
!856 = !DILocation(line: 69, column: 6, scope: !819)
!857 = !DILocation(line: 70, column: 6, scope: !858)
!858 = distinct !DILexicalBlock(scope: !819, file: !2, line: 70, column: 6)
!859 = !DILocation(line: 70, column: 10, scope: !858)
!860 = !DILocation(line: 70, column: 6, scope: !819)
!861 = !DILocation(line: 71, column: 3, scope: !862)
!862 = distinct !DILexicalBlock(scope: !858, file: !2, line: 70, column: 19)
!863 = !DILocation(line: 72, column: 3, scope: !862)
!864 = !DILocation(line: 79, column: 15, scope: !819)
!865 = !DILocation(line: 79, column: 46, scope: !819)
!866 = !DILocation(line: 79, column: 7, scope: !819)
!867 = !DILocation(line: 80, column: 15, scope: !819)
!868 = !DILocation(line: 80, column: 46, scope: !819)
!869 = !DILocation(line: 80, column: 7, scope: !819)
!870 = !DILocation(line: 81, column: 15, scope: !819)
!871 = !DILocation(line: 81, column: 40, scope: !819)
!872 = !DILocation(line: 81, column: 7, scope: !819)
!873 = !DILocation(line: 82, column: 15, scope: !819)
!874 = !DILocation(line: 82, column: 37, scope: !819)
!875 = !DILocation(line: 82, column: 7, scope: !819)
!876 = !DILocation(line: 83, column: 7, scope: !877)
!877 = distinct !DILexicalBlock(scope: !819, file: !2, line: 83, column: 2)
!878 = !DILocation(line: 83, column: 6, scope: !877)
!879 = !DILocation(line: 83, column: 11, scope: !880)
!880 = !DILexicalBlockFile(scope: !881, file: !2, discriminator: 1)
!881 = distinct !DILexicalBlock(scope: !877, file: !2, line: 83, column: 2)
!882 = !DILocation(line: 83, column: 13, scope: !880)
!883 = !DILocation(line: 83, column: 12, scope: !880)
!884 = !DILocation(line: 83, column: 2, scope: !880)
!885 = !DILocation(line: 85, column: 14, scope: !886)
!886 = distinct !DILexicalBlock(scope: !881, file: !2, line: 84, column: 4)
!887 = !DILocation(line: 85, column: 38, scope: !886)
!888 = !DILocation(line: 85, column: 6, scope: !886)
!889 = !DILocation(line: 86, column: 14, scope: !886)
!890 = !DILocation(line: 86, column: 34, scope: !886)
!891 = !DILocation(line: 86, column: 6, scope: !886)
!892 = !DILocation(line: 87, column: 11, scope: !893)
!893 = distinct !DILexicalBlock(scope: !886, file: !2, line: 87, column: 6)
!894 = !DILocation(line: 87, column: 10, scope: !893)
!895 = !DILocation(line: 87, column: 15, scope: !896)
!896 = !DILexicalBlockFile(scope: !897, file: !2, discriminator: 1)
!897 = distinct !DILexicalBlock(scope: !893, file: !2, line: 87, column: 6)
!898 = !DILocation(line: 87, column: 17, scope: !896)
!899 = !DILocation(line: 87, column: 16, scope: !896)
!900 = !DILocation(line: 87, column: 6, scope: !896)
!901 = !DILocation(line: 88, column: 16, scope: !902)
!902 = distinct !DILexicalBlock(scope: !897, file: !2, line: 87, column: 33)
!903 = !DILocation(line: 88, column: 29, scope: !902)
!904 = !DILocation(line: 88, column: 37, scope: !902)
!905 = !DILocation(line: 88, column: 39, scope: !902)
!906 = !DILocation(line: 88, column: 41, scope: !902)
!907 = !DILocation(line: 88, column: 40, scope: !902)
