; ModuleID = 'main.cu'
source_filename = "main.cu"
target datalayout = "e-i64:64-v16:16-v32:32-n16:32:64"
target triple = "nvptx64-nvidia-cuda"

%struct.params_common_change = type { float*, i32 }
%struct.params_common = type { i32, i32, i32, float, i32, i32, i32, i32, i32, i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32*, float*, i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i32*, i32*, float*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.params_unique = type { i32*, i32*, i32*, i32*, float*, i32, i32, float*, float*, float*, float*, float*, float*, float*, float*, float*, float*, float*, float*, float*, float* }
%struct.__cuda_builtin_blockIdx_t = type { i8 }
%struct.__cuda_builtin_threadIdx_t = type { i8 }

@d_common_change = addrspace(4) externally_initialized global %struct.params_common_change zeroinitializer, align 8, !dbg !0
@d_common = addrspace(4) externally_initialized global %struct.params_common zeroinitializer, align 8, !dbg !7
@d_unique = addrspace(4) externally_initialized global [51 x %struct.params_unique] zeroinitializer, align 8, !dbg !125

!0 = distinct !DIGlobalVariable(name: "d_common_change", scope: !1, file: !2, line: 26, type: !726, isLocal: false, isDefinition: true)
!1 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !2, producer: "clang version 4.0.0 (http://llvm.org/git/clang.git 2debfe67236df81b4b386304d4aecd9fe20fc156) (http://llvm.org/git/llvm.git 9aa8644318b899329caf41dc98a12db04dee5855)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, retainedTypes: !4, globals: !6, imports: !173)
!2 = !DIFile(filename: "main.cu", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!3 = !{}
!4 = !{!5}
!5 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!6 = !{!0, !7, !125, !153, !159, !160, !161, !162, !163, !167, !169}
!7 = distinct !DIGlobalVariable(name: "d_common", scope: !1, file: !2, line: 29, type: !8, isLocal: false, isDefinition: true)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "params_common", file: !9, line: 272, baseType: !10)
!9 = !DIFile(filename: "./define.c", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "params_common", file: !9, line: 48, size: 4160, align: 64, elements: !11, identifier: "_ZTS13params_common")
!11 = !{!12, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !26, !27, !28, !29, !30, !31, !32, !33, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "sSize", scope: !10, file: !9, line: 58, baseType: !13, size: 32, align: 32)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "tSize", scope: !10, file: !9, line: 59, baseType: !13, size: 32, align: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "maxMove", scope: !10, file: !9, line: 60, baseType: !13, size: 32, align: 32, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !10, file: !9, line: 61, baseType: !5, size: 32, align: 32, offset: 96)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "no_frames", scope: !10, file: !9, line: 67, baseType: !13, size: 32, align: 32, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rows", scope: !10, file: !9, line: 68, baseType: !13, size: 32, align: 32, offset: 160)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cols", scope: !10, file: !9, line: 69, baseType: !13, size: 32, align: 32, offset: 192)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "frame_elem", scope: !10, file: !9, line: 70, baseType: !13, size: 32, align: 32, offset: 224)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mem", scope: !10, file: !9, line: 71, baseType: !13, size: 32, align: 32, offset: 256)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "endoPoints", scope: !10, file: !9, line: 77, baseType: !13, size: 32, align: 32, offset: 288)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "endo_mem", scope: !10, file: !9, line: 78, baseType: !13, size: 32, align: 32, offset: 320)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "endoRow", scope: !10, file: !9, line: 80, baseType: !25, size: 64, align: 64, offset: 384)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "endoCol", scope: !10, file: !9, line: 81, baseType: !25, size: 64, align: 64, offset: 448)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tEndoRowLoc", scope: !10, file: !9, line: 82, baseType: !25, size: 64, align: 64, offset: 512)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tEndoColLoc", scope: !10, file: !9, line: 83, baseType: !25, size: 64, align: 64, offset: 576)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "d_endoRow", scope: !10, file: !9, line: 85, baseType: !25, size: 64, align: 64, offset: 640)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "d_endoCol", scope: !10, file: !9, line: 86, baseType: !25, size: 64, align: 64, offset: 704)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "d_tEndoRowLoc", scope: !10, file: !9, line: 87, baseType: !25, size: 64, align: 64, offset: 768)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "d_tEndoColLoc", scope: !10, file: !9, line: 88, baseType: !25, size: 64, align: 64, offset: 832)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "d_endoT", scope: !10, file: !9, line: 90, baseType: !34, size: 64, align: 64, offset: 896)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "epiPoints", scope: !10, file: !9, line: 95, baseType: !13, size: 32, align: 32, offset: 960)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "epi_mem", scope: !10, file: !9, line: 96, baseType: !13, size: 32, align: 32, offset: 992)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "epiRow", scope: !10, file: !9, line: 98, baseType: !25, size: 64, align: 64, offset: 1024)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "epiCol", scope: !10, file: !9, line: 99, baseType: !25, size: 64, align: 64, offset: 1088)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "tEpiRowLoc", scope: !10, file: !9, line: 100, baseType: !25, size: 64, align: 64, offset: 1152)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tEpiColLoc", scope: !10, file: !9, line: 101, baseType: !25, size: 64, align: 64, offset: 1216)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "d_epiRow", scope: !10, file: !9, line: 103, baseType: !25, size: 64, align: 64, offset: 1280)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "d_epiCol", scope: !10, file: !9, line: 104, baseType: !25, size: 64, align: 64, offset: 1344)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "d_tEpiRowLoc", scope: !10, file: !9, line: 105, baseType: !25, size: 64, align: 64, offset: 1408)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "d_tEpiColLoc", scope: !10, file: !9, line: 106, baseType: !25, size: 64, align: 64, offset: 1472)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "d_epiT", scope: !10, file: !9, line: 108, baseType: !34, size: 64, align: 64, offset: 1536)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "allPoints", scope: !10, file: !9, line: 114, baseType: !13, size: 32, align: 32, offset: 1600)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "in_rows", scope: !10, file: !9, line: 120, baseType: !13, size: 32, align: 32, offset: 1632)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "in_cols", scope: !10, file: !9, line: 121, baseType: !13, size: 32, align: 32, offset: 1664)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "in_elem", scope: !10, file: !9, line: 122, baseType: !13, size: 32, align: 32, offset: 1696)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "in_mem", scope: !10, file: !9, line: 123, baseType: !13, size: 32, align: 32, offset: 1728)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "in2_rows", scope: !10, file: !9, line: 129, baseType: !13, size: 32, align: 32, offset: 1760)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "in2_cols", scope: !10, file: !9, line: 130, baseType: !13, size: 32, align: 32, offset: 1792)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "in2_elem", scope: !10, file: !9, line: 131, baseType: !13, size: 32, align: 32, offset: 1824)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "in2_mem", scope: !10, file: !9, line: 132, baseType: !13, size: 32, align: 32, offset: 1856)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "conv_rows", scope: !10, file: !9, line: 138, baseType: !13, size: 32, align: 32, offset: 1888)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "conv_cols", scope: !10, file: !9, line: 139, baseType: !13, size: 32, align: 32, offset: 1920)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "conv_elem", scope: !10, file: !9, line: 140, baseType: !13, size: 32, align: 32, offset: 1952)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "conv_mem", scope: !10, file: !9, line: 141, baseType: !13, size: 32, align: 32, offset: 1984)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ioffset", scope: !10, file: !9, line: 142, baseType: !13, size: 32, align: 32, offset: 2016)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "joffset", scope: !10, file: !9, line: 143, baseType: !13, size: 32, align: 32, offset: 2048)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_add_rows", scope: !10, file: !9, line: 153, baseType: !13, size: 32, align: 32, offset: 2080)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_add_cols", scope: !10, file: !9, line: 154, baseType: !13, size: 32, align: 32, offset: 2112)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_rows", scope: !10, file: !9, line: 155, baseType: !13, size: 32, align: 32, offset: 2144)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_cols", scope: !10, file: !9, line: 156, baseType: !13, size: 32, align: 32, offset: 2176)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_elem", scope: !10, file: !9, line: 157, baseType: !13, size: 32, align: 32, offset: 2208)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_mem", scope: !10, file: !9, line: 158, baseType: !13, size: 32, align: 32, offset: 2240)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_rows", scope: !10, file: !9, line: 164, baseType: !13, size: 32, align: 32, offset: 2272)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_cols", scope: !10, file: !9, line: 165, baseType: !13, size: 32, align: 32, offset: 2304)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_elem", scope: !10, file: !9, line: 166, baseType: !13, size: 32, align: 32, offset: 2336)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_mem", scope: !10, file: !9, line: 167, baseType: !13, size: 32, align: 32, offset: 2368)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_rowlow", scope: !10, file: !9, line: 168, baseType: !13, size: 32, align: 32, offset: 2400)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_rowhig", scope: !10, file: !9, line: 169, baseType: !13, size: 32, align: 32, offset: 2432)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_collow", scope: !10, file: !9, line: 170, baseType: !13, size: 32, align: 32, offset: 2464)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel_colhig", scope: !10, file: !9, line: 171, baseType: !13, size: 32, align: 32, offset: 2496)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel2_rowlow", scope: !10, file: !9, line: 177, baseType: !13, size: 32, align: 32, offset: 2528)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel2_rowhig", scope: !10, file: !9, line: 178, baseType: !13, size: 32, align: 32, offset: 2560)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel2_collow", scope: !10, file: !9, line: 179, baseType: !13, size: 32, align: 32, offset: 2592)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "in2_pad_cumv_sel2_colhig", scope: !10, file: !9, line: 180, baseType: !13, size: 32, align: 32, offset: 2624)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_rows", scope: !10, file: !9, line: 181, baseType: !13, size: 32, align: 32, offset: 2656)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_cols", scope: !10, file: !9, line: 182, baseType: !13, size: 32, align: 32, offset: 2688)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_elem", scope: !10, file: !9, line: 183, baseType: !13, size: 32, align: 32, offset: 2720)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_mem", scope: !10, file: !9, line: 184, baseType: !13, size: 32, align: 32, offset: 2752)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_rows", scope: !10, file: !9, line: 190, baseType: !13, size: 32, align: 32, offset: 2784)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_cols", scope: !10, file: !9, line: 191, baseType: !13, size: 32, align: 32, offset: 2816)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_elem", scope: !10, file: !9, line: 192, baseType: !13, size: 32, align: 32, offset: 2848)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_mem", scope: !10, file: !9, line: 193, baseType: !13, size: 32, align: 32, offset: 2880)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_rowlow", scope: !10, file: !9, line: 194, baseType: !13, size: 32, align: 32, offset: 2912)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_rowhig", scope: !10, file: !9, line: 195, baseType: !13, size: 32, align: 32, offset: 2944)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_collow", scope: !10, file: !9, line: 196, baseType: !13, size: 32, align: 32, offset: 2976)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel_colhig", scope: !10, file: !9, line: 197, baseType: !13, size: 32, align: 32, offset: 3008)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel2_rowlow", scope: !10, file: !9, line: 203, baseType: !13, size: 32, align: 32, offset: 3040)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel2_rowhig", scope: !10, file: !9, line: 204, baseType: !13, size: 32, align: 32, offset: 3072)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel2_collow", scope: !10, file: !9, line: 205, baseType: !13, size: 32, align: 32, offset: 3104)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub_cumh_sel2_colhig", scope: !10, file: !9, line: 206, baseType: !13, size: 32, align: 32, offset: 3136)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub2_rows", scope: !10, file: !9, line: 207, baseType: !13, size: 32, align: 32, offset: 3168)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub2_cols", scope: !10, file: !9, line: 208, baseType: !13, size: 32, align: 32, offset: 3200)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub2_elem", scope: !10, file: !9, line: 209, baseType: !13, size: 32, align: 32, offset: 3232)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sub2_mem", scope: !10, file: !9, line: 210, baseType: !13, size: 32, align: 32, offset: 3264)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_rows", scope: !10, file: !9, line: 220, baseType: !13, size: 32, align: 32, offset: 3296)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_cols", scope: !10, file: !9, line: 221, baseType: !13, size: 32, align: 32, offset: 3328)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_elem", scope: !10, file: !9, line: 222, baseType: !13, size: 32, align: 32, offset: 3360)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_mem", scope: !10, file: !9, line: 223, baseType: !13, size: 32, align: 32, offset: 3392)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_sub2_rows", scope: !10, file: !9, line: 229, baseType: !13, size: 32, align: 32, offset: 3424)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_sub2_cols", scope: !10, file: !9, line: 230, baseType: !13, size: 32, align: 32, offset: 3456)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_sub2_elem", scope: !10, file: !9, line: 231, baseType: !13, size: 32, align: 32, offset: 3488)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "in2_sqr_sub2_mem", scope: !10, file: !9, line: 232, baseType: !13, size: 32, align: 32, offset: 3520)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "in_sqr_rows", scope: !10, file: !9, line: 238, baseType: !13, size: 32, align: 32, offset: 3552)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "in_sqr_cols", scope: !10, file: !9, line: 239, baseType: !13, size: 32, align: 32, offset: 3584)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "in_sqr_elem", scope: !10, file: !9, line: 240, baseType: !13, size: 32, align: 32, offset: 3616)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "in_sqr_mem", scope: !10, file: !9, line: 241, baseType: !13, size: 32, align: 32, offset: 3648)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tMask_rows", scope: !10, file: !9, line: 247, baseType: !13, size: 32, align: 32, offset: 3680)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tMask_cols", scope: !10, file: !9, line: 248, baseType: !13, size: 32, align: 32, offset: 3712)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tMask_elem", scope: !10, file: !9, line: 249, baseType: !13, size: 32, align: 32, offset: 3744)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tMask_mem", scope: !10, file: !9, line: 250, baseType: !13, size: 32, align: 32, offset: 3776)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "mask_rows", scope: !10, file: !9, line: 256, baseType: !13, size: 32, align: 32, offset: 3808)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mask_cols", scope: !10, file: !9, line: 257, baseType: !13, size: 32, align: 32, offset: 3840)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "mask_elem", scope: !10, file: !9, line: 258, baseType: !13, size: 32, align: 32, offset: 3872)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "mask_mem", scope: !10, file: !9, line: 259, baseType: !13, size: 32, align: 32, offset: 3904)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "mask_conv_rows", scope: !10, file: !9, line: 265, baseType: !13, size: 32, align: 32, offset: 3936)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "mask_conv_cols", scope: !10, file: !9, line: 266, baseType: !13, size: 32, align: 32, offset: 3968)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "mask_conv_elem", scope: !10, file: !9, line: 267, baseType: !13, size: 32, align: 32, offset: 4000)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "mask_conv_mem", scope: !10, file: !9, line: 268, baseType: !13, size: 32, align: 32, offset: 4032)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "mask_conv_ioffset", scope: !10, file: !9, line: 269, baseType: !13, size: 32, align: 32, offset: 4064)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "mask_conv_joffset", scope: !10, file: !9, line: 270, baseType: !13, size: 32, align: 32, offset: 4096)
!125 = distinct !DIGlobalVariable(name: "d_unique", scope: !1, file: !2, line: 32, type: !126, isLocal: false, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 65280, align: 64, elements: !151)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "params_unique", file: !9, line: 391, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "params_unique", file: !9, line: 280, size: 1280, align: 64, elements: !129, identifier: "_ZTS13params_unique")
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "d_Row", scope: !128, file: !9, line: 286, baseType: !25, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "d_Col", scope: !128, file: !9, line: 287, baseType: !25, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "d_tRowLoc", scope: !128, file: !9, line: 288, baseType: !25, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "d_tColLoc", scope: !128, file: !9, line: 289, baseType: !25, size: 64, align: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "d_T", scope: !128, file: !9, line: 290, baseType: !34, size: 64, align: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "point_no", scope: !128, file: !9, line: 296, baseType: !13, size: 32, align: 32, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "in_pointer", scope: !128, file: !9, line: 302, baseType: !13, size: 32, align: 32, offset: 352)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2", scope: !128, file: !9, line: 308, baseType: !34, size: 64, align: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "d_conv", scope: !128, file: !9, line: 314, baseType: !34, size: 64, align: 64, offset: 448)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "d_in_mod", scope: !128, file: !9, line: 315, baseType: !34, size: 64, align: 64, offset: 512)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_pad_cumv", scope: !128, file: !9, line: 325, baseType: !34, size: 64, align: 64, offset: 576)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_pad_cumv_sel", scope: !128, file: !9, line: 331, baseType: !34, size: 64, align: 64, offset: 640)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_sub_cumh", scope: !128, file: !9, line: 337, baseType: !34, size: 64, align: 64, offset: 704)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_sub_cumh_sel", scope: !128, file: !9, line: 343, baseType: !34, size: 64, align: 64, offset: 768)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_sub2", scope: !128, file: !9, line: 349, baseType: !34, size: 64, align: 64, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_sqr", scope: !128, file: !9, line: 359, baseType: !34, size: 64, align: 64, offset: 896)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "d_in2_sqr_sub2", scope: !128, file: !9, line: 365, baseType: !34, size: 64, align: 64, offset: 960)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "d_in_sqr", scope: !128, file: !9, line: 371, baseType: !34, size: 64, align: 64, offset: 1024)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "d_tMask", scope: !128, file: !9, line: 377, baseType: !34, size: 64, align: 64, offset: 1088)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "d_mask", scope: !128, file: !9, line: 383, baseType: !34, size: 64, align: 64, offset: 1152)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "d_mask_conv", scope: !128, file: !9, line: 389, baseType: !34, size: 64, align: 64, offset: 1216)
!151 = !{!152}
!152 = !DISubrange(count: 51)
!153 = distinct !DIGlobalVariable(name: "in_partial_sum", scope: !154, file: !155, line: 52, type: !158, isLocal: true, isDefinition: true)
!154 = distinct !DISubprogram(name: "kernel", linkageName: "_Z6kernelv", scope: !155, file: !155, line: 7, type: !156, isLocal: false, isDefinition: true, scopeLine: 7, flags: DIFlagPrototyped, isOptimized: false, unit: !1, variables: !3)
!155 = !DIFile(filename: "./kernel.cu", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!156 = !DISubroutineType(types: !157)
!157 = !{null}
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 1632, align: 32, elements: !151)
!159 = distinct !DIGlobalVariable(name: "in_sqr_partial_sum", scope: !154, file: !155, line: 53, type: !158, isLocal: true, isDefinition: true)
!160 = distinct !DIGlobalVariable(name: "in_final_sum", scope: !154, file: !155, line: 54, type: !5, isLocal: true, isDefinition: true)
!161 = distinct !DIGlobalVariable(name: "in_sqr_final_sum", scope: !154, file: !155, line: 55, type: !5, isLocal: true, isDefinition: true)
!162 = distinct !DIGlobalVariable(name: "denomT", scope: !154, file: !155, line: 60, type: !5, isLocal: true, isDefinition: true)
!163 = distinct !DIGlobalVariable(name: "par_max_val", scope: !154, file: !155, line: 61, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 4192, align: 32, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 131)
!167 = distinct !DIGlobalVariable(name: "par_max_coo", scope: !154, file: !155, line: 62, type: !168, isLocal: true, isDefinition: true)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 4192, align: 32, elements: !165)
!169 = distinct !DIGlobalVariable(name: "d_in_mod_temp", scope: !154, file: !155, line: 64, type: !170, isLocal: true, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 83232, align: 32, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 2601)
!173 = !{!174, !181, !185, !187, !189, !191, !193, !197, !199, !201, !203, !205, !207, !209, !211, !213, !215, !217, !219, !221, !223, !225, !229, !231, !233, !235, !239, !243, !245, !247, !252, !256, !258, !260, !262, !264, !266, !268, !270, !272, !277, !281, !283, !285, !289, !291, !293, !295, !297, !299, !303, !305, !307, !311, !319, !323, !325, !327, !331, !333, !335, !339, !341, !343, !347, !349, !351, !353, !355, !358, !360, !362, !364, !366, !371, !373, !375, !379, !381, !383, !385, !387, !389, !391, !393, !397, !401, !403, !405, !410, !412, !414, !416, !418, !420, !422, !426, !432, !434, !438, !443, !445, !449, !453, !467, !471, !475, !479, !483, !488, !490, !494, !498, !502, !510, !514, !518, !522, !526, !531, !537, !541, !545, !547, !555, !559, !567, !569, !571, !575, !579, !583, !588, !592, !597, !598, !599, !600, !603, !604, !605, !606, !607, !608, !609, !612, !614, !616, !618, !620, !622, !624, !626, !629, !631, !633, !635, !637, !639, !641, !643, !645, !647, !649, !651, !653, !655, !657, !659, !661, !663, !665, !667, !669, !671, !673, !675, !677, !679, !681, !683, !685, !687, !689, !691, !693, !697, !698, !700, !702, !704, !706, !708, !710, !712, !714, !716, !718, !720, !722, !724}
!174 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !177, line: 189)
!175 = !DINamespace(name: "std", scope: null, file: !176, line: 188)
!176 = !DIFile(filename: "/usr/local/bin/../lib/clang/4.0.0/include/__clang_cuda_math_forward_declares.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!177 = !DISubprogram(name: "abs", linkageName: "_ZL3absx", scope: !176, file: !176, line: 44, type: !178, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!178 = !DISubroutineType(types: !179)
!179 = !{!180, !180}
!180 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!181 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !182, line: 190)
!182 = !DISubprogram(name: "acos", linkageName: "_ZL4acosf", scope: !176, file: !176, line: 46, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!183 = !DISubroutineType(types: !184)
!184 = !{!5, !5}
!185 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !186, line: 191)
!186 = !DISubprogram(name: "acosh", linkageName: "_ZL5acoshf", scope: !176, file: !176, line: 48, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!187 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !188, line: 192)
!188 = !DISubprogram(name: "asin", linkageName: "_ZL4asinf", scope: !176, file: !176, line: 50, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!189 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !190, line: 193)
!190 = !DISubprogram(name: "asinh", linkageName: "_ZL5asinhf", scope: !176, file: !176, line: 52, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!191 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !192, line: 194)
!192 = !DISubprogram(name: "atan", linkageName: "_ZL4atanf", scope: !176, file: !176, line: 56, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!193 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !194, line: 195)
!194 = !DISubprogram(name: "atan2", linkageName: "_ZL5atan2ff", scope: !176, file: !176, line: 54, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!195 = !DISubroutineType(types: !196)
!196 = !{!5, !5, !5}
!197 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !198, line: 196)
!198 = !DISubprogram(name: "atanh", linkageName: "_ZL5atanhf", scope: !176, file: !176, line: 58, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!199 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !200, line: 197)
!200 = !DISubprogram(name: "cbrt", linkageName: "_ZL4cbrtf", scope: !176, file: !176, line: 60, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!201 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !202, line: 198)
!202 = !DISubprogram(name: "ceil", linkageName: "_ZL4ceilf", scope: !176, file: !176, line: 62, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!203 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !204, line: 199)
!204 = !DISubprogram(name: "copysign", linkageName: "_ZL8copysignff", scope: !176, file: !176, line: 64, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!205 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !206, line: 200)
!206 = !DISubprogram(name: "cos", linkageName: "_ZL3cosf", scope: !176, file: !176, line: 66, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!207 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !208, line: 201)
!208 = !DISubprogram(name: "cosh", linkageName: "_ZL4coshf", scope: !176, file: !176, line: 68, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!209 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !210, line: 202)
!210 = !DISubprogram(name: "erf", linkageName: "_ZL3erff", scope: !176, file: !176, line: 72, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!211 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !212, line: 203)
!212 = !DISubprogram(name: "erfc", linkageName: "_ZL4erfcf", scope: !176, file: !176, line: 70, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!213 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !214, line: 204)
!214 = !DISubprogram(name: "exp", linkageName: "_ZL3expf", scope: !176, file: !176, line: 76, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!215 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !216, line: 205)
!216 = !DISubprogram(name: "exp2", linkageName: "_ZL4exp2f", scope: !176, file: !176, line: 74, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!217 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !218, line: 206)
!218 = !DISubprogram(name: "expm1", linkageName: "_ZL5expm1f", scope: !176, file: !176, line: 78, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!219 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !220, line: 207)
!220 = !DISubprogram(name: "fabs", linkageName: "_ZL4fabsf", scope: !176, file: !176, line: 80, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!221 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !222, line: 208)
!222 = !DISubprogram(name: "fdim", linkageName: "_ZL4fdimff", scope: !176, file: !176, line: 82, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!223 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !224, line: 209)
!224 = !DISubprogram(name: "floor", linkageName: "_ZL5floorf", scope: !176, file: !176, line: 84, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!225 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !226, line: 210)
!226 = !DISubprogram(name: "fma", linkageName: "_ZL3fmafff", scope: !176, file: !176, line: 86, type: !227, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!227 = !DISubroutineType(types: !228)
!228 = !{!5, !5, !5, !5}
!229 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !230, line: 211)
!230 = !DISubprogram(name: "fmax", linkageName: "_ZL4fmaxff", scope: !176, file: !176, line: 88, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!231 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !232, line: 212)
!232 = !DISubprogram(name: "fmin", linkageName: "_ZL4fminff", scope: !176, file: !176, line: 90, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!233 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !234, line: 213)
!234 = !DISubprogram(name: "fmod", linkageName: "_ZL4fmodff", scope: !176, file: !176, line: 92, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!235 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !236, line: 214)
!236 = !DISubprogram(name: "fpclassify", linkageName: "_ZL10fpclassifyf", scope: !176, file: !176, line: 94, type: !237, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!237 = !DISubroutineType(types: !238)
!238 = !{!13, !5}
!239 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !240, line: 215)
!240 = !DISubprogram(name: "frexp", linkageName: "_ZL5frexpfPi", scope: !176, file: !176, line: 96, type: !241, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!241 = !DISubroutineType(types: !242)
!242 = !{!5, !5, !25}
!243 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !244, line: 216)
!244 = !DISubprogram(name: "hypot", linkageName: "_ZL5hypotff", scope: !176, file: !176, line: 98, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!245 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !246, line: 217)
!246 = !DISubprogram(name: "ilogb", linkageName: "_ZL5ilogbf", scope: !176, file: !176, line: 100, type: !237, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!247 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !248, line: 218)
!248 = !DISubprogram(name: "isfinite", linkageName: "_ZL8isfinitef", scope: !176, file: !176, line: 102, type: !249, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!249 = !DISubroutineType(types: !250)
!250 = !{!251, !5}
!251 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!252 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !253, line: 219)
!253 = !DISubprogram(name: "isgreater", linkageName: "_ZL9isgreaterff", scope: !176, file: !176, line: 106, type: !254, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!254 = !DISubroutineType(types: !255)
!255 = !{!251, !5, !5}
!256 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !257, line: 220)
!257 = !DISubprogram(name: "isgreaterequal", linkageName: "_ZL14isgreaterequalff", scope: !176, file: !176, line: 105, type: !254, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!258 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !259, line: 221)
!259 = !DISubprogram(name: "isinf", linkageName: "_ZL5isinff", scope: !176, file: !176, line: 108, type: !249, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!260 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !261, line: 222)
!261 = !DISubprogram(name: "isless", linkageName: "_ZL6islessff", scope: !176, file: !176, line: 112, type: !254, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!262 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !263, line: 223)
!263 = !DISubprogram(name: "islessequal", linkageName: "_ZL11islessequalff", scope: !176, file: !176, line: 111, type: !254, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!264 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !265, line: 224)
!265 = !DISubprogram(name: "islessgreater", linkageName: "_ZL13islessgreaterff", scope: !176, file: !176, line: 114, type: !254, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!266 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !267, line: 225)
!267 = !DISubprogram(name: "isnan", linkageName: "_ZL5isnanf", scope: !176, file: !176, line: 116, type: !249, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!268 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !269, line: 226)
!269 = !DISubprogram(name: "isnormal", linkageName: "_ZL8isnormalf", scope: !176, file: !176, line: 118, type: !249, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!270 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !271, line: 227)
!271 = !DISubprogram(name: "isunordered", linkageName: "_ZL11isunorderedff", scope: !176, file: !176, line: 120, type: !254, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!272 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !273, line: 228)
!273 = !DISubprogram(name: "labs", linkageName: "_ZL4labsl", scope: !176, file: !176, line: 121, type: !274, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!274 = !DISubroutineType(types: !275)
!275 = !{!276, !276}
!276 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!277 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !278, line: 229)
!278 = !DISubprogram(name: "ldexp", linkageName: "_ZL5ldexpfi", scope: !176, file: !176, line: 123, type: !279, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!279 = !DISubroutineType(types: !280)
!280 = !{!5, !5, !13}
!281 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !282, line: 230)
!282 = !DISubprogram(name: "lgamma", linkageName: "_ZL6lgammaf", scope: !176, file: !176, line: 125, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!283 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !284, line: 231)
!284 = !DISubprogram(name: "llabs", linkageName: "_ZL5llabsx", scope: !176, file: !176, line: 126, type: !178, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!285 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !286, line: 232)
!286 = !DISubprogram(name: "llrint", linkageName: "_ZL6llrintf", scope: !176, file: !176, line: 128, type: !287, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!287 = !DISubroutineType(types: !288)
!288 = !{!180, !5}
!289 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !290, line: 233)
!290 = !DISubprogram(name: "log", linkageName: "_ZL3logf", scope: !176, file: !176, line: 138, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!291 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !292, line: 234)
!292 = !DISubprogram(name: "log10", linkageName: "_ZL5log10f", scope: !176, file: !176, line: 130, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!293 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !294, line: 235)
!294 = !DISubprogram(name: "log1p", linkageName: "_ZL5log1pf", scope: !176, file: !176, line: 132, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!295 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !296, line: 236)
!296 = !DISubprogram(name: "log2", linkageName: "_ZL4log2f", scope: !176, file: !176, line: 134, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!297 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !298, line: 237)
!298 = !DISubprogram(name: "logb", linkageName: "_ZL4logbf", scope: !176, file: !176, line: 136, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!299 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !300, line: 238)
!300 = !DISubprogram(name: "lrint", linkageName: "_ZL5lrintf", scope: !176, file: !176, line: 140, type: !301, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!301 = !DISubroutineType(types: !302)
!302 = !{!276, !5}
!303 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !304, line: 239)
!304 = !DISubprogram(name: "lround", linkageName: "_ZL6lroundf", scope: !176, file: !176, line: 142, type: !301, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!305 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !306, line: 240)
!306 = !DISubprogram(name: "llround", linkageName: "_ZL7llroundf", scope: !176, file: !176, line: 143, type: !287, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!307 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !308, line: 241)
!308 = !DISubprogram(name: "modf", linkageName: "_ZL4modffPf", scope: !176, file: !176, line: 145, type: !309, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!309 = !DISubroutineType(types: !310)
!310 = !{!5, !5, !34}
!311 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !312, line: 242)
!312 = !DISubprogram(name: "nan", linkageName: "_ZL3nanPKc", scope: !176, file: !176, line: 146, type: !313, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!313 = !DISubroutineType(types: !314)
!314 = !{!315, !316}
!315 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !318)
!318 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!319 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !320, line: 243)
!320 = !DISubprogram(name: "nanf", linkageName: "_ZL4nanfPKc", scope: !176, file: !176, line: 147, type: !321, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!321 = !DISubroutineType(types: !322)
!322 = !{!5, !316}
!323 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !324, line: 244)
!324 = !DISubprogram(name: "nearbyint", linkageName: "_ZL9nearbyintf", scope: !176, file: !176, line: 149, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!325 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !326, line: 245)
!326 = !DISubprogram(name: "nextafter", linkageName: "_ZL9nextafterff", scope: !176, file: !176, line: 151, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!327 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !328, line: 246)
!328 = !DISubprogram(name: "nexttoward", linkageName: "_ZL10nexttowardfd", scope: !176, file: !176, line: 153, type: !329, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!329 = !DISubroutineType(types: !330)
!330 = !{!5, !5, !315}
!331 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !332, line: 247)
!332 = !DISubprogram(name: "pow", linkageName: "_ZL3powfi", scope: !176, file: !176, line: 158, type: !279, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !334, line: 248)
!334 = !DISubprogram(name: "remainder", linkageName: "_ZL9remainderff", scope: !176, file: !176, line: 160, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !336, line: 249)
!336 = !DISubprogram(name: "remquo", linkageName: "_ZL6remquoffPi", scope: !176, file: !176, line: 162, type: !337, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!337 = !DISubroutineType(types: !338)
!338 = !{!5, !5, !5, !25}
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !340, line: 250)
!340 = !DISubprogram(name: "rint", linkageName: "_ZL4rintf", scope: !176, file: !176, line: 164, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!341 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !342, line: 251)
!342 = !DISubprogram(name: "round", linkageName: "_ZL5roundf", scope: !176, file: !176, line: 166, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !344, line: 252)
!344 = !DISubprogram(name: "scalbln", linkageName: "_ZL7scalblnfl", scope: !176, file: !176, line: 168, type: !345, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!345 = !DISubroutineType(types: !346)
!346 = !{!5, !5, !276}
!347 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !348, line: 253)
!348 = !DISubprogram(name: "scalbn", linkageName: "_ZL6scalbnfi", scope: !176, file: !176, line: 170, type: !279, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!349 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !350, line: 254)
!350 = !DISubprogram(name: "signbit", linkageName: "_ZL7signbitf", scope: !176, file: !176, line: 172, type: !249, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !352, line: 255)
!352 = !DISubprogram(name: "sin", linkageName: "_ZL3sinf", scope: !176, file: !176, line: 174, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !354, line: 256)
!354 = !DISubprogram(name: "sinh", linkageName: "_ZL4sinhf", scope: !176, file: !176, line: 176, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !356, line: 257)
!356 = distinct !DISubprogram(name: "sqrt", linkageName: "_ZL4sqrtf", scope: !357, file: !357, line: 147, type: !183, isLocal: true, isDefinition: true, scopeLine: 147, flags: DIFlagPrototyped, isOptimized: false, unit: !1, variables: !3)
!357 = !DIFile(filename: "/usr/local/bin/../lib/clang/4.0.0/include/__clang_cuda_cmath.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !359, line: 258)
!359 = !DISubprogram(name: "tan", linkageName: "_ZL3tanf", scope: !176, file: !176, line: 180, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!360 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !361, line: 259)
!361 = !DISubprogram(name: "tanh", linkageName: "_ZL4tanhf", scope: !176, file: !176, line: 182, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!362 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !363, line: 260)
!363 = !DISubprogram(name: "tgamma", linkageName: "_ZL6tgammaf", scope: !176, file: !176, line: 184, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!364 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !365, line: 261)
!365 = !DISubprogram(name: "trunc", linkageName: "_ZL5truncf", scope: !176, file: !176, line: 186, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !367, line: 102)
!367 = !DISubprogram(name: "acos", scope: !368, file: !368, line: 54, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!368 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!369 = !DISubroutineType(types: !370)
!370 = !{!315, !315}
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !372, line: 121)
!372 = !DISubprogram(name: "asin", scope: !368, file: !368, line: 56, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !374, line: 140)
!374 = !DISubprogram(name: "atan", scope: !368, file: !368, line: 58, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !376, line: 159)
!376 = !DISubprogram(name: "atan2", scope: !368, file: !368, line: 60, type: !377, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!377 = !DISubroutineType(types: !378)
!378 = !{!315, !315, !315}
!379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !380, line: 180)
!380 = !DISubprogram(name: "ceil", scope: !368, file: !368, line: 178, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !382, line: 199)
!382 = !DISubprogram(name: "cos", scope: !368, file: !368, line: 63, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!383 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !384, line: 218)
!384 = !DISubprogram(name: "cosh", scope: !368, file: !368, line: 72, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !386, line: 237)
!386 = !DISubprogram(name: "exp", scope: !368, file: !368, line: 100, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!387 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !388, line: 256)
!388 = !DISubprogram(name: "fabs", scope: !368, file: !368, line: 181, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!389 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !390, line: 275)
!390 = !DISubprogram(name: "floor", scope: !368, file: !368, line: 184, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!391 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !392, line: 294)
!392 = !DISubprogram(name: "fmod", scope: !368, file: !368, line: 187, type: !377, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !394, line: 315)
!394 = !DISubprogram(name: "frexp", scope: !368, file: !368, line: 103, type: !395, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!395 = !DISubroutineType(types: !396)
!396 = !{!315, !315, !25}
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !398, line: 334)
!398 = !DISubprogram(name: "ldexp", scope: !368, file: !368, line: 106, type: !399, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!399 = !DISubroutineType(types: !400)
!400 = !{!315, !315, !13}
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !402, line: 353)
!402 = !DISubprogram(name: "log", scope: !368, file: !368, line: 109, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !404, line: 372)
!404 = !DISubprogram(name: "log10", scope: !368, file: !368, line: 112, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !406, line: 391)
!406 = !DISubprogram(name: "modf", scope: !368, file: !368, line: 115, type: !407, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!407 = !DISubroutineType(types: !408)
!408 = !{!315, !315, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64, align: 64)
!410 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !411, line: 403)
!411 = !DISubprogram(name: "pow", scope: !368, file: !368, line: 153, type: !377, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !413, line: 440)
!413 = !DISubprogram(name: "sin", scope: !368, file: !368, line: 65, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !415, line: 459)
!415 = !DISubprogram(name: "sinh", scope: !368, file: !368, line: 74, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !417, line: 478)
!417 = !DISubprogram(name: "sqrt", scope: !368, file: !368, line: 156, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !419, line: 497)
!419 = !DISubprogram(name: "tan", scope: !368, file: !368, line: 67, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !421, line: 516)
!421 = !DISubprogram(name: "tanh", scope: !368, file: !368, line: 76, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !423, line: 118)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !424, line: 101, baseType: !425)
!424 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!425 = !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 97, size: 64, align: 32, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !427, line: 119)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !424, line: 109, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 105, size: 128, align: 64, elements: !429, identifier: "_ZTS6ldiv_t")
!429 = !{!430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !428, file: !424, line: 107, baseType: !276, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !428, file: !424, line: 108, baseType: !276, size: 64, align: 64, offset: 64)
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !433, line: 121)
!433 = !DISubprogram(name: "abort", scope: !424, file: !424, line: 515, type: !156, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !435, line: 122)
!435 = !DISubprogram(name: "abs", scope: !424, file: !424, line: 774, type: !436, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!436 = !DISubroutineType(types: !437)
!437 = !{!13, !13}
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !439, line: 123)
!439 = !DISubprogram(name: "atexit", scope: !424, file: !424, line: 519, type: !440, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!440 = !DISubroutineType(types: !441)
!441 = !{!13, !442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !444, line: 129)
!444 = !DISubprogram(name: "atof", scope: !424, file: !424, line: 144, type: !313, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !446, line: 130)
!446 = !DISubprogram(name: "atoi", scope: !424, file: !424, line: 147, type: !447, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!447 = !DISubroutineType(types: !448)
!448 = !{!13, !316}
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !450, line: 131)
!450 = !DISubprogram(name: "atol", scope: !424, file: !424, line: 150, type: !451, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!451 = !DISubroutineType(types: !452)
!452 = !{!276, !316}
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !454, line: 132)
!454 = !DISubprogram(name: "bsearch", scope: !424, file: !424, line: 754, type: !455, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!455 = !DISubroutineType(types: !456)
!456 = !{!457, !458, !458, !460, !460, !463}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !461, line: 62, baseType: !462)
!461 = !DIFile(filename: "/usr/local/bin/../lib/clang/4.0.0/include/stddef.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!462 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !424, line: 741, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!13, !458, !458}
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !468, line: 133)
!468 = !DISubprogram(name: "calloc", scope: !424, file: !424, line: 468, type: !469, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!469 = !DISubroutineType(types: !470)
!470 = !{!457, !460, !460}
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !472, line: 134)
!472 = !DISubprogram(name: "div", scope: !424, file: !424, line: 788, type: !473, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!473 = !DISubroutineType(types: !474)
!474 = !{!423, !13, !13}
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !476, line: 135)
!476 = !DISubprogram(name: "exit", scope: !424, file: !424, line: 543, type: !477, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !13}
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !480, line: 136)
!480 = !DISubprogram(name: "free", scope: !424, file: !424, line: 483, type: !481, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !457}
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !484, line: 137)
!484 = !DISubprogram(name: "getenv", scope: !424, file: !424, line: 564, type: !485, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!485 = !DISubroutineType(types: !486)
!486 = !{!487, !316}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !489, line: 138)
!489 = !DISubprogram(name: "labs", scope: !424, file: !424, line: 775, type: !274, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !491, line: 139)
!491 = !DISubprogram(name: "ldiv", scope: !424, file: !424, line: 790, type: !492, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!492 = !DISubroutineType(types: !493)
!493 = !{!427, !276, !276}
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !495, line: 140)
!495 = !DISubprogram(name: "malloc", scope: !424, file: !424, line: 466, type: !496, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!496 = !DISubroutineType(types: !497)
!497 = !{!457, !460}
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !499, line: 142)
!499 = !DISubprogram(name: "mblen", scope: !424, file: !424, line: 862, type: !500, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!500 = !DISubroutineType(types: !501)
!501 = !{!13, !316, !460}
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !503, line: 143)
!503 = !DISubprogram(name: "mbstowcs", scope: !424, file: !424, line: 873, type: !504, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!504 = !DISubroutineType(types: !505)
!505 = !{!460, !506, !509, !460}
!506 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DIBasicType(name: "wchar_t", size: 32, align: 32, encoding: DW_ATE_signed)
!509 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !316)
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !511, line: 144)
!511 = !DISubprogram(name: "mbtowc", scope: !424, file: !424, line: 865, type: !512, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!512 = !DISubroutineType(types: !513)
!513 = !{!13, !506, !509, !460}
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !515, line: 146)
!515 = !DISubprogram(name: "qsort", scope: !424, file: !424, line: 764, type: !516, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !457, !460, !460, !463}
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !519, line: 152)
!519 = !DISubprogram(name: "rand", scope: !424, file: !424, line: 374, type: !520, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!520 = !DISubroutineType(types: !521)
!521 = !{!13}
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !523, line: 153)
!523 = !DISubprogram(name: "realloc", scope: !424, file: !424, line: 480, type: !524, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!524 = !DISubroutineType(types: !525)
!525 = !{!457, !457, !460}
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !527, line: 154)
!527 = !DISubprogram(name: "srand", scope: !424, file: !424, line: 376, type: !528, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !530}
!530 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !532, line: 155)
!532 = !DISubprogram(name: "strtod", scope: !424, file: !424, line: 164, type: !533, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!533 = !DISubroutineType(types: !534)
!534 = !{!315, !509, !535}
!535 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !538, line: 156)
!538 = !DISubprogram(name: "strtol", scope: !424, file: !424, line: 183, type: !539, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!539 = !DISubroutineType(types: !540)
!540 = !{!276, !509, !535, !13}
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !542, line: 157)
!542 = !DISubprogram(name: "strtoul", scope: !424, file: !424, line: 187, type: !543, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!543 = !DISubroutineType(types: !544)
!544 = !{!462, !509, !535, !13}
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !546, line: 158)
!546 = !DISubprogram(name: "system", scope: !424, file: !424, line: 716, type: !447, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !548, line: 160)
!548 = !DISubprogram(name: "wcstombs", scope: !424, file: !424, line: 876, type: !549, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!549 = !DISubroutineType(types: !550)
!550 = !{!460, !551, !552, !460}
!551 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !487)
!552 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64, align: 64)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !556, line: 161)
!556 = !DISubprogram(name: "wctomb", scope: !424, file: !424, line: 869, type: !557, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!557 = !DISubroutineType(types: !558)
!558 = !{!13, !487, !508}
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !560, entity: !562, line: 214)
!560 = !DINamespace(name: "__gnu_cxx", scope: null, file: !561, line: 220)
!561 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/x86_64-linux-gnu/c++/5.4.0/bits/c++config.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !424, line: 121, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 117, size: 128, align: 64, elements: !564, identifier: "_ZTS7lldiv_t")
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !563, file: !424, line: 119, baseType: !180, size: 64, align: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !563, file: !424, line: 120, baseType: !180, size: 64, align: 64, offset: 64)
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !560, entity: !568, line: 220)
!568 = !DISubprogram(name: "_Exit", scope: !424, file: !424, line: 557, type: !477, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !560, entity: !570, line: 224)
!570 = !DISubprogram(name: "llabs", scope: !424, file: !424, line: 779, type: !178, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !560, entity: !572, line: 230)
!572 = !DISubprogram(name: "lldiv", scope: !424, file: !424, line: 796, type: !573, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!573 = !DISubroutineType(types: !574)
!574 = !{!562, !180, !180}
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !560, entity: !576, line: 241)
!576 = !DISubprogram(name: "atoll", scope: !424, file: !424, line: 157, type: !577, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!577 = !DISubroutineType(types: !578)
!578 = !{!180, !316}
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !560, entity: !580, line: 242)
!580 = !DISubprogram(name: "strtoll", scope: !424, file: !424, line: 209, type: !581, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!581 = !DISubroutineType(types: !582)
!582 = !{!180, !509, !535, !13}
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !560, entity: !584, line: 243)
!584 = !DISubprogram(name: "strtoull", scope: !424, file: !424, line: 214, type: !585, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!585 = !DISubroutineType(types: !586)
!586 = !{!587, !509, !535, !13}
!587 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !560, entity: !589, line: 245)
!589 = !DISubprogram(name: "strtof", scope: !424, file: !424, line: 172, type: !590, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!590 = !DISubroutineType(types: !591)
!591 = !{!5, !509, !535}
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !560, entity: !593, line: 246)
!593 = !DISubprogram(name: "strtold", scope: !424, file: !424, line: 175, type: !594, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!594 = !DISubroutineType(types: !595)
!595 = !{!596, !509, !535}
!596 = !DIBasicType(name: "long double", size: 64, align: 64, encoding: DW_ATE_float)
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !562, line: 254)
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !568, line: 256)
!599 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !570, line: 258)
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !601, line: 259)
!601 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !560, file: !602, line: 227, type: !573, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!602 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/cstdlib", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !572, line: 260)
!604 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !576, line: 262)
!605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !589, line: 263)
!606 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !580, line: 264)
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !584, line: 265)
!608 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !593, line: 266)
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !610, line: 397)
!610 = !DISubprogram(name: "acosf", linkageName: "_ZL5acosff", scope: !611, file: !611, line: 1342, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!611 = !DIFile(filename: "/usr/local/cuda/include/math_functions.hpp", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !613, line: 398)
!613 = !DISubprogram(name: "acoshf", linkageName: "_ZL6acoshff", scope: !611, file: !611, line: 1370, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !615, line: 399)
!615 = !DISubprogram(name: "asinf", linkageName: "_ZL5asinff", scope: !611, file: !611, line: 1337, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !617, line: 400)
!617 = !DISubprogram(name: "asinhf", linkageName: "_ZL6asinhff", scope: !611, file: !611, line: 1375, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !619, line: 401)
!619 = !DISubprogram(name: "atan2f", linkageName: "_ZL6atan2fff", scope: !611, file: !611, line: 1327, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!620 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !621, line: 402)
!621 = !DISubprogram(name: "atanf", linkageName: "_ZL5atanff", scope: !611, file: !611, line: 1332, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !623, line: 403)
!623 = !DISubprogram(name: "atanhf", linkageName: "_ZL6atanhff", scope: !611, file: !611, line: 1380, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!624 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !625, line: 404)
!625 = !DISubprogram(name: "cbrtf", linkageName: "_ZL5cbrtff", scope: !611, file: !611, line: 1430, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !627, line: 405)
!627 = !DISubprogram(name: "ceilf", linkageName: "_ZL5ceilff", scope: !628, file: !628, line: 667, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!628 = !DIFile(filename: "/usr/local/cuda/include/device_functions.hpp", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/heartwall")
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !630, line: 406)
!630 = !DISubprogram(name: "copysignf", linkageName: "_ZL9copysignfff", scope: !611, file: !611, line: 1189, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !632, line: 407)
!632 = !DISubprogram(name: "cosf", linkageName: "_ZL4cosff", scope: !611, file: !611, line: 1243, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !634, line: 408)
!634 = !DISubprogram(name: "coshf", linkageName: "_ZL5coshff", scope: !611, file: !611, line: 1312, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !636, line: 409)
!636 = !DISubprogram(name: "erfcf", linkageName: "_ZL5erfcff", scope: !611, file: !611, line: 1490, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !638, line: 410)
!638 = !DISubprogram(name: "erff", linkageName: "_ZL4erfff", scope: !611, file: !611, line: 1480, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !640, line: 411)
!640 = !DISubprogram(name: "exp2f", linkageName: "_ZL5exp2ff", scope: !628, file: !628, line: 657, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !642, line: 412)
!642 = !DISubprogram(name: "expf", linkageName: "_ZL4expff", scope: !611, file: !611, line: 1294, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !644, line: 413)
!644 = !DISubprogram(name: "expm1f", linkageName: "_ZL6expm1ff", scope: !611, file: !611, line: 1385, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !646, line: 414)
!646 = distinct !DISubprogram(name: "fabsf", linkageName: "_ZL5fabsff", scope: !628, file: !628, line: 607, type: !183, isLocal: true, isDefinition: true, scopeLine: 608, flags: DIFlagPrototyped, isOptimized: false, unit: !1, variables: !3)
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !648, line: 415)
!648 = !DISubprogram(name: "fdimf", linkageName: "_ZL5fdimfff", scope: !611, file: !611, line: 1616, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !650, line: 416)
!650 = !DISubprogram(name: "floorf", linkageName: "_ZL6floorff", scope: !628, file: !628, line: 597, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !652, line: 417)
!652 = !DISubprogram(name: "fmaf", linkageName: "_ZL4fmaffff", scope: !611, file: !611, line: 1568, type: !227, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !654, line: 418)
!654 = !DISubprogram(name: "fmaxf", linkageName: "_ZL5fmaxfff", scope: !628, file: !628, line: 622, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !656, line: 419)
!656 = !DISubprogram(name: "fminf", linkageName: "_ZL5fminfff", scope: !628, file: !628, line: 617, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !658, line: 420)
!658 = !DISubprogram(name: "fmodf", linkageName: "_ZL5fmodfff", scope: !611, file: !611, line: 1553, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !660, line: 421)
!660 = !DISubprogram(name: "frexpf", linkageName: "_ZL6frexpffPi", scope: !611, file: !611, line: 1543, type: !241, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !662, line: 422)
!662 = !DISubprogram(name: "hypotf", linkageName: "_ZL6hypotfff", scope: !611, file: !611, line: 1390, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !664, line: 423)
!664 = !DISubprogram(name: "ilogbf", linkageName: "_ZL6ilogbff", scope: !611, file: !611, line: 1621, type: !237, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !666, line: 424)
!666 = !DISubprogram(name: "ldexpf", linkageName: "_ZL6ldexpffi", scope: !611, file: !611, line: 1520, type: !279, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !668, line: 425)
!668 = !DISubprogram(name: "lgammaf", linkageName: "_ZL7lgammaff", scope: !611, file: !611, line: 1515, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!669 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !670, line: 426)
!670 = !DISubprogram(name: "llrintf", linkageName: "_ZL7llrintff", scope: !611, file: !611, line: 1149, type: !287, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !672, line: 427)
!672 = !DISubprogram(name: "llroundf", linkageName: "_ZL8llroundff", scope: !611, file: !611, line: 1602, type: !287, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!673 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !674, line: 428)
!674 = !DISubprogram(name: "log10f", linkageName: "_ZL6log10ff", scope: !611, file: !611, line: 1356, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!675 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !676, line: 429)
!676 = !DISubprogram(name: "log1pf", linkageName: "_ZL6log1pff", scope: !611, file: !611, line: 1365, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !678, line: 430)
!678 = !DISubprogram(name: "log2f", linkageName: "_ZL5log2ff", scope: !611, file: !611, line: 1285, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!679 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !680, line: 431)
!680 = !DISubprogram(name: "logbf", linkageName: "_ZL5logbff", scope: !611, file: !611, line: 1626, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !682, line: 432)
!682 = !DISubprogram(name: "logf", linkageName: "_ZL4logff", scope: !611, file: !611, line: 1347, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !684, line: 433)
!684 = !DISubprogram(name: "lrintf", linkageName: "_ZL6lrintff", scope: !611, file: !611, line: 1140, type: !301, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !686, line: 434)
!686 = !DISubprogram(name: "lroundf", linkageName: "_ZL7lroundff", scope: !611, file: !611, line: 1607, type: !301, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!687 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !688, line: 435)
!688 = !DISubprogram(name: "modff", linkageName: "_ZL5modfffPf", scope: !611, file: !611, line: 1548, type: !309, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !690, line: 436)
!690 = !DISubprogram(name: "nearbyintf", linkageName: "_ZL10nearbyintff", scope: !611, file: !611, line: 1154, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !692, line: 437)
!692 = !DISubprogram(name: "nextafterf", linkageName: "_ZL10nextafterfff", scope: !611, file: !611, line: 1218, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!693 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !694, line: 438)
!694 = !DISubprogram(name: "nexttowardf", scope: !368, file: !368, line: 294, type: !695, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!695 = !DISubroutineType(types: !696)
!696 = !{!5, !5, !596}
!697 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !694, line: 439)
!698 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !699, line: 440)
!699 = !DISubprogram(name: "powf", linkageName: "_ZL4powfff", scope: !611, file: !611, line: 1583, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!700 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !701, line: 441)
!701 = !DISubprogram(name: "remainderf", linkageName: "_ZL10remainderfff", scope: !611, file: !611, line: 1558, type: !195, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!702 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !703, line: 442)
!703 = !DISubprogram(name: "remquof", linkageName: "_ZL7remquofffPi", scope: !611, file: !611, line: 1563, type: !337, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!704 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !705, line: 443)
!705 = !DISubprogram(name: "rintf", linkageName: "_ZL5rintff", scope: !611, file: !611, line: 1135, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!706 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !707, line: 444)
!707 = !DISubprogram(name: "roundf", linkageName: "_ZL6roundff", scope: !611, file: !611, line: 1597, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!708 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !709, line: 445)
!709 = !DISubprogram(name: "scalblnf", linkageName: "_ZL8scalblnffl", scope: !611, file: !611, line: 1530, type: !345, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!710 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !711, line: 446)
!711 = !DISubprogram(name: "scalbnf", linkageName: "_ZL7scalbnffi", scope: !611, file: !611, line: 1525, type: !279, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!712 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !713, line: 447)
!713 = !DISubprogram(name: "sinf", linkageName: "_ZL4sinff", scope: !611, file: !611, line: 1234, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!714 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !715, line: 448)
!715 = !DISubprogram(name: "sinhf", linkageName: "_ZL5sinhff", scope: !611, file: !611, line: 1317, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!716 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !717, line: 449)
!717 = distinct !DISubprogram(name: "sqrtf", linkageName: "_ZL5sqrtff", scope: !628, file: !628, line: 907, type: !183, isLocal: true, isDefinition: true, scopeLine: 908, flags: DIFlagPrototyped, isOptimized: false, unit: !1, variables: !3)
!718 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !719, line: 450)
!719 = !DISubprogram(name: "tanf", linkageName: "_ZL4tanff", scope: !611, file: !611, line: 1276, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!720 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !721, line: 451)
!721 = !DISubprogram(name: "tanhf", linkageName: "_ZL5tanhff", scope: !611, file: !611, line: 1322, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!722 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !723, line: 452)
!723 = !DISubprogram(name: "tgammaf", linkageName: "_ZL7tgammaff", scope: !611, file: !611, line: 1592, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!724 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !175, entity: !725, line: 453)
!725 = !DISubprogram(name: "truncf", linkageName: "_ZL6truncff", scope: !628, file: !628, line: 662, type: !183, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "params_common_change", file: !9, line: 40, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "params_common_change", file: !9, line: 31, size: 128, align: 64, elements: !728, identifier: "_ZTS20params_common_change")
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "d_frame", scope: !727, file: !9, line: 37, baseType: !34, size: 64, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "frame_no", scope: !727, file: !9, line: 38, baseType: !13, size: 32, align: 32, offset: 64)
!731 = !{void ()* @_Z6kernelv, !"kernel", i32 1}
!732 = !{null, !"align", i32 8}
!733 = !{null, !"align", i32 8, !"align", i32 65544, !"align", i32 131080}
!734 = !{null, !"align", i32 16}
!735 = !{null, !"align", i32 16, !"align", i32 65552, !"align", i32 131088}
!736 = !{i32 2, !"Dwarf Version", i32 4}
!737 = !{i32 2, !"Debug Info Version", i32 3}
!738 = !{i32 4, !"nvvm-reflect-ftz", i32 0}
!739 = !{!"clang version 4.0.0 (http://llvm.org/git/clang.git 2debfe67236df81b4b386304d4aecd9fe20fc156) (http://llvm.org/git/llvm.git 9aa8644318b899329caf41dc98a12db04dee5855)"}
!740 = !{i32 1, i32 2}
!741 = !DILocalVariable(name: "x", arg: 1, scope: !717, file: !628, line: 907, type: !5)
!742 = !DIExpression()
!743 = !DILocation(line: 907, column: 52, scope: !717, inlinedAt: !744)
!744 = distinct !DILocation(line: 147, column: 43, scope: !356, inlinedAt: !745)
!745 = distinct !DILocation(line: 906, column: 42, scope: !746)
!746 = distinct !DILexicalBlock(scope: !747, file: !155, line: 899, column: 41)
!747 = distinct !DILexicalBlock(scope: !748, file: !155, line: 145, column: 35)
!748 = distinct !DILexicalBlock(scope: !154, file: !155, line: 145, column: 5)
!749 = !DILocalVariable(name: "__x", arg: 1, scope: !356, file: !357, line: 147, type: !5)
!750 = !DILocation(line: 147, column: 29, scope: !356, inlinedAt: !745)
!751 = !DILocation(line: 907, column: 52, scope: !717, inlinedAt: !752)
!752 = distinct !DILocation(line: 147, column: 43, scope: !356, inlinedAt: !753)
!753 = distinct !DILocation(line: 1030, column: 16, scope: !754)
!754 = distinct !DILexicalBlock(scope: !755, file: !155, line: 1025, column: 14)
!755 = distinct !DILexicalBlock(scope: !747, file: !155, line: 1025, column: 6)
!756 = !DILocation(line: 147, column: 29, scope: !356, inlinedAt: !753)
!757 = !DILocation(line: 907, column: 52, scope: !717, inlinedAt: !758)
!758 = distinct !DILocation(line: 147, column: 43, scope: !356, inlinedAt: !759)
!759 = distinct !DILocation(line: 1032, column: 13, scope: !754)
!760 = !DILocation(line: 147, column: 29, scope: !356, inlinedAt: !759)
!761 = !DILocalVariable(name: "f", arg: 1, scope: !646, file: !628, line: 607, type: !5)
!762 = !DILocation(line: 607, column: 52, scope: !646, inlinedAt: !763)
!763 = distinct !DILocation(line: 51, column: 42, scope: !764, inlinedAt: !765)
!764 = distinct !DISubprogram(name: "abs", linkageName: "_ZL3absf", scope: !357, file: !357, line: 51, type: !183, isLocal: true, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false, unit: !1, variables: !3)
!765 = distinct !DILocation(line: 1230, column: 29, scope: !766)
!766 = distinct !DILexicalBlock(scope: !767, file: !155, line: 1228, column: 44)
!767 = distinct !DILexicalBlock(scope: !768, file: !155, line: 1228, column: 4)
!768 = distinct !DILexicalBlock(scope: !769, file: !155, line: 1228, column: 4)
!769 = distinct !DILexicalBlock(scope: !747, file: !155, line: 1226, column: 42)
!770 = !DILocalVariable(name: "__x", arg: 1, scope: !764, file: !357, line: 51, type: !5)
!771 = !DILocation(line: 51, column: 28, scope: !764, inlinedAt: !765)
!772 = !DILocalVariable(name: "d_in", scope: !154, file: !155, line: 13, type: !34)
!773 = !DILocation(line: 13, column: 6, scope: !154)
!774 = !DILocalVariable(name: "rot_row", scope: !154, file: !155, line: 14, type: !13)
!775 = !DILocation(line: 14, column: 6, scope: !154)
!776 = !DILocalVariable(name: "rot_col", scope: !154, file: !155, line: 15, type: !13)
!777 = !DILocation(line: 15, column: 6, scope: !154)
!778 = !DILocalVariable(name: "in2_rowlow", scope: !154, file: !155, line: 16, type: !13)
!779 = !DILocation(line: 16, column: 6, scope: !154)
!780 = !DILocalVariable(name: "in2_collow", scope: !154, file: !155, line: 17, type: !13)
!781 = !DILocation(line: 17, column: 6, scope: !154)
!782 = !DILocalVariable(name: "ic", scope: !154, file: !155, line: 18, type: !13)
!783 = !DILocation(line: 18, column: 6, scope: !154)
!784 = !DILocalVariable(name: "jc", scope: !154, file: !155, line: 19, type: !13)
!785 = !DILocation(line: 19, column: 6, scope: !154)
!786 = !DILocalVariable(name: "jp1", scope: !154, file: !155, line: 20, type: !13)
!787 = !DILocation(line: 20, column: 6, scope: !154)
!788 = !DILocalVariable(name: "ja1", scope: !154, file: !155, line: 21, type: !13)
!789 = !DILocation(line: 21, column: 6, scope: !154)
!790 = !DILocalVariable(name: "ja2", scope: !154, file: !155, line: 21, type: !13)
!791 = !DILocation(line: 21, column: 11, scope: !154)
!792 = !DILocalVariable(name: "ip1", scope: !154, file: !155, line: 22, type: !13)
!793 = !DILocation(line: 22, column: 6, scope: !154)
!794 = !DILocalVariable(name: "ia1", scope: !154, file: !155, line: 23, type: !13)
!795 = !DILocation(line: 23, column: 6, scope: !154)
!796 = !DILocalVariable(name: "ia2", scope: !154, file: !155, line: 23, type: !13)
!797 = !DILocation(line: 23, column: 11, scope: !154)
!798 = !DILocalVariable(name: "ja", scope: !154, file: !155, line: 24, type: !13)
!799 = !DILocation(line: 24, column: 6, scope: !154)
!800 = !DILocalVariable(name: "jb", scope: !154, file: !155, line: 24, type: !13)
!801 = !DILocation(line: 24, column: 10, scope: !154)
!802 = !DILocalVariable(name: "ia", scope: !154, file: !155, line: 25, type: !13)
!803 = !DILocation(line: 25, column: 6, scope: !154)
!804 = !DILocalVariable(name: "ib", scope: !154, file: !155, line: 25, type: !13)
!805 = !DILocation(line: 25, column: 10, scope: !154)
!806 = !DILocalVariable(name: "s", scope: !154, file: !155, line: 26, type: !5)
!807 = !DILocation(line: 26, column: 8, scope: !154)
!808 = !DILocalVariable(name: "i", scope: !154, file: !155, line: 27, type: !13)
!809 = !DILocation(line: 27, column: 6, scope: !154)
!810 = !DILocalVariable(name: "j", scope: !154, file: !155, line: 28, type: !13)
!811 = !DILocation(line: 28, column: 6, scope: !154)
!812 = !DILocalVariable(name: "row", scope: !154, file: !155, line: 29, type: !13)
!813 = !DILocation(line: 29, column: 6, scope: !154)
!814 = !DILocalVariable(name: "col", scope: !154, file: !155, line: 30, type: !13)
!815 = !DILocation(line: 30, column: 6, scope: !154)
!816 = !DILocalVariable(name: "ori_row", scope: !154, file: !155, line: 31, type: !13)
!817 = !DILocation(line: 31, column: 6, scope: !154)
!818 = !DILocalVariable(name: "ori_col", scope: !154, file: !155, line: 32, type: !13)
!819 = !DILocation(line: 32, column: 6, scope: !154)
!820 = !DILocalVariable(name: "position", scope: !154, file: !155, line: 33, type: !13)
!821 = !DILocation(line: 33, column: 6, scope: !154)
!822 = !DILocalVariable(name: "sum", scope: !154, file: !155, line: 34, type: !5)
!823 = !DILocation(line: 34, column: 8, scope: !154)
!824 = !DILocalVariable(name: "pos_ori", scope: !154, file: !155, line: 35, type: !13)
!825 = !DILocation(line: 35, column: 6, scope: !154)
!826 = !DILocalVariable(name: "temp", scope: !154, file: !155, line: 36, type: !5)
!827 = !DILocation(line: 36, column: 8, scope: !154)
!828 = !DILocalVariable(name: "temp2", scope: !154, file: !155, line: 37, type: !5)
!829 = !DILocation(line: 37, column: 8, scope: !154)
!830 = !DILocalVariable(name: "location", scope: !154, file: !155, line: 38, type: !13)
!831 = !DILocation(line: 38, column: 6, scope: !154)
!832 = !DILocalVariable(name: "cent", scope: !154, file: !155, line: 39, type: !13)
!833 = !DILocation(line: 39, column: 6, scope: !154)
!834 = !DILocalVariable(name: "tMask_row", scope: !154, file: !155, line: 40, type: !13)
!835 = !DILocation(line: 40, column: 6, scope: !154)
!836 = !DILocalVariable(name: "tMask_col", scope: !154, file: !155, line: 41, type: !13)
!837 = !DILocation(line: 41, column: 6, scope: !154)
!838 = !DILocalVariable(name: "largest_value_current", scope: !154, file: !155, line: 42, type: !5)
!839 = !DILocation(line: 42, column: 8, scope: !154)
!840 = !DILocalVariable(name: "largest_value", scope: !154, file: !155, line: 43, type: !5)
!841 = !DILocation(line: 43, column: 8, scope: !154)
!842 = !DILocalVariable(name: "largest_coordinate_current", scope: !154, file: !155, line: 44, type: !13)
!843 = !DILocation(line: 44, column: 6, scope: !154)
!844 = !DILocalVariable(name: "largest_coordinate", scope: !154, file: !155, line: 45, type: !13)
!845 = !DILocation(line: 45, column: 6, scope: !154)
!846 = !DILocalVariable(name: "fin_max_val", scope: !154, file: !155, line: 46, type: !5)
!847 = !DILocation(line: 46, column: 8, scope: !154)
!848 = !DILocalVariable(name: "fin_max_coo", scope: !154, file: !155, line: 47, type: !13)
!849 = !DILocation(line: 47, column: 6, scope: !154)
!850 = !DILocalVariable(name: "largest_row", scope: !154, file: !155, line: 48, type: !13)
!851 = !DILocation(line: 48, column: 6, scope: !154)
!852 = !DILocalVariable(name: "largest_col", scope: !154, file: !155, line: 49, type: !13)
!853 = !DILocation(line: 49, column: 6, scope: !154)
!854 = !DILocalVariable(name: "offset_row", scope: !154, file: !155, line: 50, type: !13)
!855 = !DILocation(line: 50, column: 6, scope: !154)
!856 = !DILocalVariable(name: "offset_col", scope: !154, file: !155, line: 51, type: !13)
!857 = !DILocation(line: 51, column: 6, scope: !154)
!858 = !DILocalVariable(name: "mean", scope: !154, file: !155, line: 56, type: !5)
!859 = !DILocation(line: 56, column: 8, scope: !154)
!860 = !DILocalVariable(name: "mean_sqr", scope: !154, file: !155, line: 57, type: !5)
!861 = !DILocation(line: 57, column: 8, scope: !154)
