; ModuleID = './util/device/device.cu'
source_filename = "./util/device/device.cu"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cudaDeviceProp = type { [256 x i8], i64, i64, i32, i32, i64, i32, [3 x i32], [3 x i32], i32, i64, i32, i32, i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], [2 x i32], [3 x i32], [2 x i32], [3 x i32], [3 x i32], i32, [2 x i32], [3 x i32], [2 x i32], i32, [2 x i32], [3 x i32], [2 x i32], [3 x i32], i32, [2 x i32], i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [21 x i8] c"Cuda error: %s: %s.\0A\00", align 1

; Function Attrs: uwtable
define void @_Z9setdevicev() #0 !dbg !648 {
entry:
  %num_devices = alloca i32, align 4
  %device = alloca i32, align 4
  %max_multiprocessors = alloca i32, align 4
  %max_device = alloca i32, align 4
  %properties = alloca %struct.cudaDeviceProp, align 8
  call void @llvm.dbg.declare(metadata i32* %num_devices, metadata !650, metadata !651), !dbg !652

!294 = !DISubroutineType(types: !295)
!295 = !{!233, !233, !233}
!296 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !297, line: 180)
!297 = !DISubprogram(name: "ceil", scope: !285, file: !285, line: 178, type: !286, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!298 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !299, line: 199)
!299 = !DISubprogram(name: "cos", scope: !285, file: !285, line: 63, type: !286, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!300 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !301, line: 218)
!301 = !DISubprogram(name: "cosh", scope: !285, file: !285, line: 72, type: !286, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!302 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !303, line: 237)
!303 = !DISubprogram(name: "exp", scope: !285, file: !285, line: 100, type: !286, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!304 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !305, line: 256)
!305 = !DISubprogram(name: "fabs", scope: !285, file: !285, line: 181, type: !286, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!306 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !307, line: 275)
!307 = !DISubprogram(name: "floor", scope: !285, file: !285, line: 184, type: !286, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!308 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !309, line: 294)
!309 = !DISubprogram(name: "fmod", scope: !285, file: !285, line: 187, type: !294, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!310 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !311, line: 315)
!311 = !DISubprogram(name: "frexp", scope: !285, file: !285, line: 103, type: !312, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!312 = !DISubroutineType(types: !313)
!313 = !{!233, !233, !159}
!314 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !315, line: 334)
!315 = !DISubprogram(name: "ldexp", scope: !285, file: !285, line: 106, type: !316, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!316 = !DISubroutineType(types: !317)
!317 = !{!233, !233, !154}
!318 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !319, line: 353)
!319 = !DISubprogram(name: "log", scope: !285, file: !285, line: 109, type: !286, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !321, line: 372)
!321 = !DISubprogram(name: "log10", scope: !285, file: !285, line: 112, type: !286, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!322 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !323, line: 391)
!323 = !DISubprogram(name: "modf", scope: !285, file: !285, line: 115, type: !324, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!324 = !DISubroutineType(types: !325)
!325 = !{!233, !233, !326}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!327 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !328, line: 403)
!328 = !DISubprogram(name: "pow", scope: !285, file: !285, line: 153, type: !294, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!329 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !330, line: 440)
!330 = !DISubprogram(name: "sin", scope: !285, file: !285, line: 65, type: !286, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!331 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !332, line: 459)
!332 = !DISubprogram(name: "sinh", scope: !285, file: !285, line: 74, type: !286, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !334, line: 478)
!334 = !DISubprogram(name: "sqrt", scope: !285, file: !285, line: 156, type: !286, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !336, line: 497)
!336 = !DISubprogram(name: "tan", scope: !285, file: !285, line: 67, type: !286, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !338, line: 516)
!338 = !DISubprogram(name: "tanh", scope: !285, file: !285, line: 76, type: !286, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !340, line: 118)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !341, line: 101, baseType: !342)
!341 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/lavaMD")
!342 = !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 97, size: 64, align: 32, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !344, line: 119)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !341, line: 109, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 105, size: 128, align: 64, elements: !346, identifier: "_ZTS6ldiv_t")
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !345, file: !341, line: 107, baseType: !193, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !345, file: !341, line: 108, baseType: !193, size: 64, align: 64, offset: 64)
!349 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !350, line: 121)
!350 = !DISubprogram(name: "abort", scope: !341, file: !341, line: 515, type: !351, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!351 = !DISubroutineType(types: !352)
!352 = !{null}
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !354, line: 122)
!354 = !DISubprogram(name: "abs", scope: !341, file: !341, line: 774, type: !355, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!355 = !DISubroutineType(types: !356)
!356 = !{!154, !154}
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !358, line: 123)
!358 = !DISubprogram(name: "atexit", scope: !341, file: !341, line: 519, type: !359, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!359 = !DISubroutineType(types: !360)
!360 = !{!154, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!362 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !363, line: 129)
!363 = !DISubprogram(name: "atof", scope: !341, file: !341, line: 144, type: !231, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!364 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !365, line: 130)
!365 = !DISubprogram(name: "atoi", scope: !341, file: !341, line: 147, type: !366, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!366 = !DISubroutineType(types: !367)
!367 = !{!154, !234}
!368 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !369, line: 131)
!369 = !DISubprogram(name: "atol", scope: !341, file: !341, line: 150, type: !370, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!370 = !DISubroutineType(types: !371)
!371 = !{!193, !234}
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !373, line: 132)
!373 = !DISubprogram(name: "bsearch", scope: !341, file: !341, line: 754, type: !374, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!374 = !DISubroutineType(types: !375)
!375 = !{!376, !377, !377, !379, !379, !382}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !380, line: 62, baseType: !381)
!380 = !DIFile(filename: "/usr/local/bin/../lib/clang/4.0.0/include/stddef.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/lavaMD")
!381 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !341, line: 741, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!154, !377, !377}
!386 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !387, line: 133)
!387 = !DISubprogram(name: "calloc", scope: !341, file: !341, line: 468, type: !388, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!388 = !DISubroutineType(types: !389)
!389 = !{!376, !379, !379}
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !391, line: 134)
!391 = !DISubprogram(name: "div", scope: !341, file: !341, line: 788, type: !392, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!392 = !DISubroutineType(types: !393)
!393 = !{!340, !154, !154}
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !395, line: 135)
!395 = !DISubprogram(name: "exit", scope: !341, file: !341, line: 543, type: !396, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !154}
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !399, line: 136)
!399 = !DISubprogram(name: "free", scope: !341, file: !341, line: 483, type: !400, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !376}
!402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !403, line: 137)
!403 = !DISubprogram(name: "getenv", scope: !341, file: !341, line: 564, type: !404, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!404 = !DISubroutineType(types: !405)
!405 = !{!406, !234}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !408, line: 138)
!408 = !DISubprogram(name: "labs", scope: !341, file: !341, line: 775, type: !191, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !410, line: 139)
!410 = !DISubprogram(name: "ldiv", scope: !341, file: !341, line: 790, type: !411, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!411 = !DISubroutineType(types: !412)
!412 = !{!344, !193, !193}
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !414, line: 140)
!414 = !DISubprogram(name: "malloc", scope: !341, file: !341, line: 466, type: !415, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!415 = !DISubroutineType(types: !416)
!416 = !{!376, !379}
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !418, line: 142)
!418 = !DISubprogram(name: "mblen", scope: !341, file: !341, line: 862, type: !419, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!419 = !DISubroutineType(types: !420)
!420 = !{!154, !234, !379}
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !422, line: 143)
!422 = !DISubprogram(name: "mbstowcs", scope: !341, file: !341, line: 873, type: !423, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!423 = !DISubroutineType(types: !424)
!424 = !{!379, !425, !428, !379}
!425 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DIBasicType(name: "wchar_t", size: 32, align: 32, encoding: DW_ATE_signed)
!428 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !234)
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !430, line: 144)
!430 = !DISubprogram(name: "mbtowc", scope: !341, file: !341, line: 865, type: !431, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!431 = !DISubroutineType(types: !432)
!432 = !{!154, !425, !428, !379}
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !434, line: 146)
!434 = !DISubprogram(name: "qsort", scope: !341, file: !341, line: 764, type: !435, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !376, !379, !379, !382}
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !438, line: 152)
!438 = !DISubprogram(name: "rand", scope: !341, file: !341, line: 374, type: !439, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!439 = !DISubroutineType(types: !440)
!440 = !{!154}
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !442, line: 153)
!442 = !DISubprogram(name: "realloc", scope: !341, file: !341, line: 480, type: !443, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!443 = !DISubroutineType(types: !444)
!444 = !{!376, !376, !379}
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !446, line: 154)
!446 = !DISubprogram(name: "srand", scope: !341, file: !341, line: 376, type: !447, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !449}
!449 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !451, line: 155)
!451 = !DISubprogram(name: "strtod", scope: !341, file: !341, line: 164, type: !452, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!452 = !DISubroutineType(types: !453)
!453 = !{!233, !428, !454}
!454 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !457, line: 156)
!457 = !DISubprogram(name: "strtol", scope: !341, file: !341, line: 183, type: !458, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!458 = !DISubroutineType(types: !459)
!459 = !{!193, !428, !454, !154}
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !461, line: 157)
!461 = !DISubprogram(name: "strtoul", scope: !341, file: !341, line: 187, type: !462, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!462 = !DISubroutineType(types: !463)
!463 = !{!381, !428, !454, !154}
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !465, line: 158)
!465 = !DISubprogram(name: "system", scope: !341, file: !341, line: 716, type: !366, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !467, line: 160)
!467 = !DISubprogram(name: "wcstombs", scope: !341, file: !341, line: 876, type: !468, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!468 = !DISubroutineType(types: !469)
!469 = !{!379, !470, !471, !379}
!470 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !406)
!471 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !475, line: 161)
!475 = !DISubprogram(name: "wctomb", scope: !341, file: !341, line: 869, type: !476, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!476 = !DISubroutineType(types: !477)
!477 = !{!154, !406, !427}
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !479, entity: !481, line: 214)
!479 = !DINamespace(name: "__gnu_cxx", scope: null, file: !480, line: 220)
!480 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/x86_64-linux-gnu/c++/5.4.0/bits/c++config.h", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/lavaMD")
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !341, line: 121, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 117, size: 128, align: 64, elements: !483, identifier: "_ZTS7lldiv_t")
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !482, file: !341, line: 119, baseType: !94, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !482, file: !341, line: 120, baseType: !94, size: 64, align: 64, offset: 64)
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !479, entity: !487, line: 220)
!487 = !DISubprogram(name: "_Exit", scope: !341, file: !341, line: 557, type: !396, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !479, entity: !489, line: 224)
!489 = !DISubprogram(name: "llabs", scope: !341, file: !341, line: 779, type: !92, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !479, entity: !491, line: 230)
!491 = !DISubprogram(name: "lldiv", scope: !341, file: !341, line: 796, type: !492, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!492 = !DISubroutineType(types: !493)
!493 = !{!481, !94, !94}
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !479, entity: !495, line: 241)
!495 = !DISubprogram(name: "atoll", scope: !341, file: !341, line: 157, type: !496, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!496 = !DISubroutineType(types: !497)
!497 = !{!94, !234}
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !479, entity: !499, line: 242)
!499 = !DISubprogram(name: "strtoll", scope: !341, file: !341, line: 209, type: !500, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!500 = !DISubroutineType(types: !501)
!501 = !{!94, !428, !454, !154}
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !479, entity: !503, line: 243)
!503 = !DISubprogram(name: "strtoull", scope: !341, file: !341, line: 214, type: !504, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!504 = !DISubroutineType(types: !505)
!505 = !{!506, !428, !454, !154}
!506 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !479, entity: !508, line: 245)
!508 = !DISubprogram(name: "strtof", scope: !341, file: !341, line: 172, type: !509, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!509 = !DISubroutineType(types: !510)
!510 = !{!99, !428, !454}
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !479, entity: !512, line: 246)
!512 = !DISubprogram(name: "strtold", scope: !341, file: !341, line: 175, type: !513, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!513 = !DISubroutineType(types: !514)
!514 = !{!515, !428, !454}
!515 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !481, line: 254)
!517 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !487, line: 256)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !489, line: 258)
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !520, line: 259)
!520 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !479, file: !521, line: 227, type: !492, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!521 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5.4.0/../../../../include/c++/5.4.0/cstdlib", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/lavaMD")
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !491, line: 260)
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !495, line: 262)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !508, line: 263)
!525 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !499, line: 264)
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !503, line: 265)
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !512, line: 266)
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !529, line: 397)
!529 = !DISubprogram(name: "acosf", linkageName: "_ZL5acosff", scope: !530, file: !530, line: 1342, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!530 = !DIFile(filename: "/usr/local/cuda/include/math_functions.hpp", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/lavaMD")
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !532, line: 398)
!532 = !DISubprogram(name: "acoshf", linkageName: "_ZL6acoshff", scope: !530, file: !530, line: 1370, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !534, line: 399)
!534 = !DISubprogram(name: "asinf", linkageName: "_ZL5asinff", scope: !530, file: !530, line: 1337, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !536, line: 400)
!536 = !DISubprogram(name: "asinhf", linkageName: "_ZL6asinhff", scope: !530, file: !530, line: 1375, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !538, line: 401)
!538 = !DISubprogram(name: "atan2f", linkageName: "_ZL6atan2fff", scope: !530, file: !530, line: 1327, type: !110, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !540, line: 402)
!540 = !DISubprogram(name: "atanf", linkageName: "_ZL5atanff", scope: !530, file: !530, line: 1332, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !542, line: 403)
!542 = !DISubprogram(name: "atanhf", linkageName: "_ZL6atanhff", scope: !530, file: !530, line: 1380, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !544, line: 404)
!544 = !DISubprogram(name: "cbrtf", linkageName: "_ZL5cbrtff", scope: !530, file: !530, line: 1430, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !546, line: 405)
!546 = !DISubprogram(name: "ceilf", linkageName: "_ZL5ceilff", scope: !547, file: !547, line: 667, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!547 = !DIFile(filename: "/usr/local/cuda/include/device_functions.hpp", directory: "/home/taylor/git/coalescingsa-llvm/test/rodinia_3.1/cuda/lavaMD")
!548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !549, line: 406)
!549 = !DISubprogram(name: "copysignf", linkageName: "_ZL9copysignfff", scope: !530, file: !530, line: 1189, type: !110, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !551, line: 407)
!551 = !DISubprogram(name: "cosf", linkageName: "_ZL4cosff", scope: !530, file: !530, line: 1243, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !553, line: 408)
!553 = !DISubprogram(name: "coshf", linkageName: "_ZL5coshff", scope: !530, file: !530, line: 1312, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !555, line: 409)
!555 = !DISubprogram(name: "erfcf", linkageName: "_ZL5erfcff", scope: !530, file: !530, line: 1490, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !557, line: 410)
!557 = !DISubprogram(name: "erff", linkageName: "_ZL4erfff", scope: !530, file: !530, line: 1480, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !559, line: 411)
!559 = !DISubprogram(name: "exp2f", linkageName: "_ZL5exp2ff", scope: !547, file: !547, line: 657, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !561, line: 412)
!561 = !DISubprogram(name: "expf", linkageName: "_ZL4expff", scope: !530, file: !530, line: 1294, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !563, line: 413)
!563 = !DISubprogram(name: "expm1f", linkageName: "_ZL6expm1ff", scope: !530, file: !530, line: 1385, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !565, line: 414)
!565 = !DISubprogram(name: "fabsf", linkageName: "_ZL5fabsff", scope: !547, file: !547, line: 607, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !567, line: 415)
!567 = !DISubprogram(name: "fdimf", linkageName: "_ZL5fdimfff", scope: !530, file: !530, line: 1616, type: !110, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !569, line: 416)
!569 = !DISubprogram(name: "floorf", linkageName: "_ZL6floorff", scope: !547, file: !547, line: 597, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !571, line: 417)
!571 = !DISubprogram(name: "fmaf", linkageName: "_ZL4fmaffff", scope: !530, file: !530, line: 1568, type: !142, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !573, line: 418)
!573 = !DISubprogram(name: "fmaxf", linkageName: "_ZL5fmaxfff", scope: !547, file: !547, line: 622, type: !110, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !575, line: 419)
!575 = !DISubprogram(name: "fminf", linkageName: "_ZL5fminfff", scope: !547, file: !547, line: 617, type: !110, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !577, line: 420)
!577 = !DISubprogram(name: "fmodf", linkageName: "_ZL5fmodfff", scope: !530, file: !530, line: 1553, type: !110, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !579, line: 421)
!579 = !DISubprogram(name: "frexpf", linkageName: "_ZL6frexpffPi", scope: !530, file: !530, line: 1543, type: !157, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !581, line: 422)
!581 = !DISubprogram(name: "hypotf", linkageName: "_ZL6hypotfff", scope: !530, file: !530, line: 1390, type: !110, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !583, line: 423)
!583 = !DISubprogram(name: "ilogbf", linkageName: "_ZL6ilogbff", scope: !530, file: !530, line: 1621, type: !152, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !585, line: 424)
!585 = !DISubprogram(name: "ldexpf", linkageName: "_ZL6ldexpffi", scope: !530, file: !530, line: 1520, type: !196, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!586 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !587, line: 425)
!587 = !DISubprogram(name: "lgammaf", linkageName: "_ZL7lgammaff", scope: !530, file: !530, line: 1515, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !589, line: 426)
!589 = !DISubprogram(name: "llrintf", linkageName: "_ZL7llrintff", scope: !530, file: !530, line: 1149, type: !204, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !591, line: 427)
!591 = !DISubprogram(name: "llroundf", linkageName: "_ZL8llroundff", scope: !530, file: !530, line: 1602, type: !204, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !593, line: 428)
!593 = !DISubprogram(name: "log10f", linkageName: "_ZL6log10ff", scope: !530, file: !530, line: 1356, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!594 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !595, line: 429)
!595 = !DISubprogram(name: "log1pf", linkageName: "_ZL6log1pff", scope: !530, file: !530, line: 1365, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !597, line: 430)
!597 = !DISubprogram(name: "log2f", linkageName: "_ZL5log2ff", scope: !530, file: !530, line: 1285, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!598 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !599, line: 431)
!599 = !DISubprogram(name: "logbf", linkageName: "_ZL5logbff", scope: !530, file: !530, line: 1626, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !601, line: 432)
!601 = !DISubprogram(name: "logf", linkageName: "_ZL4logff", scope: !530, file: !530, line: 1347, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!602 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !603, line: 433)
!603 = !DISubprogram(name: "lrintf", linkageName: "_ZL6lrintff", scope: !530, file: !530, line: 1140, type: !218, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!604 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !605, line: 434)
!605 = !DISubprogram(name: "lroundf", linkageName: "_ZL7lroundff", scope: !530, file: !530, line: 1607, type: !218, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!606 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !607, line: 435)
!607 = !DISubprogram(name: "modff", linkageName: "_ZL5modfffPf", scope: !530, file: !530, line: 1548, type: !226, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!608 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !609, line: 436)
!609 = !DISubprogram(name: "nearbyintf", linkageName: "_ZL10nearbyintff", scope: !530, file: !530, line: 1154, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !611, line: 437)
!611 = !DISubprogram(name: "nextafterf", linkageName: "_ZL10nextafterfff", scope: !530, file: !530, line: 1218, type: !110, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !613, line: 438)
!613 = !DISubprogram(name: "nexttowardf", scope: !285, file: !285, line: 294, type: !614, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!614 = !DISubroutineType(types: !615)
!615 = !{!99, !99, !515}
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !613, line: 439)
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !618, line: 440)
!618 = !DISubprogram(name: "powf", linkageName: "_ZL4powfff", scope: !530, file: !530, line: 1583, type: !110, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !620, line: 441)
!620 = !DISubprogram(name: "remainderf", linkageName: "_ZL10remainderfff", scope: !530, file: !530, line: 1558, type: !110, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !622, line: 442)
!622 = !DISubprogram(name: "remquof", linkageName: "_ZL7remquofffPi", scope: !530, file: !530, line: 1563, type: !255, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !624, line: 443)
!624 = !DISubprogram(name: "rintf", linkageName: "_ZL5rintff", scope: !530, file: !530, line: 1135, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !626, line: 444)
!626 = !DISubprogram(name: "roundf", linkageName: "_ZL6roundff", scope: !530, file: !530, line: 1597, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !628, line: 445)
!628 = !DISubprogram(name: "scalblnf", linkageName: "_ZL8scalblnffl", scope: !530, file: !530, line: 1530, type: !263, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !630, line: 446)
!630 = !DISubprogram(name: "scalbnf", linkageName: "_ZL7scalbnffi", scope: !530, file: !530, line: 1525, type: !196, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !632, line: 447)
!632 = !DISubprogram(name: "sinf", linkageName: "_ZL4sinff", scope: !530, file: !530, line: 1234, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !634, line: 448)
!634 = !DISubprogram(name: "sinhf", linkageName: "_ZL5sinhff", scope: !530, file: !530, line: 1317, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !636, line: 449)
!636 = !DISubprogram(name: "sqrtf", linkageName: "_ZL5sqrtff", scope: !547, file: !547, line: 907, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !638, line: 450)
!638 = !DISubprogram(name: "tanf", linkageName: "_ZL4tanff", scope: !530, file: !530, line: 1276, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !640, line: 451)
!640 = !DISubprogram(name: "tanhf", linkageName: "_ZL5tanhff", scope: !530, file: !530, line: 1322, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !642, line: 452)
!642 = !DISubprogram(name: "tgammaf", linkageName: "_ZL7tgammaff", scope: !530, file: !530, line: 1592, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !89, entity: !644, line: 453)
!644 = !DISubprogram(name: "truncf", linkageName: "_ZL6truncff", scope: !547, file: !547, line: 662, type: !97, isLocal: true, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!645 = !{i32 2, !"Dwarf Version", i32 4}
!646 = !{i32 2, !"Debug Info Version", i32 3}
!647 = !{!"clang version 4.0.0 (http://llvm.org/git/clang.git 2debfe67236df81b4b386304d4aecd9fe20fc156) (http://llvm.org/git/llvm.git 9aa8644318b899329caf41dc98a12db04dee5855)"}
!648 = distinct !DISubprogram(name: "setdevice", linkageName: "_Z9setdevicev", scope: !1, file: !1, line: 19, type: !351, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !649)
!649 = !{}
!650 = !DILocalVariable(name: "num_devices", scope: !648, file: !1, line: 22, type: !154)
!651 = !DIExpression()
!652 = !DILocation(line: 22, column: 6, scope: !648)
!653 = !DILocalVariable(name: "device", scope: !648, file: !1, line: 23, type: !154)
!654 = !DILocation(line: 23, column: 6, scope: !648)
!655 = !DILocation(line: 26, column: 2, scope: !648)
!656 = !DILocation(line: 27, column: 6, scope: !657)
!657 = distinct !DILexicalBlock(scope: !648, file: !1, line: 27, column: 6)
!658 = !DILocation(line: 27, column: 18, scope: !657)
!659 = !DILocation(line: 27, column: 6, scope: !648)
!660 = !DILocalVariable(name: "max_multiprocessors", scope: !661, file: !1, line: 30, type: !154)
!661 = distinct !DILexicalBlock(scope: !657, file: !1, line: 27, column: 23)
!662 = !DILocation(line: 30, column: 7, scope: !661)
!663 = !DILocalVariable(name: "max_device", scope: !661, file: !1, line: 31, type: !154)
!664 = !DILocation(line: 31, column: 7, scope: !661)
!665 = !DILocalVariable(name: "properties", scope: !661, file: !1, line: 32, type: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cudaDeviceProp", file: !4, line: 1307, size: 5184, align: 64, elements: !667, identifier: "_ZTS14cudaDeviceProp")
!667 = !{!668, !672, !673, !674, !675, !676, !677, !678, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !666, file: !4, line: 1309, baseType: !669, size: 2048, align: 8)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 2048, align: 8, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "totalGlobalMem", scope: !666, file: !4, line: 1310, baseType: !379, size: 64, align: 64, offset: 2048)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "sharedMemPerBlock", scope: !666, file: !4, line: 1311, baseType: !379, size: 64, align: 64, offset: 2112)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "regsPerBlock", scope: !666, file: !4, line: 1312, baseType: !154, size: 32, align: 32, offset: 2176)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "warpSize", scope: !666, file: !4, line: 1313, baseType: !154, size: 32, align: 32, offset: 2208)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "memPitch", scope: !666, file: !4, line: 1314, baseType: !379, size: 64, align: 64, offset: 2240)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "maxThreadsPerBlock", scope: !666, file: !4, line: 1315, baseType: !154, size: 32, align: 32, offset: 2304)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "maxThreadsDim", scope: !666, file: !4, line: 1316, baseType: !679, size: 96, align: 32, offset: 2336)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 96, align: 32, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 3)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "maxGridSize", scope: !666, file: !4, line: 1317, baseType: !679, size: 96, align: 32, offset: 2432)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "clockRate", scope: !666, file: !4, line: 1318, baseType: !154, size: 32, align: 32, offset: 2528)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "totalConstMem", scope: !666, file: !4, line: 1319, baseType: !379, size: 64, align: 64, offset: 2560)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !666, file: !4, line: 1320, baseType: !154, size: 32, align: 32, offset: 2624)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !666, file: !4, line: 1321, baseType: !154, size: 32, align: 32, offset: 2656)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "textureAlignment", scope: !666, file: !4, line: 1322, baseType: !379, size: 64, align: 64, offset: 2688)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "texturePitchAlignment", scope: !666, file: !4, line: 1323, baseType: !379, size: 64, align: 64, offset: 2752)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "deviceOverlap", scope: !666, file: !4, line: 1324, baseType: !154, size: 32, align: 32, offset: 2816)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "multiProcessorCount", scope: !666, file: !4, line: 1325, baseType: !154, size: 32, align: 32, offset: 2848)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "kernelExecTimeoutEnabled", scope: !666, file: !4, line: 1326, baseType: !154, size: 32, align: 32, offset: 2880)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "integrated", scope: !666, file: !4, line: 1327, baseType: !154, size: 32, align: 32, offset: 2912)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "canMapHostMemory", scope: !666, file: !4, line: 1328, baseType: !154, size: 32, align: 32, offset: 2944)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "computeMode", scope: !666, file: !4, line: 1329, baseType: !154, size: 32, align: 32, offset: 2976)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1D", scope: !666, file: !4, line: 1330, baseType: !154, size: 32, align: 32, offset: 3008)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1DMipmap", scope: !666, file: !4, line: 1331, baseType: !154, size: 32, align: 32, offset: 3040)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1DLinear", scope: !666, file: !4, line: 1332, baseType: !154, size: 32, align: 32, offset: 3072)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2D", scope: !666, file: !4, line: 1333, baseType: !699, size: 64, align: 32, offset: 3104)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 64, align: 32, elements: !700)
!700 = !{!701}
!701 = !DISubrange(count: 2)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DMipmap", scope: !666, file: !4, line: 1334, baseType: !699, size: 64, align: 32, offset: 3168)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DLinear", scope: !666, file: !4, line: 1335, baseType: !679, size: 96, align: 32, offset: 3232)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DGather", scope: !666, file: !4, line: 1336, baseType: !699, size: 64, align: 32, offset: 3328)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture3D", scope: !666, file: !4, line: 1337, baseType: !679, size: 96, align: 32, offset: 3392)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture3DAlt", scope: !666, file: !4, line: 1338, baseType: !679, size: 96, align: 32, offset: 3488)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "maxTextureCubemap", scope: !666, file: !4, line: 1339, baseType: !154, size: 32, align: 32, offset: 3584)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture1DLayered", scope: !666, file: !4, line: 1340, baseType: !699, size: 64, align: 32, offset: 3616)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "maxTexture2DLayered", scope: !666, file: !4, line: 1341, baseType: !679, size: 96, align: 32, offset: 3680)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "maxTextureCubemapLayered", scope: !666, file: !4, line: 1342, baseType: !699, size: 64, align: 32, offset: 3776)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface1D", scope: !666, file: !4, line: 1343, baseType: !154, size: 32, align: 32, offset: 3840)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface2D", scope: !666, file: !4, line: 1344, baseType: !699, size: 64, align: 32, offset: 3872)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface3D", scope: !666, file: !4, line: 1345, baseType: !679, size: 96, align: 32, offset: 3936)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface1DLayered", scope: !666, file: !4, line: 1346, baseType: !699, size: 64, align: 32, offset: 4032)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurface2DLayered", scope: !666, file: !4, line: 1347, baseType: !679, size: 96, align: 32, offset: 4096)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurfaceCubemap", scope: !666, file: !4, line: 1348, baseType: !154, size: 32, align: 32, offset: 4192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "maxSurfaceCubemapLayered", scope: !666, file: !4, line: 1349, baseType: !699, size: 64, align: 32, offset: 4224)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "surfaceAlignment", scope: !666, file: !4, line: 1350, baseType: !379, size: 64, align: 64, offset: 4288)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "concurrentKernels", scope: !666, file: !4, line: 1351, baseType: !154, size: 32, align: 32, offset: 4352)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ECCEnabled", scope: !666, file: !4, line: 1352, baseType: !154, size: 32, align: 32, offset: 4384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "pciBusID", scope: !666, file: !4, line: 1353, baseType: !154, size: 32, align: 32, offset: 4416)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pciDeviceID", scope: !666, file: !4, line: 1354, baseType: !154, size: 32, align: 32, offset: 4448)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pciDomainID", scope: !666, file: !4, line: 1355, baseType: !154, size: 32, align: 32, offset: 4480)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "tccDriver", scope: !666, file: !4, line: 1356, baseType: !154, size: 32, align: 32, offset: 4512)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "asyncEngineCount", scope: !666, file: !4, line: 1357, baseType: !154, size: 32, align: 32, offset: 4544)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "unifiedAddressing", scope: !666, file: !4, line: 1358, baseType: !154, size: 32, align: 32, offset: 4576)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "memoryClockRate", scope: !666, file: !4, line: 1359, baseType: !154, size: 32, align: 32, offset: 4608)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "memoryBusWidth", scope: !666, file: !4, line: 1360, baseType: !154, size: 32, align: 32, offset: 4640)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "l2CacheSize", scope: !666, file: !4, line: 1361, baseType: !154, size: 32, align: 32, offset: 4672)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "maxThreadsPerMultiProcessor", scope: !666, file: !4, line: 1362, baseType: !154, size: 32, align: 32, offset: 4704)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "streamPrioritiesSupported", scope: !666, file: !4, line: 1363, baseType: !154, size: 32, align: 32, offset: 4736)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "globalL1CacheSupported", scope: !666, file: !4, line: 1364, baseType: !154, size: 32, align: 32, offset: 4768)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "localL1CacheSupported", scope: !666, file: !4, line: 1365, baseType: !154, size: 32, align: 32, offset: 4800)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "sharedMemPerMultiprocessor", scope: !666, file: !4, line: 1366, baseType: !379, size: 64, align: 64, offset: 4864)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "regsPerMultiprocessor", scope: !666, file: !4, line: 1367, baseType: !154, size: 32, align: 32, offset: 4928)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "managedMemory", scope: !666, file: !4, line: 1368, baseType: !154, size: 32, align: 32, offset: 4960)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "isMultiGpuBoard", scope: !666, file: !4, line: 1369, baseType: !154, size: 32, align: 32, offset: 4992)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "multiGpuBoardGroupID", scope: !666, file: !4, line: 1370, baseType: !154, size: 32, align: 32, offset: 5024)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "hostNativeAtomicSupported", scope: !666, file: !4, line: 1371, baseType: !154, size: 32, align: 32, offset: 5056)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "singleToDoublePrecisionPerfRatio", scope: !666, file: !4, line: 1372, baseType: !154, size: 32, align: 32, offset: 5088)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "pageableMemoryAccess", scope: !666, file: !4, line: 1373, baseType: !154, size: 32, align: 32, offset: 5120)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "concurrentManagedAccess", scope: !666, file: !4, line: 1374, baseType: !154, size: 32, align: 32, offset: 5152)
!743 = !DILocation(line: 32, column: 18, scope: !661)
!744 = !DILocation(line: 35, column: 23, scope: !661)
!745 = !DILocation(line: 36, column: 14, scope: !661)
!746 = !DILocation(line: 38, column: 15, scope: !747)
!747 = distinct !DILexicalBlock(scope: !661, file: !1, line: 38, column: 3)
!748 = !DILocation(line: 38, column: 8, scope: !747)
!749 = !DILocation(line: 38, column: 20, scope: !750)
!750 = !DILexicalBlockFile(scope: !751, file: !1, discriminator: 1)
!751 = distinct !DILexicalBlock(scope: !747, file: !1, line: 38, column: 3)
!752 = !DILocation(line: 38, column: 29, scope: !750)
!753 = !DILocation(line: 38, column: 27, scope: !750)
!754 = !DILocation(line: 38, column: 3, scope: !750)
!755 = !DILocation(line: 39, column: 41, scope: !756)
!756 = distinct !DILexicalBlock(scope: !751, file: !1, line: 38, column: 52)
!757 = !DILocation(line: 39, column: 4, scope: !756)
!758 = !DILocation(line: 40, column: 8, scope: !759)
!759 = distinct !DILexicalBlock(scope: !756, file: !1, line: 40, column: 8)
!760 = !DILocation(line: 40, column: 41, scope: !759)
!761 = !DILocation(line: 40, column: 28, scope: !759)
!762 = !DILocation(line: 40, column: 8, scope: !756)
!763 = !DILocation(line: 41, column: 38, scope: !764)
!764 = distinct !DILexicalBlock(scope: !759, file: !1, line: 40, column: 62)
!765 = !DILocation(line: 41, column: 25, scope: !764)
!766 = !DILocation(line: 42, column: 18, scope: !764)
!767 = !DILocation(line: 42, column: 16, scope: !764)
!768 = !DILocation(line: 43, column: 4, scope: !764)
!769 = !DILocation(line: 44, column: 3, scope: !756)
!770 = !DILocation(line: 38, column: 48, scope: !771)
!771 = !DILexicalBlockFile(scope: !751, file: !1, discriminator: 2)
!772 = !DILocation(line: 38, column: 3, scope: !771)
!773 = distinct !{!773, !774}
!774 = !DILocation(line: 38, column: 3, scope: !661)
!775 = !DILocation(line: 45, column: 17, scope: !661)
!776 = !DILocation(line: 45, column: 3, scope: !661)
!777 = !DILocation(line: 46, column: 2, scope: !661)
!778 = !DILocation(line: 48, column: 1, scope: !648)
!779 = distinct !DISubprogram(name: "checkCUDAError", linkageName: "_Z14checkCUDAErrorPKc", scope: !1, file: !1, line: 54, type: !780, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !649)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !234}
!782 = !DILocalVariable(name: "msg", arg: 1, scope: !779, file: !1, line: 54, type: !234)
!783 = !DILocation(line: 54, column: 33, scope: !779)
!784 = !DILocalVariable(name: "err", scope: !779, file: !1, line: 56, type: !785)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "cudaError_t", file: !4, line: 1477, baseType: !3)
!786 = !DILocation(line: 56, column: 14, scope: !779)
!787 = !DILocation(line: 56, column: 20, scope: !779)
!788 = !DILocation(line: 57, column: 21, scope: !789)
!789 = distinct !DILexicalBlock(scope: !779, file: !1, line: 57, column: 6)
!790 = !DILocation(line: 57, column: 18, scope: !789)
!791 = !DILocation(line: 57, column: 6, scope: !779)
!792 = !DILocation(line: 59, column: 35, scope: !793)
!793 = distinct !DILexicalBlock(scope: !789, file: !1, line: 57, column: 26)
!794 = !DILocation(line: 59, column: 60, scope: !793)
!795 = !DILocation(line: 59, column: 40, scope: !793)
!796 = !DILocation(line: 59, column: 3, scope: !797)
!797 = !DILexicalBlockFile(scope: !793, file: !1, discriminator: 1)
!798 = !DILocation(line: 60, column: 3, scope: !793)
!799 = !DILocation(line: 61, column: 3, scope: !793)
!800 = !DILocation(line: 63, column: 1, scope: !779)
